Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: `Lazarus development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
fr: `Le développement en Lazarus pour Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
gl: `Desenvolvemento de Lazarus para Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>` __
it: `Sviluppo di Lazarus per Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__

source: `Geany on Ubuntu Touch device as text editor, source code editor, debugger and compiler for multiple languages <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
fr: `Geany sur les appareils Ubuntu Touch comme éditeur de texte, éditeur de code source, débogueur et compilateur pour de multiples langages <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
gl: `Geany no dispositivo Ubuntu Touch como editor de texto, editor de código fonte, depurador e compilador para varios idiomas <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html > `__
it: `Geany su dispositivi Ubuntu Touch come editor di testo e di codice, debugger e compilatore per diversi linguaggi <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`_

source: `Publish your existing Qt QML app to Ubuntu Touch using QMake (Video) <https://youtu.be/ehqlwRNrfO0>`__
fr: `Publier votre application Qt QML existante sur Ubuntu Touch en utilisant QMake (Video) <https://youtu.be/ehqlwRNrfO0>`__
gl: `Publica o teu aplicativo Qt QML existente en Ubuntu Touch usando QMake (vídeo) <https://youtu.be/ehqlwRNrfO0>` __
it: Pubblicare un'applicazione Qt QML esistente su Ubuntu Touch usando QMake (Video) <https://youtu.be/ehqlwRNrfO0>`__

source: `Publish your existing Qt QML app to Ubuntu Touch using CMake (Video) <https://youtu.be/c2sq6aLeGec>`__
fr: `Publier votre application Qt QML existante sur Ubuntu Touch en utilisant CMake (Video) <https://youtu.be/c2sq6aLeGec>`__
gl: `Publica o teu aplicativo Qt QML existente en Ubuntu Touch usando CMake (Vídeo) <https://youtu.be/c2sq6aLeGec>` __
it: Pubblicazione di un'applicazione Qt QML esistente su Ubuntu Touch utilizzando CMake (Video) <https://youtu.be/c2sq6aLeGec>`__

source: `Getting started with Clickable (Video) <https://youtu.be/TE-s5522v0Y>`__
fr: `Débuter avec Clickable (Video) <https://youtu.be/TE-s5522v0Y>`__
gl: `Comezando con Clickable (Vídeo) <https://youtu.be/TE-s5522v0Y>`__
it: Iniziare con Clickable (Video) <https://youtu.be/TE-s5522v0Y>`__

source: `Content Hub overview (Video) <https://youtu.be/AihwC2sPIk0>`__
fr: `Présentation générale de Content Hub (Video) <https://youtu.be/AihwC2sPIk0>`__
gl: `Presentación xeral de Hub (Vídeo) <https://youtu.be/AihwC2sPIk0>`__
it: Panoramica di Content Hub (Video) <https://youtu.be/AihwC2sPIk0>`__

source: `Import files to your app with Content Hub (Video) <https://youtu.be/q6zzM16jw1U>`__
fr: `Importer des fichiers dans votre application avec Content Hub (Video) <https://youtu.be/q6zzM16jw1U>`__
gl: `Importa ficheiros ao teu aplicativo con Content Hub (vídeo) <https://youtu.be/q6zzM16jw1U>` __
it: Importare i file nella vostra applicazione con Content Hub (Video) <https://youtu.be/q6zzM16jw1U>`__

source: Handle C++ dependencies with Clickable
fr: Gérer les dépendances C++ avec Clickable
gl: Manexa as dependencias de C ++ con Clickable
it: Gestire le dipendenze del C++ con Clickable

source: If an app depends on a library that is not pre-installed in Ubuntu Touch, the app needs to ship it inside the click package. This guide shows how this can be done with Clickable.
fr: Si une application dépend d'une bibliothèque qui n'est pas pré-installée dans Ubuntu Touch, l'application doit l'inclure dans le paquet clic. Ce guide montre comment cela peut être fait avec Clickable.
gl: Se un aplicativo depende dunha biblioteca que non está preinstalada en Ubuntu Touch, o aplicativo deberá enviala dentro do paquete de clic. Esta guía mostra como se pode facer isto con Clickable.
it: Se un'app dipende da una libreria che non è preinstallata in Ubuntu Touch, l'app deve fornirla all'interno del pacchetto click. Questa guida mostra come farlo con Clickable.

source: Building
fr: Construction
gl: Construción
it: Costruzione

source: Sometimes libraries are available pre-built, allowing you to skip the build step. Compiling your dependency is recommended though, as it gives you more control over the whole process and may lead to better results (e.g. better performance or smaller package sizes).
fr: Parfois, les bibliothèques sont disponibles pré-construites, ce qui vous permet de sauter l'étape de la construction. Il est toutefois recommandé de compiler votre dépendance, car cela vous donne plus de contrôle sur l'ensemble du processus et peut conduire à de meilleurs résultats (par exemple, de meilleures performances ou des paquets de taille plus réduite).
gl: Ás veces, as bibliotecas están dispoñibles previamente, o que lle permite saltar o paso de compilación. Recoméndase recompilar a súa dependencia, xa que lle proporciona máis control sobre todo o proceso e pode levar a mellores resultados (por exemplo, un mellor rendemento ou tamaños de paquetes máis pequenos).
it: A volte le librerie sono disponibili pre-costruite, consentendo di saltare la fase di compilazione. La compilazione della dipendenza è comunque consigliata, in quanto consente di avere un maggiore controllo sull'intero processo e può portare a risultati migliori (ad esempio, prestazioni migliori o dimensioni ridotte del pacchetto).

source: Compilation
gl: Ubicación
it: Compilazione

source: Put the library's source code at ``libs/LIBNAME`` (replacing ``LIBNAME`` by the library's name), because this is where clickable will look for it by default. If the dependency source code is available as a git repository, it is a good idea to add it as a `git submodule <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_. Otherwise add a script to download the sources.
fr: Déposez le code source de la bibliothèque dans ``libs/LIBNAME`` (en remplaçant ``LIBNAME`` par le nom de la bibliothèque), car c'est ici que Clickable la cherchera par défaut. Si le code source de la dépendance est disponible dans un dépôt Git, c'est une bonne idée de l'ajouter en tant que `sous-module Git <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_. Autrement, ajoutez un script pour télécharger les sources.
gl: Coloque o código fonte da biblioteca en "libs / LIBNAME" (substituíndo "LIBNAME" polo nome da biblioteca), porque é aquí onde se pode premer por defecto. Se o código fonte de dependencia está dispoñible como repositorio git, é unha boa idea engadilo como `submódulo git <https://git-scm.com/book/de/v1/Git-Tools-Submodule>` _ . Se non, engada un script para descargar as fontes.
it: Mettere il codice sorgente della libreria in ``libs/LIBNAME`` (sostituendo ``LIBNAME`` con il nome della libreria), perché è qui che clickable la cercherà per impostazione predefinita. Se il codice sorgente della dipendenza è disponibile come repository git, è una buona idea aggiungerlo come `git submodule <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_. Altrimenti, aggiungere uno script per scaricare i sorgenti.

source: Add a `libraries section <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ to your clickable.json, like this:
fr: Ajoutez une `section bibliothèques <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ à votre fichier clickable.json comme ceci :
gl: Engade unha `sección de bibliotecas <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>` _ ao teu clickable.json, así:
it: Aggiungere una sezione `libraries <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ al file clickable.json, in questo modo:

source: If the library does not contain a CMake configuration, you need to use the `qmake` or `custom` builder instead.
gl: Se a biblioteca non contén unha configuración de CMake, deberá empregar o constructor `qmake` ou` personalizado`.

source: Optionally, configure the compilation by adding ``build_args``, which may look like this:
fr: Facultativement, configurez la compilation en ajoutant ``build_args``, ce qui pourrait ressembler à cela :
gl: Opcionalmente, configure a compilación engadindo "build_args", que pode ter este aspecto:
it: Opzionalmente, si può configurare la compilazione aggiungendo ``build_args``, che può essere simile a questo:

source: Most build arguments are project specific. Therefore, study the library's build instructions and also look for ``option`` settings in its ``CMakeLists.txt`` .
fr: La plupart des arguments de compilation sont spécifiques au projet. Aussi, étudiez les instructions de compilation des bibliothèques et cherchez également un paramètre ``option`` dans son fichier ``CMakeLists.txt`` .
gl: A maioría dos argumentos de compilación son específicos do proxecto. Polo tanto, estuda as instrucións de compilación da biblioteca e tamén busca configuración de "opción" no seu "CMakeLists.txt".
it: La maggior parte degli argomenti di compilazione sono specifici del progetto. Per questo motivo, si devono studiare le istruzioni di compilazione della libreria e cercare anche le impostazioni delle ``opzioni'' nel suo ``CMakeLists.txt''.

source: To actually build the library for all architectures run ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` and ``clickable build-libs --arch amd64``. Don't forget to mention this step in your README, so that others can reproduce the build process.
fr: Pour réellement compiler la bibliothèque pour toutes les architectures exécutez ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` et ``clickable build-libs --arch amd64``. N'oubliez pas de mentionner cette étape dans votre fichier README, afin que d'autres puissent reproduire le processus de compilation.
gl: Para construír realmente a biblioteca para todas as arquitecturas executa "build-libs clickable --arch armhf", "build-libs clickable --arch arm64" e "build-libs clickable --arch amd64". Non esquezas mencionar este paso no teu README, para que outros poidan reproducir o proceso de compilación.
it: Per costruire effettivamente la libreria per tutte le architetture, eseguire ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` e ``clickable build-libs --arch amd64``. Non dimenticate di menzionare questo passaggio nel vostro README, in modo che altri possano riprodurre il processo di compilazione.

source: See how `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>`_ uses the libraries feature to build its dependency tdlib.
fr: Voyons comment `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>`_ utilise utilise la fonctionnalité des bibliothèques pour construire sa dépendance avec Tdlib.
gl: Vexa como `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>` _ usa a función de bibliotecas para construír a súa dependencia tdlib.
it: Si veda come `Teleporti cliccabili.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>`_ utilizza la funzione librerie per costruire la sua dipendenza tdlib.

source: Pre-built
fr: Précompilation
gl: Precompilación
it: Pre-costruzione

source: If you compiled your library as described above, skip this step.
fr: Si vous avez compilé votre bibliothèque comme décrit ci-dessus, sautez cette étape.
gl: Se compilou a súa biblioteca como se describiu anteriormente, omita este paso.
it: Se hai compilato la tua libreria come descritto sopra, salta questo passaggio.

source: A pre-built library is usually only available as a shared object that needs to be linked dynamically. Furthermore, it may contain components that you don't need, resulting in a bloated app. It may even miss something that you could achieve by compiling it yourself. Sometimes, a library is available in the Ubuntu Repositories, but is not installable for the architecture you need (likely ``armhf`` or ``arm64``). In this case you have to compile the library as described above.
fr: En général, une bibliothèque pré-compilée est utilisable uniquement comme un objet partagé lié dynamiquement. En plus, elle peut contenir des composants que vous n'utilisez pas et qui risquent d'alourdir votre application. Une bibliothèque peut aussi faire moins bien des choses que vous pourriez compiler vous-même. Parfois, une bibliothèque est disponible dans les dépôts d'Ubuntu mais n'est pas installable pour l'architecture que vous désirez (le plus souvent ``armhf`` ou ``arm64``). Dans ce cas, vous devrez compiler la bibliothèque comme décrit ci-dessus.
gl: Unha biblioteca preconstruída normalmente só está dispoñible como un obxecto compartido que precisa estar ligado dinámicamente. Ademais, pode conter compoñentes que non precisa, o que resulta nun aplicativo inchado. Incluso pode botar de menos algo que poida conseguir compilándoo vostede mesmo. Ás veces, hai unha biblioteca dispoñible nos Repositorios de Ubuntu, pero non se pode instalar para a arquitectura que precisa (probablemente "armhf" ou "arm64"). Neste caso tes que compilar a biblioteca como se describiu anteriormente.
it: Una libreria precostituita è solitamente disponibile solo come oggetto condiviso che deve essere collegato dinamicamente. Inoltre, può contenere componenti che non servono, con il risultato di un'applicazione gonfia. Potrebbe anche mancare qualcosa che si potrebbe ottenere compilandola da soli. A volte, una libreria è disponibile nei repository di Ubuntu, ma non è installabile per l'architettura necessaria (probabilmente ``armhf`` o ``arm64``). In questo caso è necessario compilare la libreria come descritto sopra.

source: If the library is available in the Ubuntu Repositories, you can add it to the dependencies list, like this:
fr: Si la bibliothèque est disponible dans les dépôts d'Ubuntu, vous pouvez l'ajouter à la liste des dépendances comme ceci :
gl: Se a biblioteca está dispoñible nos Repositorios de Ubuntu, pode engadila á lista de dependencias, así:
it: Se la libreria è disponibile nei repository di Ubuntu, è possibile aggiungerla all'elenco delle dipendenze, in questo modo:

source: Clickable will install the specified package automatically for the target architecture inside the build container. An example can be found in `Guitar Tools' clickable.json <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.
fr: Clickable va installer automatiquement le paquet spécifié pour l'architecture cible dans le conteneur servant à la compilation. Un exemple peut être trouvé dans le fichier `clickable.json de Guitar Tools <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.
gl: Se é posible premer, instalará o paquete especificado automaticamente para a arquitectura de destino dentro do recipiente de compilación. Un exemplo pódese atopar en "Guitar Tools" clickable.json <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4> `_.
it: Clickable installerà automaticamente il pacchetto specificato per l'architettura di destinazione all'interno del contenitore di build. Un esempio si trova in `Guitar Tools' clickable.json <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.

source: If the library can be found in a PPA, you can add the PPA to the clickable.json, too. For example:
fr: Si la bibliothèque est incluse dans un PPA, vous pouvez aussi ajouter ce PPA dans le fichier clickable.json. Par exemple :
gl: Se a biblioteca se pode atopar nun PPA, tamén pode engadir o PPA ao clickable.json. Por exemplo:
it: Se la libreria si trova in un PPA, si può aggiungere anche il PPA al file clickable.json. Per esempio:

source: Otherwise add a script to download the pre-built library.
fr: Sinon, ajoutez un script pour télécharger la bibliothèque pré-compilée.
gl: Se non, engada un script para descargar a biblioteca pre-construída.
it: Altrimenti, aggiungere uno script per scaricare la libreria precostituita.

source: Usage
fr: Utilisation
gl: Uso
it: Utilizzo

source: First, you need to specify the include directory where the headers can be found that you include into the app's source code. Second, you need to link the library's binary against your app's binary.
fr: Tout d'abord, vous devez spécifier le répertoire d'inclusion où se trouvent les en-têtes que vous devez intégrer dans le code source de l'application. Puis, vous devez lier le binaire de la bibliothèque à celui de votre application.
gl: En primeiro lugar, cómpre especificar o directorio de inclusión onde se poden atopar as cabeceiras que inclúe no código fonte do aplicativo. En segundo lugar, cómpre ligar o binario da biblioteca co binario do seu aplicativo.
it: In primo luogo, è necessario specificare la directory di inclusione in cui si trovano le intestazioni da includere nel codice sorgente dell'applicazione. In secondo luogo, è necessario collegare il binario della libreria al binario dell'applicazione.

source: In case the library contains a CMake configuration file, you can use the `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_ command, which provides you with a target to link against or variables pointing to the library's binary and include directories. The additional lines on your CMakeLists.txt then may look like:
fr: Si la bibliothèque contient un fichier de configuration CMake, vous pouvez utiliser la commande `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_ , qui vous donnera la cible pour la liaison ou des variables pointant vers le binaire de la bibliothèque et ses dossiers d'en-têtes. Les lignes supplémentaires dans votre fichier CMakeLists.txt peuvent ressembler à cela :
gl: No caso de que a biblioteca conteña un ficheiro de configuración de CMake, pode usar o comando `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>` _, que lle proporciona un destino para ligalo ou variables que apuntan ao binario da biblioteca e inclúen directorios. As liñas adicionais do CMakeLists.txt poden parecer:
it: Nel caso in cui la libreria contenga un file di configurazione di CMake, si può usare il comando `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_, che fornisce un target da collegare o variabili che puntano alle directory binarie e include della libreria. Le righe aggiuntive del file CMakeLists.txt potrebbero quindi essere simili a:

source: The ``find_package`` command usually defines the path to the include directory as ``SOMELIBRARY_INCLUDE_DIRS`` and the library's binaries as ``SOMELIBRARY_LIBS`` (check on the library's documentation on what their CMake configuration provides exactly). Use them with the ``include_directories`` and ``target_link_libraries`` commands. See the `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>`_ for a real world example.
fr: La commande ``find_package`` décrit habituellement le chemin du répertoire d'inclusion comme ``SOMELIBRARY_INCLUDE_DIRS`` et les binaires de la bibliothèque comme ``SOMELIBRARY_LIBS`` (vérifiez dans la documentation de la bibliothèque ce que leur configuration CMake fournit exactement). Utilisez-les avec les commandes ``include_directories`` et ``target_link_libraries``. Voir `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>`_ pour un exemple concret.
gl: O comando "find_package" normalmente define o camiño ao directorio include como "SOMELIBRARY_INCLUDE_DIRS" e os binarios da biblioteca como "SOMELIBRARY_LIBS" (comprobe na documentación da biblioteca o que a súa configuración CMake proporciona exactamente). Úseas cos comandos "include_directories" e "target_link_libraries". Vexa o `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>` _ para un exemplo do mundo real.
it: Il comando ``find_package`` di solito definisce il percorso della directory di inclusione come ``SOMELIBRARY_INCLUDE_DIRS`` e i binari della libreria come ``SOMELIBRARY_LIBS`` (verificare nella documentazione della libreria cosa prevede esattamente la configurazione di CMake). Usarli con i comandi ``include_directories`` e ``target_link_libraries``. Vedere il file `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>`_ per un esempio reale.

source: At this point you should already be able to test with Clickable's desktop mode running ``clickable desktop``.
fr: À ce stade, vous devriez déjà pouvoir tester le mode ordinateur de Clickable en lançant ``clickable desktop``.
gl: Neste momento xa debería ser capaz de probar co modo de escritorio de Clickable que executa "escritorio que se pode premer".
it: A questo punto si dovrebbe già essere in grado di testare la modalità desktop di Clickable eseguendo ``clickable desktop``.

source: Deployment
fr: Déploiement
gl: Despregamento
it: Distribuzione

source: If you linked the library statically, you can skip this step, as the library's binary is already inside your app's binary.
fr: Si vous avez lié votre bibliothèque de façon statique, vous pouvez passer cette étape. En effet, le binaire de cette bibliothèque est alors déjà inclus à celui de votre application.
gl: Se ligaches a biblioteca de xeito estático, podes omitir este paso, xa que o binario da biblioteca xa está dentro do binario do teu aplicativo.
it: Se la libreria è collegata staticamente, si può saltare questo passaggio, poiché il binario della libreria è già all'interno del binario dell'applicazione.

source: Find out which shared object files (``*.so``) you need to ship. You can do so by starting the app on your device via ``clickable && clickable logs``. You should see an error message telling you which shared object file was missing.
fr: Trouvez quels fichiers objets partagés (``*.so``) sont à intégrer dans le paquet. Pour cela, démarrez l'application sur votre appareil en passant par ``clickable && clickable logs``. Vous devriez voir un message d'erreur vous indiquant quels objets partagés sont manquants.
gl: Descubra os ficheiros de obxectos compartidos ("* .so") que precisa enviar. Podes facelo iniciando o aplicativo no teu dispositivo a través de "Rexistros que se poden premer e premer". Debería ver unha mensaxe de erro que lle indicaba o ficheiro de obxecto compartido que faltaba.
it: Scoprire quali file di oggetti condivisi (``*.so``) è necessario spedire. È possibile farlo avviando l'applicazione sul dispositivo tramite ``clickable && clickable logs``. Dovrebbe apparire un messaggio di errore che indica il file di oggetti condivisi mancante.
