Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Corners
it: Angoli

source: Curved corners are preferred if possible. The following picture shows a zoom on the default outer and inner curvatures, with nodes and Bezier handle. The default curvature can be scaled down when the shape is smaller.
it: Se possibile, sono preferibili gli angoli curvi. L'immagine seguente mostra uno zoom sulle curvature esterne e interne predefinite, con i nodi e la maniglia di Bezier. La curvatura predefinita può essere ridotta quando la forma è più piccola.

source: Arrows
it: Frecce

source: A chevron symbol is used for navigation arrows. The arrowhead is an isosceles triangle where the two equal sides are slightly curved (following the pattern of the Y character).
it: Per le frecce di navigazione si utilizza il simbolo del chevron. La punta della freccia è un triangolo isoscele in cui i due lati uguali sono leggermente curvati (secondo lo schema del carattere Y).

source: Opacity
it: Opacità

source: 50% opacity is used to reflect the status of an indicator. In case of a double space (enabled and disabled, for example), the opacity of the whole icon changes. When the status allows a range of values, the opacity of a single portion of icon can be altered.
it: L'opacità al 50% viene utilizzata per riflettere lo stato di un indicatore. In caso di doppio spazio (abilitato e disabilitato, ad esempio), cambia l'opacità dell'intera icona. Quando lo stato consente una gamma di valori, è possibile modificare l'opacità di una singola porzione dell'icona.

source: Grid
it: Griglia

source: Interface icons are designed for 96x96 pixels, with at least 4 pixels of margin on every side.
it: Le icone dell'interfaccia sono progettate per 96x96 pixel, con almeno 4 pixel di margine su ogni lato.

source: Design concepts
it: Concetti di progettazione

source: As designed by `Canonical <https://www.canonical.com/>`__, we use the following system palette (from `Michał Prędotka <http://colors.mivoligo.com/>`__ and `Ubuntu documentation <https://docs.ubuntu.com/phone/en/apps/api-qml-development/Ubuntu.Components.UbuntuColors>`__):
it: Come progettato da `Canonical <https://www.canonical.com/>`__, usiamo la seguente tavolozza di sistema (da `Michał Prędotka <http://colors.mivoligo.com/>`__ e dalla documentazione di `Ubuntu <https://docs.ubuntu.com/phone/en/apps/api-qml-development/Ubuntu.Components.UbuntuColors>`__):

source: Operating system and app palette
it: Sistema operativo e tavolozza delle app

source: #FFFFFF White
it: #FFFFFF Bianco

source: Recommended for background on Ambiance theme (light theme) or regular text on Suru Dark theme.
it: Consigliato per lo sfondo del tema Ambiance (tema chiaro) o per il testo normale del tema Suru Dark.

source: Recommended for regular text on Ambiance theme or background in Suru Dark.
it: Consigliato per testo normale su tema Ambiance o sfondo in Suru Dark.

source: Recommended for foreground colours in dark themes.
it: Consigliato per i colori in primo piano nei temi scuri.

source: #5D5D5D Slate
it: #5D5D5D Ardesia

source: Recommended for text and action icons.
it: Consigliato per le icone di testo e di azione.

source: #666666 Graphite
it: #666666 Grafite

source: Recommended for coloring dark themes' background.
it: Consigliato per colorare lo sfondo di temi scuri.

source: #888888 Ash
it: #888888 Cenere

source: Recommended for subtitles and other tertiary content.
it: Consigliato per sottotitoli e altri contenuti terziari.

source: #CDCDCD Silk
it: #CDCDCD Seta

source: Recommended for neutral action buttons and secondary text.
it: Consigliato per pulsanti di azione neutri e testo secondario.

source: #F7F7F7 Porcelain
it: #F7F7F7 Porcellana

source: Recommended for foregrounds.
it: Consigliato per i primi piani.

source: #335280 Blue
it: #335280 Blu

source: Recommended for progress bars, selected areas, text selection and text cursor. Also neutral actions (Ambiance).
it: Consigliato per barre di avanzamento, aree selezionate, selezione del testo e cursore di testo. Anche azioni neutre (Ambiance).

source: #19B6EE Light Blue
it: #19B6EE Azzurro

source: Recommended for progress bars, selected areas, text selection and text cursor. Also neutral actions (SuruDark).
it: Consigliato per barre di avanzamento, aree selezionate, selezione del testo e cursore di testo. Anche azioni neutre (SuruDark).

source: #0E8420 Green
it: #0E8420 Verde

source: Recommended for positive action buttons (Ambiance).
it: Consigliato per i pulsanti ad azione positiva (Ambiance).

source: #3EB34F Light Green
it: #3EB34F Verde Chiaro

source: Recommended for positive action buttons (SuruDark).
it: Consigliato per i pulsanti ad azione positiva (SuruDark).

source: #C7162B Red
it: #C7162B Rosso

source: Recommended for negative and irreversible action buttons, errors and alerts (Ambiance).
it: Consigliato per pulsanti di azione negativi e irreversibili, errori e avvisi (Ambiance).

source: #ED3146 Light Red
it: #ED3146 Rosso Chiaro

source: Recommended for negative and irreversible action buttons, errors and alerts (SuruDark).
it: Consigliato per pulsanti di azione negativi e irreversibili, errori e avvisi (SuruDark).

source: #E95420 Orange
it: #E95420 Arancione

source: Orange is recommended for branded elements, focus and intensity.
it: L'arancione è consigliato per gli elementi di marca, la concentrazione e l'intensità.

source: Typography
it: Tipografia

source: Fonts
it: Caratteri

source: Our default font is `Ubuntu <https://design.ubuntu.com/font/>`__ `[2] <https://en.wikipedia.org/wiki/Ubuntu_(typeface)>`__ installed in the system.
it: Il nostro font predefinito è `Ubuntu <https://design.ubuntu.com/font/>`__ `[2] <https://en.wikipedia.org/wiki/Ubuntu_(typeface)>`__ installato nel sistema.

source: For the font sizes to be consistent across devices, instead of setting the font size as a number of pixels or points, it is imperative to define the font size in terms of size names:
it: Affinché le dimensioni dei caratteri siano coerenti tra i vari dispositivi, invece di impostare le dimensioni dei caratteri come numero di pixel o di punti, è indispensabile definire le dimensioni dei caratteri in termini di nomi di dimensioni:

source: Font Size Name
it: Dimensione del carattere Nome

source: Phone
it: Telefono

source: 4" HD Screen
it: Schermo 4" HD

source: 10" HD screen
it: Schermo 10" HD

source: small
it: piccolo

source: medium
it: medio

source: large
it: grande

source: Units
it: Unità

source: Resolution Independence Approach
it: Risoluzione Indipendenza Approccio

source: The objective of resolution independence is to make it easy for graphical user interfaces in Ubuntu Touch to scale to all the form factors that Ubuntu Touch targets: phones, tablets, laptops and desktops. The approach taken combines simplicity for the designers and developers with visual fidelity, quality and usability.
it: L'obiettivo dell'indipendenza della risoluzione è quello di rendere facile per le interfacce utente grafiche in Ubuntu Touch per scalare a tutti i fattori di forma che Ubuntu Touch obiettivi: telefoni, tablet, computer portatili e desktop. L'approccio preso coniuga semplicità per i designer e gli sviluppatori con fedeltà visiva, qualità e usabilità.

source: Measurement Units
it: Unità di misura

source: Grid Unit
it: Unità di griglia o rete

source: A measurement unit called the *grid unit* is defined, abbreviated *gu.* 1 grid unit translates to a given number of pixels depending on the type of screen that the user interface is displayed on. For example, on a laptop computer 1 grid unit will typically translate to 8 pixels. The number of pixels per grid unit is chosen in order to preserve the perceived visual size of UI elements and therefore depends on the density of the display and the distance the user is to the screen. We also ensure that 1 grid unit is always an integer number of pixel.
it: Un'unità di misura chiamata *grid unit* è definita, abbreviata *gu.* 1 unità di griglia si traduce in un dato numero di pixel a seconda del tipo di schermo su cui viene visualizzata l'interfaccia utente. Ad esempio, su un computer portatile 1 unità di griglia in genere si tradurrà a 8 pixel. Il numero di pixel per unità di griglia è scelto per preservare la dimensione visiva percepita degli elementi UI e quindi dipende dalla densità del display e dalla distanza che l'utente è sullo schermo. Garantiamo inoltre che 1 unità di griglia sia sempre un numero intero di pixel.

source: Conversion
it: Conversione

source: Most laptops
it: La maggior parte dei computer portatili

source: High DPI laptops
it: Portatili alta DPI

source: Phone with 4 inch screen at HD resolution (around 720x1,280 pixels)
it: Telefono con schermo da 4 pollici a risoluzione HD (circa 720x1280 pixel)

source: Tablet with 10 inch screen at HD resolution (around 720x1,280 pixels)
it: Tablet con schermo da 10 pollici a risoluzione HD (circa 720x1280 pixel)

source: Density Unit
it: Unità di densità

source: Exceptionally, in order to accommodate for the rare cases where measurements of less than 1 gu are needed another unit is available: the *density independent pixel,* abbreviated dp. 1 dp typically translates to 1 pixel on laptops and low density mobile phones and tablets.
it: Eccezionalmente, per accogliere i rari casi in cui sono necessarie misurazioni di meno di 1 gu è disponibile un'altra unità: il *density indipendente pixel,* abbreviato dp. 1 dp si traduce in genere a 1 pixel su computer portatili e telefoni cellulari a bassa densità e tablet.

source: Use
it: Uso

source: Device Sizes
it: Dimensioni del dispositivo

source: Device Grid Units
it: Unità di gliglia rete del dispositivo

source: width
it: larghezza

source: height
it: altezza

source: E5 (portrait)
it: E5 (ritratto)

source: M10 HD (landscape)
it: M10 HD (paesaggio)

source: M10 FHD (landscape)
it: M10 FHD (paesaggio)

source: N5 (portrait)
it: N5 (ritratto)

source: Human interface guidelines
it: Linee guida interfaccia umana

source: Ubuntu Touch follows a modern and convergent design philosophy called Suru. We aim to keep developing the design started by Canonical.
it: Ubuntu Touch segue una filosofia di design moderna e convergente chiamata Suru. Vogliamo continuare a sviluppare il design iniziato da Canonical.

source: Suru meaning
it: Suru significa

source: Here at UBports we believe that everyone should have access to free, reliable, and trusted software that can be shared and developed by anyone. This has paved the way to allow the community to grow and prosper with freedom trust and collaboration. This integral belief has been translated into the design philosophy called Suru.
it: Qui a UBports crediamo che tutti dovrebbero avere accesso al software libero, affidabile e affidabile che può essere condiviso e sviluppato da chiunque. Questo ha spianato la strada per permettere alla comunità di crescere e prosperare con la libertà di fiducia e collaborazione. Questa credenza integrale è stata tradotta nella filosofia progettuale chiamata Suru.

source: Suru items from the Ubuntu values alluding to Japanese culture.
it: Gli elementi Suru dei valori Ubuntu alludono alla cultura giapponese.

source: The design of Suru is inspired by origami, because it gives us a solid and tangible foundation.
it: Il design di Suru si ispira agli origami, perché ci danno una base solida e tangibile.

source: Paper can be used in all areas of the design in two and three dimensional forms, because it is transferable and diverse.
it: La carta può essere utilizzata in tutte le aree del design in forme bidimensionali e tridimensionali, perché è trasferibile e diversificata.

source: Translated in design
it: Tradotto in design

source: Suru brings a precise yet organic structure to the Ubuntu Touch interface. The sharp lines and varying levels of transparency evoke the edges and texture of paper. All elements are placed deliberately, with the express aim of being easy for the user to identify and use.
it: Suru conferisce una struttura precisa ma organica all'interfaccia di Ubuntu Touch. Le linee nette e i vari livelli di trasparenza evocano i bordi e la consistenza della carta. Tutti gli elementi sono posizionati in modo deliberato, con l'obiettivo esplicito di essere facilmente identificabili e utilizzabili dall'utente.

source: When using a small layout, the information and functionality is folded into a compact object that can be refolded to expose different areas. As the layout size increases, the object can become progressively larger, allowing more of the information and functionality to be exposed at any one time.
it: Quando si utilizza un layout di dimensioni ridotte, le informazioni e le funzionalità sono racchiuse in un oggetto compatto che può essere ripiegato per esporre aree diverse. Con l'aumentare delle dimensioni del layout, l'oggetto può diventare progressivamente più grande, consentendo di esporre più informazioni e funzionalità alla volta.

source: Origami has long been associated with good fortune and represents the visual style for Ubuntu Touch. Origami folds are used to define the design.
it: Origami è stato a lungo associato con buona fortuna e rappresenta lo stile visivo per Ubuntu Touch. Le pieghe Origami sono utilizzate per definirne il design.

source: Simple details
it: Dettagli semplici

source: What is most important is that screen layouts retain a natural, rhythmic quality, and a neatness and clarity that helps the user find things quickly and use them intuitively.
it: Ciò che è più importante è che i layout dello schermo mantengono una qualità naturale, ritmica, e una nitidezza e chiarezza che aiuta l'utente a trovare le cose rapidamente e usarle in modo intuitivo.

source: Using subtle grids for accuracy
it: Utilizzo di griglie sottili per la precisione

source: The folds from origami produce simple graphical details that allow designers to create a subtle grid for positioning brand elements and components, such as logos, icons or copylines. This helps maintain focus on the main image or graphic element.
it: Le pieghe di origami producono semplici dettagli grafici che permettono ai progettisti di creare una griglia sottile per posizionare elementi e componenti del marchio, come loghi, icone o copylines. Questo aiuta a mantenere l'attenzione sull'immagine principale o l'elemento grafico.

source: Suru mood board
it: Scheda d'atmosfera Suru

source: Influences and inspiration
it: Influenza e ispirazione

source: Accessibility
it: Accessibilità

source: Accessibility is important to make all users to be able to use the operating system.
it: L'accessibilità è importante per rendere tutti gli utenti in grado di utilizzare il sistema operativo.

source: Inclusive palette and theme
it: Tavolozza e tema inclusi

source: We would like to create and implement color palettes helpful to people who have sight impairment:
it: Vorremmo creare e implementare tavolozze di colori utili per le persone che hanno problemi di vista:

source: Additional `palette proposal <http://colors.mivoligo.com/#color-blind>`__.
it: Ulteriore `tavolozza proposta <http://colors.mivoligo.com/#color-blind>`__.

source: A high contrast theme.
it: Un tema ad alto contrasto.

source: Adaptable font size theme.
it: Tema dimensione del carattere adattabile.

source: Input methods
it: Metodi di input

source: Apps should be accessible using any combination of mouse, touch, and keyboard.
it: Le app dovrebbero essere accessibili utilizzando qualsiasi combinazione di mouse, tocco e tastiera.

source: Convergence
it: Convergenza

source: Convergence is one of the milestones Ubuntu Touch wants to achieve. One app available across all screen sizes and input methods, such as mobile handsets, tablets, and laptops.
it: La convergenza è una delle pietre miliari che Ubuntu Touch vuole raggiungere. Una app disponibile in tutte le dimensioni dello schermo e i metodi di input, come telefoni cellulari, tablet e laptop.

source: Convergence refers to the ability to use the same code base across multiple hardware form factors. Multiple devices using the same code base allows for features to be developed once, then shipped on multiple device types. This reducing development time and cost. The goal is for Ubuntu Touch to provide a consistent experience, whether you are using it on a big screen with mouse and keyboard or on a small touchscreen.
it: Convergenza si riferisce alla capacità di utilizzare la stessa base di codice attraverso più fattori di forma hardware. I dispositivi multipli che utilizzano la stessa base di codice consentono di sviluppare funzionalità una volta, quindi spediti su più tipi di dispositivi. Questo riduce i tempi e i costi di sviluppo. L'obiettivo è che Ubuntu Touch fornisca un'esperienza coerente, sia che lo utilizzi su un grande schermo con mouse e tastiera o su un piccolo touchscreen.

source: Screen size
it: Dimensione dello schermo

source: Ubuntu Touch Tweak Tool app
it: Applicazione strumento ritocco Ubuntu Touch

source: Main page stays as the main page on phones or on the left on bigger screen devices. Additional pages on the phone, can be displayed at variable sizes on the right on bigger screens.
it: La pagina principale rimane come la pagina principale sui telefoni o a sinistra sui dispositivi di schermo più grandi. Ulteriori pagine sul telefono, possono essere visualizzate a dimensioni variabili a destra su schermi più grandi.

source: Input method
it: Metodo di input

source: Using touch, a user can swipe or long-press on a list item to reveal a contextual menu. Using a pointer (mouse or trackpad) a user can right-click the item to reveal the contextual menu. Using a keyboard a user can focus the desired item and press the MENU key to open the context menu.
it: Con il tatto, l'utente può scorrere o premere a lungo su un elemento dell'elenco per visualizzare un menu contestuale. Utilizzando un puntatore (mouse o trackpad), l'utente può fare clic con il pulsante destro del mouse sull'elemento per aprire il menu contestuale. Con la tastiera, l'utente può mettere a fuoco l'elemento desiderato e premere il tasto MENU per aprire il menu contestuale.

source: Other design considerations
it: Altre considerazioni sul progetto

source: Scaling images
it: Scalatura delle immagini

source: Scaling images is important in a convergent app. App icons and images can be created in scalable formats to improve their ability to scale.
it: La scalabilità delle immagini è importante in un'app convergente. Le icone e le immagini delle app possono essere create in formati scalabili per migliorare la loro capacità di scalare.

source: One of the most popular scalable formats is `SVG <https://en.wikipedia.org/wiki/Scalable_Vector_Graphics>`__. SVG files can be created using software like `Inkscape <https://inkscape.org/>`__.
it: Uno dei formati scalabili più popolari è `SVG <https://en.wikipedia.org/wiki/Scalable_Vector_Graphics>`__. I file SVG possono essere creati con software come `Inkscape <https://inkscape.org/>`__.

source: One particularity of qml, though, is that SVGs are rendered to use less memory, losing the advantages of scalability. When using a SVG file in an ``Image`` element we can use the property called ``sourceSize``. This will define the rendered size of the SVG image. A SVG image with a ``sourceSize`` width and height of 252 pixels, will be rendered as if the scalable image would be a png of 252 per 252 pixels.
it: Una particolarità di qml, però, è che gli SVG vengono resi per utilizzare meno memoria, perdendo i vantaggi della scalabilità. Quando si usa un file SVG in un elemento ``Image``, si può usare la proprietà ``sourceSize``. Questa definisce la dimensione dell'immagine SVG resa. Un'immagine SVG con una larghezza e un'altezza di ``sourceSize`` di 252 pixel, sarà resa come se l'immagine scalabile fosse una png di 252 per 252 pixel.

source: Different rendered sizes of the same svg image
it: Diverse dimensioni di rendering della stessa immagine svg

source: It is not advisable to define ``sourceSize`` as a relative size to avoid performance issues. A good practice is defining ``sourceSize`` based on a set list of thresholds. In the example below the image.svg will be rendered 60 per 60 grid units if the main view is bigger that 70 grid units but as an image of 40 per 40 grid units in the other cases. By defining these thresholds, we get scalable images without a huge performance cost.
it: Non è consigliabile definire ``sourceSize`` come dimensione relativa per evitare problemi di prestazioni. Una buona pratica è definire ``sourceSize`` in base a un elenco di soglie. Nell'esempio seguente, l'immagine.svg sarà resa 60 per 60 unità di griglia se la vista principale è più grande di 70 unità di griglia, ma come immagine di 40 per 40 unità di griglia negli altri casi. Definendo queste soglie, si ottengono immagini scalabili senza un enorme costo in termini di prestazioni.

source: Read more about image performance in the `Qt wiki <https://wiki.qt.io/Performance_tip_Images>`__.
it: Per saperne di più sulle prestazioni delle immagini, consultate il wiki di `Qt <https://wiki.qt.io/Performance_tip_Images>`__.

source: Adding translations to your app makes it more accessible to international users. `Clickable <http://clickable.bhdouglass.com/>`__ will handle this process automatically, extracting new translatable strings into a pot file (the source strings of your app, to be translated).
it: L'aggiunta di traduzioni alla propria applicazione la rende più accessibile agli utenti internazionali. `Clickable <http://clickable.bhdouglass.com/>`__ gestirà questo processo automaticamente, estraendo le nuove stringhe traducibili in un file pot (le stringhe sorgente della vostra applicazione, da tradurre).

source: Marking a string to be translatable can be achieved like this i18n.tr(string). For example:
it: La marcatura di una stringa come traducibile può essere ottenuta in questo modo i18n.tr(stringa). Ad esempio:

source: More information and options can be found in this a bit outdated `tutorial on localization <http://web.archive.org/web/https://docs.ubuntu.com/phone/en/apps/qml/tutorials-internationalizing-your-app>`__ an app.
it: Maggiori informazioni e opzioni si possono trovare in questo un po' datato`tutorial sulla localizzazione <http://web.archive.org/web/https://docs.ubuntu.com/phone/en/apps/qml/tutorials-internationalizing-your-app>`__ un'app.
