Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: The halium-boot initramfs expects ``/dev/console`` to be a console device and will not start init if it is not available. This is commonly the case on recent devices, because they either have UART disabled or ``console=`` is not specified (null) by default. This can be fixed by supplying ``console=tty0`` as the last argument in the kernel cmdline. To achieve this, proceed as follows:
fr: L'initramfs de halium-boot s'attend à ce que ``/dev/console`` soit une console système et ne démarrera pas si elle n'est pas disponible. C'est généralement pas le cas sur les appareils récents, car, soit ils n'ont pas d'UART activé, soit ils n'ont pas de ``console=`` défini par défaut. Cela peut être réglé en rajoutant ``console=tty0`` à la fin des arguments du noyau. Pour ce faire, suivez les instructions suivantes :
gl: O initramfs de halium-boot espera que "/ dev / console" sexa un dispositivo de consola e non iniciará init se non está dispoñible. Normalmente é o caso dos dispositivos recentes, porque teñen UART desactivado ou "console =" non se especifica (nulo) por defecto. Isto pódese solucionar introducindo "console = tty0" como último argumento na liña cmd do núcleo. Para conseguilo, proceda do seguinte xeito:

source: It should be done in the makefile named ``BoardConfig.mk`` (or ``BoardConfigCommon.mk``) located in the root directory of your device tree, e.g. ``~/halium/device/<vendor>/<model_codename>/BoardConfig.mk``
fr: Cela devrait être fait dans le makefile nommé ``BoardConfig.mk`` (ou ``BoardConfigCommon.mk``) situé à la racine des sources de votre appareil, ex. ``~/halium/device/<vendeur>/<nom_de_code_du_modèle>/BoardConfig.mk``
gl: Debería facerse no makefile chamado "BoardConfig.mk" (ou "BoardConfigCommon.mk") situado no directorio raíz da árbore do dispositivo, por exemplo. "~ / halium / device / <vendor> / <model_codename> / BoardConfig.mk"

source: Add the following line::
fr: Ajoutez les lignes suivantes :
gl: Engadir a seguinte liña::

source: If your makefile already includes a line beginning with ``BOARD_KERNEL_CMDLINE``, you may add it just below that to keep things tidy.
fr: Si votre makefile contient déja une ligne commençant par ``BOARD_KERNEL_CMDLINE``, vous pouvez le rajouter juste en dessous pour tout garder en ordre.
gl: Se o teu arquivo de make xa inclúe unha liña que comeza con "BOARD_KERNEL_CMDLINE", podes engadila xusto debaixo diso para manter as cousas ordenadas.

source: The above method, although the preferred one, may not work for some Samsung devices. The result will be that you cannot get access to the device through ssh after boot, and Unity 8 will not be able to start. If you run into this problem, you can specify the setting in your device's kernel config file instead. Add the following lines::
fr: La méthode ci-dessus, bien que recommandée, peut ne pas fonctionner pour certains appareils Samsung. Le résultat sera que vous ne pourrez pas accéder à l'appareil par SSH après le démarrage et qu'Unity 8 ne pourra pas démarrer. Si vous rencontrez ce problème, vous pouvez spécifier le paramètre dans le fichier de configuration du noyau de votre périphérique à la place. Ajoutez les lignes suivantes ::
gl: É posible que o método anterior, aínda que sexa o preferido, non funcione nalgúns dispositivos Samsung. O resultado será que non pode acceder ao dispositivo a través de ssh despois do arranque e Unity 8 non poderá iniciarse. Se ten este problema, pode especificar a configuración no ficheiro de configuración do núcleo do dispositivo. Engade as seguintes liñas:

source: In rare cases the bootloader overwrites the kernel command line argument, rendering the setting above useless. This is the case for the Google Pixel 3a (sargo). To deal with this issue, replicate `this commit <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>`_.
fr: Dans de rares cas, le chargeur d'amorçage écrase l'argument de la ligne de commande du noyau, ce qui rend le paramètre ci-dessus inutile. C'est le cas pour le Google Pixel 3a (sargo). Pour régler ce problème, répliquez `ce code <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>`_.
gl: En poucos casos, o cargador de arranque sobrescribe o argumento da liña de comandos do núcleo, facendo inútil a configuración anterior. É o caso do Google Pixel 3a (sargo). Para tratar este problema, replique "este commit <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>" _.

source: Build halium-boot.img and system.img
fr: Construction de halium-boot.img et de system.img
gl: Construír halium-boot.img e system.img

source: You are now ready to build the two image files to incorporate the changes you have made. These changes have an impact on both the boot image and the system image, so you will need to rebuild both. The procedure is a simple and straight forward one. Run the sequence of commands below, where BUILDDIR is the root of your halium source tree (e.g. ``~/halium``):
fr: Vous êtes maintenant prêt à construire les deux fichiers images pour intégrer les changements que vous avez apportés. Ces changements ont un impact à la fois sur l'image de démarrage et sur l'image du système, vous devrez donc les reconstruire toutes les deux. La procédure est simple et directe. Exécutez la séquence de commandes ci-dessous, où BUILDDIR est la racine de votre arborescence source d'Halium (par exemple "~/halium") :
gl: Agora está preparado para construír os dous ficheiros de imaxe para incorporar os cambios que fixo. Estes cambios teñen un impacto tanto na imaxe de inicio como na imaxe do sistema, polo que necesitará reconstruír ambos. O procedemento é sinxelo e directo. Executa a secuencia de comandos a continuación, onde BUILDDIR é a raíz da árbore de orixe do halium (por exemplo, "~ / halium"):

source: Troubleshooting the build process
fr: Résolution des problèmes lors du processus de construction
gl: Resolución de problemas do proceso de compilación

source: Refer to the `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_
fr: Consultez le`gui de du portage d'Halium <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_
gl: Consulte a `Guía de portada de Halium <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>` _

source: Common errors
fr: Erreurs fréquentes
gl: Erros comúns

source: Known issues when building the images for UT
fr: Problèmes connus lors de la construction des images pour Ubuntu Touch
gl: Problemas coñecidos cando constrúas as imaxes para UT

source: Some known issues you may encounter when building the boot and system images are described in the `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_.
fr: Certains problèmes connus que vous pouvez rencontrer lors de la construction des images de démarrage et du système sont décrits dans le `guide du portage d'Halium <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_.
gl: Na guía de portaxe de Halium <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors> "_ descríbense algúns problemas coñecidos que pode atopar ao construír o arranque e as imaxes do sistema_.

source: Known issues with initial boot
fr: Problèmes connus avec le démarrage initial
gl: Problemas coñecidos co arranque inicial

source: The following are some of the known issues you may encounter in connection with the initial boot process.
fr: Voici quelques-uns des problèmes connus que vous pourriez rencontrer lors du processus de démarrage initial.
gl: Os seguintes son algúns dos problemas coñecidos que pode atopar en relación co proceso de inicio inicial.

source: SSH hangs when trying to connect
fr: SSH se suspend lors de la tentative de connexion
gl: SSH cólgase mentres intenta conectar

source: The SSH connection may hang indefinitely when trying to connect. Attempts to stop the connection with Control-C may or may not return you to a shell prompt. If you run ``ssh -vvvv phablet@10.15.19.82``, you only get the following output before the program stops::
fr: La connexion SSH peut se suspendre indéfiniment au moment de la tentative de connexion. Les efforts pour arrêter la connexion avec Contrôle C peuvent ou non vous renvoyer une invite de commande. Si vous exécutez ``ssh -vvvv phablet@10.15.19.82``, vous obtenez seulement la sortie suivante avant que le programme ne s'arrête::
gl: A conexión SSH pode colgarse indefinidamente ao intentar conectarse. Os intentos de deter a conexión con Control-C poden ou non devolverlle unha petición de shell. Se executas "ssh -vvvv phablet @ 10.15.19.82", só obtés a seguinte saída antes de que o programa pare:

source: This seems to be a common error on arm64 devices with kernel 3.10 when rsyslogd is enabled. If you have this error, please add your voice to `ubports/ubuntu-touch#560`_ and then try the following workaround:
fr: Cela semble être une erreur fréquente sur les appareils arm64 avec le noyau 3.10 lorsque rsyslogd est activé. Si vous avez cette erreur, ajoutez votre voix à `ubports/ubuntu-touch#560`_ puis tentez le palliatif suivant :
gl: Parece ser un erro común nos dispositivos arm64 co núcleo 3.10 cando rsyslogd está activado. Se ten este erro, engada a súa voz a `ubports / ubuntu-touch # 560`_ e logo intente a seguinte solución:

source: Reboot the device to recovery and connect with ``adb shell``
fr: Redémarrez votre appareil en mode récupération (recovery) et connectez-vous-y avec ``adb shell``
gl: Reinicie o dispositivo para recuperalo e conéctese con "adb shell"

source: Run the following commands to disable rsyslogd::
fr: Lancez la commande suivante pour désactiver rsyslogd::
gl: Executa os seguintes comandos para desactivar rsyslogd ::
it: Per disabilitare rsyslogd esegui i seguenti comandi::

source: You may now reboot the device. You should be able to connect to SSH once it comes back online.
fr: Vous pouvez maintenant redémarrer l'appareil. Vous devriez être capable de le connecter en SSH dès son retour en ligne.
gl: Agora podes reiniciar o dispositivo. Debería poder conectarse a SSH unha vez que volva estar en liña.
it: Ora puoi riavviare il dispositivo. Dovresti essere in grado di connetterti a SSH una volta che è ripartito.

source: Device reboots after a minute
fr: L'appareil redémarre après une minute
gl: O dispositivo reiníciase despois dun minuto
it: Il dispositivo riparte dopo un minuto

source: The device may reboot cleanly after about a minute of uptime. If you are logged in when the reboot occurs, you will see the following message::
fr: L'appareil peut redémarrer proprement après environ une minute de disponibilité. Si vous êtes connecté(e) lorsque le redémarrage se produit, vous verrez le message suivant::
gl: É posible que o dispositivo se reinicie limpo despois de aproximadamente un minuto de tempo de actividade. Se inicia sesión cando se inicia o reinicio, verá a seguinte mensaxe:

source: This happens because ``lightdm``, the Ubuntu Touch display manager, is crashing repeatedly. The system watchdog process sees this and reboots the device.
fr: Ceci se produit car ``lightdm``, le gestionnaire d'affichage d'Ubuntu Touch, plante à plusieurs reprises. Le processus de surveillance du système voit cela et redémarre l'appareil.
gl: Isto ocorre porque "lightdm", o xestor de pantalla Ubuntu Touch, falla repetidamente. O proceso de vixilancia do sistema ve isto e reinicia o dispositivo.

source: To fix this problem, log in before the reboot occurs and run the following command::
fr: Pour régler le problème, connectez-vous avant que le redémarrage ne survienne et lancez la commande suivante::
gl: Para solucionar este problema, inicie sesión antes de que se reinicie e execute o seguinte comando:

source: Known issues when bringing up Unity 8
fr: Problèmes connus lors de la mise en place d'Unity 8
gl: Problemas coñecidos ao presentar Unity 8

source: Below is are a few things to check when you are having trouble bringing up Unity 8.
fr: Vous trouverez ci-dessous quelques éléments à vérifier si vous avez du mal à mettre en place Unity 8.
gl: Abaixo amósanse algunhas cousas para comprobar cando ten problemas para sacar Unity 8.

source: Nothing shows on screen
fr: Rien n'apparait à l'écran
gl: Nada se amosa na pantalla

source: If nothing shows on screen even after adding udev rules to your port, you likely have a problem with graphical applications crashing. This can be caused by Mir servers crashing.
fr: Si rien ne s'affiche à l'écran même après l'ajout de règles udev à votre portage, il est probable que vous ayez un problème avec le plantage d'applications graphiques. Cela peut provenir du plantage des serveurs de Mir.
gl: Se non aparece nada na pantalla nin despois de engadir regras udev ao seu porto, é probable que teña un problema co fallo dos aplicativos gráficas. Isto pode ser causado por un fallo dos servidores Mir.

source: Mir servers crashing can be caused by many different problems with the port. To troubleshoot more, you can try the following:
fr: Les plantages des serveurs de Mir peuvent provenir de nombreux problèmes différents lors du portage. Pour trouver une solution, vous pouvez essayer la chose suivante :
gl: Os fallos dos servidores Mir poden ser causados por moitos problemas diferentes co porto. Para solucionar máis problemas, pode probar o seguinte:

source: Is the Android container running?
fr: Est-ce que le conteneur d'Android est en cours de fonctionnement ?
gl: Está o recipiente de Android executándose?

source: If the Android container is not running, many parts of Ubuntu Touch will not work. Run this command to check on the container's status::
fr: Si le conteneur d'Android n'est pas en cours de fonctionnement, de nombreuses parties d'Ubuntu Touch ne fonctionneront pas. Exécutez cette commande pour vérifier le statut des conteneurs::
gl: Se o contedor Android non funciona, moitas partes de Ubuntu Touch non funcionarán. Executa este comando para comprobar o estado do recipiente::

source: If you get output similar to the following, the Android container is running and you can move on to the next troubleshooting step::
fr: Si vous obtenez une sortie similaire à la suivante, le conteneur d'Android est en cours de fonctionnement et vous pouvez passer à l'étape suivante des investigations::
gl: Se obtén unha saída similar á seguinte, o contedor de Android está en funcionamento e pode pasar ao seguinte paso de resolución de problemas:

source: If you do not get ``State: RUNNING``, the container is stopped. You can run ``sudo start lxc-android-config`` to attempt to start it. If the container does not start after that, you can run ``sudo lxc-start -n android -F`` to get a more detailed log to determine why it failed.
fr: Si vous n'obtenez pas ``State: RUNNING``, c'est que le conteneur est arrêté. Vous pouvez exécuter la commande ``sudo start lxc-android-config`` pour essayer de le démarrer. Si le conteneur ne démarre pas après cela, vous pouvez exécuter la commande ``sudo lxc-start -n android -F`` pour obtenir un rapport plus détaillé sur la cause de cet échec.
gl: Se non obtés "Estado: en execución", o contedor está parado. Podes executar "sudo start lxc-android-config" para intentar inicialo. Se o contedor non comeza despois diso, pode executar "sudo lxc-start -n android -F" para obter un rexistro máis detallado que determine por que fallou.

source: Are all of the Android partitions mounted?
fr: Est-ce que toutes les partitions d'Android sont montées ?
gl: Están montadas todas as particións de Android?
it: Sono montate tutte le partizioni Android?

source: If some partitions used for Android drivers are not mounted, the container may start but not work correctly.
fr: Si des partitions utilisées pour les lecteurs Android ne sont pas montées, le conteneur peut démarrer mais ne pas fonctionner correctement.
gl: Se algunhas particións usadas para controladores de Android non están montadas, o recipiente pode iniciarse pero non funcionar correctamente.

source: To check the mounted Android partitions, run ``ls /android``. At least the following folders should be contained within::
fr: Pour vérifier les partitions montées d'Android, exécutez ``ls /android``. Les dossiers suivants devraient au moins se trouver à l'intérieur::
gl: Para comprobar as particións de Android montadas, execute "ls / android". Polo menos os seguintes cartafoles deberían estar incluídos en ::

source: If any of these are missing, run ``dmesg`` to get the kernel log. Mounting Android partitions will start after the following line::
fr: Si l'un d'entre eux est manquant, exécutez la commande ``dmesg`` pour obtenir le journal du noyau. Le montage de partitions d'Android démarrera après la ligne suivante::
gl: Se falta algún destes, execute "dmesg" para obter o rexistro do núcleo. A montaxe de particións de Android comezará despois da seguinte liña:

source: Try to diagnose and fix any mounting errors that you find in the log for the partitions listed above.
fr: Essayez de diagnostiquer et de réparer toutes les erreurs de montage que vous trouverez dans le journal pour les partitions listées ci-dessus.
gl: Intenta diagnosticar e corrixir os erros de montaxe que atopes no rexistro das particións listadas anteriormente.

source: Some devices have a ``vendor`` partition that contains proprietary libraries and executables required to run Android. If your device has this partition, make sure that it is mounted in addition to the others listed above.
fr: Certains appareils disposent d'une partition ``vendor``qui contient des bibliothèques et des exécutables propriétaires nécessaires au fonctionnement d'Android. Si votre appareil contient cette partition, assurez-vous qu'elle soit montée en plus de toutes les autres listées ci-dessus.
gl: Algúns dispositivos teñen unha partición "provedor" que contén bibliotecas propietarias e executables necesarios para executar Android. Se o seu dispositivo ten esta partición, asegúrese de que está montada ademais das outras listadas anteriormente.

source: Getting more Mir logs
fr: Obtenir plus de journaux de Mir
gl: Obtindo máis rexistros de Mir

source: If the Android container is running and all of its partitions seem to be mounted, you will need to get a few more logs before enlisting community help.
fr: Si le conteneur d'Android tourne et que toutes ses partitions semblent montées, vous devrez obtenir quelques journaux supplémentaires avant de solliciter l'aide de la communauté.
gl: Se o contedor de Android está en execución e todas as súas particións parecen estar montadas, terás que obter algúns rexistros máis antes de solicitar axuda da comunidade.

source: First, stop the display manager if it is not already::
fr: Tout d'abord, arrêtez le gestionnaire d’affichage si cela n'est pas déjà fait::
gl: En primeiro lugar, pare o xestor de pantalla se aínda non o é:

source: If you have Wi-Fi working (See `the Halium docs for Wi-Fi`_), install the ``libc6-dbg`` package first::
fr: Si le Wi-Fi fonctionne (Voir `la documentation d'Halium sur le Wi-Fi`_), installez d'abord le paquet ``libc6-dbg``::
gl: Se ten Wi-Fi funcionando (consulte `os documentos de Halium para Wi-Fi`_), instale primeiro o paquete" libc6-dbg ":

source: Then, run the following commands to get all of the needed logs::
fr: Exécutez ensuite les commandes suivantes pour obtenir tous les journaux nécessaires::
gl: A continuación, execute os seguintes comandos para obter todos os rexistros necesarios:

source: Use ``scp`` or a similar program to copy the ``usc.log``, ``usc-gdb.log``, and ``usc-logcat.log`` files from phablet's home folder to your computer. Then, post the content of these files to `paste.ubuntu.com`_, Pastebin, GitHub Gists, or a similar service so the people helping you can view them easily.
fr: Utilisez ``scp`` ou un programme similaire pour copier les fichiers ``usc.log``, ``usc-gdb.log`` et ``usc-logcat.log`` à partir du dossier personnel « phablet » vers votre ordinateur. Postez ensuite le contenu de ces fichiers dans `paste.ubuntu.com`_, Pastebin, GitHub Gists ou un service similaire de manière à ce que les personnes qui vous aident puissent les voir facilement.
gl: Use "scp" ou un programa similar para copiar os ficheiros "usc.log", "usc-gdb.log" e "usc-logcat.log" do cartafol persoal de phablet no seu computador. Despois, publique o contido destes ficheiros en `paste.ubuntu.com`_, Pastebin, GitHub Gists ou un servizo similar para que a xente que o axude poida velos facilmente.

source: Programs hang before crashing
fr: Les programmes se suspendent avant de planter
gl: Os programas colgan antes de fallar

source: Sometimes processes will hang for a very long time and then abort or segfault. The reason for the hang is apport, which attempts to collect useful information about the crash before allowing the program to stop.
fr: Les processus se mettent parfois en suspend pendant un long moment avant de s'interrompre ou de renvoyer une erreur de segmentation. La raison de la suspension vient d'Apport, qui tente de collecter des informations à propos du plantage avant d'autoriser le programme à s'arrêter.
gl: Ás veces, os procesos colgaranse por un tempo moi longo e despois interromperán ou fallarán. A razón do bloqueo é apport, que intenta recompilar información útil sobre o fallo antes de permitir que o programa pare.

source: If you don't need apport's information and would rather have the programs crash faster while troubleshooting, issue the following commands::
fr: Si vous n'avez pas besoin des informations d'Apport et préférez que le programme plante plus rapidement lors des investigations, exécutez la commande suivante::
gl: Se non precisa a información de apport e prefire que os programas fagan máis rápido durante a resolución de problemas, emita os seguintes comandos:

source: Enable /var/log/syslog
fr: Activer /var/log/syslog
gl: Activar /var/log/syslog

source: Normally the writing to the syslog is disabled. During porting it can be useful to enable this::
fr: Normalement, l'écriture dans les journaux du système est désactivée. Pendant le portage, il peut être utile d'activer ceci ::
gl: Normalmente a escritura no syslog está desactivada. Durante a portabilidade pode ser útil habilitar isto:

source: Now rsyslogd will write to the file and you can use it as usual. For example ``less /var/log/syslog`` or ``tail -f /var/log/syslog``.
fr: Désormais, rsyslogd va écrire dans le fichier et vous pourrez l'utiliser comme d'habitude. Par exemple ``less /var/log/syslog`` ou ``tail -f /var/log/syslog``.
gl: Agora rsyslogd escribirá no ficheiro e pode usalo como de costume. Por exemplo "less / var / log / syslog" ou "tail -f / var / log / syslog".

source: Known issues when configuring the device
fr: Problèmes connus lors de la configuration de l'appareil
gl: Problemas coñecidos ao configurar o dispositivo

source: Apps crash on launch
fr: Plantage des applications au démarrage
gl: Os aplicativos fallan ao lanzarse

source: Check if keyboard vibration works. If it does not, this is a good indication that you have not properly applied the apparmor kernel patches.
fr: Vérifiez si la vibration du clavier fonctionne. Si ce n'est pas le cas, c'est une bonne indication que vous n'avez pas correctement appliqué les correctifs Apparmor au noyau.
gl: Comproba se a vibración do teclado funciona. Se non o fai, este é un bo indicio de que non aplicou correctamente os parches do núcleo de apparmor.

source: Refer to section :ref:`Apply-apparmor-kernel-patches`.
fr: Référez-vous à la section :ref:`Appliquer les correctifs Apparmor au noyau`.
gl: Consulte a sección: ref: `Apply-apparmor-kernel-parches`.
