Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Besides the write access to the app directories explained below, the app can write debug messages into the app log file located at ``/home/phablet/.cache/upstart/application-click-<fullappname>_<appname>_<version>.log``. To append messages to the log file, use the `Qt debug <https://doc.qt.io/qt-5/qdebug.html>`_ functions.
fr: Outre les accès en écriture dans le répertoire de l'application expliqués ci-dessous, l'application peut écrire des message de dépannage dans le fichier journal de l'application situé dans ``/home/phablet/.cache/upstart/application-click-<nomcomplet>_<nomdelapplication>_<version>.log``. Pour ajouter des messages dans le fichier journal, utilisez les fonctions `dépannage de Qt<https://doc.qt.io/qt-5/qdebug.html>`_.
gl: Ademais do acceso de escritura aos directorios do aplicativo que se explica a continuación, o aplicativo pode escribir mensaxes de depuración no ficheiro de rexistro da aplicación situado en "/home/phablet/.cache/upstart/application-click- <fullappname> _ <appname> _ <version > .log ". Para engadir mensaxes ao ficheiro de rexistro, use as funcións `Qt debug <https://doc.qt.io/qt-5/qdebug.html>` _.

source: Config
fr: Configuration
gl: Configuración

source: Path: ``/home/phablet/.config/<fullappname>/``
fr: Chemin : ``/home/phablet/.config/<nomcompletdelapplication>/``
gl: Ruta: ``/home/phablet/.config/<fullappname>/``

source: This is the place to store configurations files to. The music app for example stores its configuration to ``/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.
fr: Il s'agit de l'endroit où sont stockés les fichiers de configuration. L'application Musique stocke par exemple sa configuration dans ``/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.
gl: Este é o lugar onde gardar os ficheiros de configuración. O aplicativo de música, por exemplo, almacena a súa configuración en "/ home / phablet / .config / com.ubuntu.music / com.ubuntu.music.conf".

source: Cache
gl: Caché

source: Path: ``/home/phablet/.cache/<fullappname>/``
fr: Chemin : ``/home/phablet/.cache/<nomcompletdelapplication>/``
gl: Ruta: ``/home/phablet/.cache/<fullappname>/``

source: This is the place to cache data for later use. The cache is also used by the Content Hub. Files that have been shared with the music app for example can be found in ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.
fr: Il s'agit de l'endroit dans lequel mettre des données en cache pour une utilisation ultérieure. Le cache est également utilisé par le contre de contenus. Les fichiers qui ont été partagés avec l'application Musique peuvent par exemple être retrouvés dans ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.
gl: Este é o lugar onde gardar caché de datos para o seu uso posterior. A caché tamén a usa o Content Hub. Os ficheiros que se compartiron co aplicativo de música, por exemplo, pódense atopar en "/ home / phablet / .cache / com.ubuntu.music / HubIncoming /".

source: App data
fr: Données de l'application
gl: Datos do aplicativo

source: Path: ``/home/phablet/.local/share/<fullappname>/``
fr: Chemin : ``/home/phablet/.local/share/<nomcompletdelapplication>/``
gl: Ruta: ``/home/phablet/.local/share/<fullappname>/``

source: This is where your app stores any data. The music app for example stores its data bases to ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.
fr: Il s'agit de l'endroit où votre application stocke toute ses données. L'application Musique stocke par exemple ses bases de données sous ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.
gl: Aquí é onde o teu aplicativo almacena calquera dato. O aplicativo de música, por exemplo, almacena as súas bases de datos en "/ home / phablet / .local / share / com.ubuntu.music / Databases /".

source: Using Standard Paths in C++
fr: Utilisation des chemins standards en C++
gl: Usando rutas estándar en C ++

source: The Qt header ``QStandardPaths`` provides the app's writable locations in C++:
fr: L'en-tête Qt ``QStandardPaths`` indique les emplacements en écriture de l'application :
gl: A cabeceira Qt "QStandardPaths" proporciona as localizacións editables do aplicativo en C ++:

source: Since the value of the QStandardPaths strings are decided by the `Qt application name <https://doc.qt.io/qt-5/qcoreapplication.html#applicationName-prop>`_, this needs to be the same as the clickable application name.
fr: Puisque la valeur des chaînes QStandardPaths est décidée par le `nom de l'application Qt <https://doc.qt.io/qt-5/qcoreapplication.html#applicationName-prop>`_, celui-ci doit être le même que le nom de l'application cliquable.
gl: Dado que o valor das cadeas QStandardPaths decídese polo nome de "aplicación Qt <https://doc.qt.io/qt-5/qcoreapplication.html#applicationName-prop>" _, isto debe ser o mesmo que se pode premer o nome do aplicativo.

source: Using Standard Paths in QML
fr: Utilisation des chemins standards en QML
gl: Usando rutas estándar en QML

source: The Qt module `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ provides the app's writable locations in QML:
fr: Le module Qt `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ fournit les emplacements accessibles en écriture pour l'application en QML :
gl: O módulo Qt `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>` _ proporciona as localizacións editables do aplicativo en QML:

source: Notice that ``QStandardPaths`` returns paths (``'/phablet/home/...'``), and QML ``StandardPaths`` returns urls (``'file:///phablet/home/...'``). This must be considered specially if the app is sharing location strings between QML and C++.
gl: Teña en conta que "QStandardPaths" devolve camiños ("/ phablet / home / ..." ") e QML" StandardPaths "devolve urls (" "file: /// phablet / home / .. . ""). Isto debe terse en conta especialmente se o aplicativo comparte cordas de localización entre QML e C ++.

source: App development
fr: Développement d'applications
gl: Desenvolvemento do aplicativo
it: Sviluppo App

source: Great!, you'd like to develop an app for Ubuntu Touch. Here are some resources that we hope help you get started.
fr: Super ! Vous souhaitez développer une application pour Ubuntu Touch. Voici quelques ressources qui, nous l'espérons, vous aideront à démarrer.
gl: Estupendo!, desexa desenvolver un aplicativo para Ubuntu Touch. Aquí tes algúns recursos que esperamos que che axuden a comezar.

source: If you have questions that aren't answered in the docs or want to chat with other Ubuntu Touch developers? Join our `app dev Telegram group <https://t.me/UbuntuAppDevEN>`_ or chat with us on the `UBports app dev forum <https://forums.ubports.com/category/35/app-development>`_.
fr: Vous avez des questions qui ne sont pas adressées dans la documentation ou vous souhaitez discuter avec les autres développeurs/euses d'Ubuntu Touch ? Rejoignez notre `groupe Telegram de développement d'applications <https://t.me/UbuntuAppDevEN>`_ ou discutez avec nous sur le `forum de développement d'applications d'UBports <https://forums.ubports.com/category/35/app-development>`_.
gl: Se tes preguntas ás que non se responde nos documentos ou queres chatear con outros desenvolvedores de Ubuntu Touch? Únete ao noso grupo de aplicativos Telegram <https://t.me/UbuntuAppDevEN> `_ ou chatea connosco no foro de aplicativos UBports <https://forums.ubports.com/category/35/app-development> _.

source: Getting Started
fr: Pour commencer
gl: Comezar

source: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ is a meta-build system for Ubuntu Touch applications that allows you to compile, build, test and publish ``click`` packages and provides various templates to get you started with app development. It is currently the easiest and most convenient way of building click packages for Ubuntu Touch. You can use any code editor or IDE that you choose and build your apps from the commandline with Clickable.
fr: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ est un système de méta-construction pour les applications sur Ubuntu Touch qui vous permet de compiler, construire, tester et publier des paquets `Click` et fournit plusieurs modèles pour vous permettre de démarrer avec le développement d'applications sur Ubuntu Touch. C'est actuellement le moyen le plus simple et le plus pratique de créer des paquets Click pour Ubuntu Touch. Vous pouvez utiliser l’éditeur de code ou l'IDE de votre choix et construire vos applications à partir de la ligne de commande avec Clickable.
gl: "Clickable <http://clickable.bhdouglass.com/en/latest/>" _ é un sistema de meta-compilación para aplicativos de Ubuntu Touch que permite compilar, construír, probar e publicar paquetes "click" e ofrece varios modelos para comezar co desenvolvemento de aplicativos. Actualmente é o xeito máis sinxelo e cómodo de construír paquetes de clic para Ubuntu Touch. Podes usar calquera editor de código ou IDE que escollas e crear os teus aplicativos desde a liña de comandos con Clickable.

source: Ubuntu Touch supports two kind of apps. :ref:`Native apps <nativeapp>` are apps with interfaces made using QML or HTML with their behavior defined in JavaScript, C++, Python, Rust or Go. :ref:`Web apps <webapp>` are special containers to run websites in.
fr: Ubuntu Touch prend en charge différents types d'applications. :ref:`Les applications natives <nativeapp>` sont des applications dont les interfaces sont réalisées en QML ou en HTML et dont le comportement est défini en JavaScript, C++, Python ou Go. :ref:`Les applications Web <webapp>` sont des conteneurs spéciaux dans lesquels exécuter les sites Internet.
gl: Ubuntu Touch admite dous tipos de aplicativos. : ref: "Os aplicativos nativos <nativeapp>" son aplicativos con interfaces feitas usando QML ou HTML co seu comportamento definido en JavaScript, C ++, Python, Rust ou Go. : ref: `Os aplicativos web <webapp>` son contedores especiais para executar sitios web.

source: Applications are shipped as a :ref:`Click <click>` package and can be publicly shared on the official app store `OpenStore <https://open-store.io>`__
fr: Les applications sont livrées sous la forme d'un paquet :ref:`Click <click>` et peuvent être partagées publiquement dans le magasin d'applications officiel `OpenStore <https://open-store.io>`__
gl: Os aplicativos envíanse como: ref: `Prema no paquete <click>` e pódense compartir publicamente na tenda oficial de aplicativos `OpenStore <https://open-store.io>` __

source: Code Editor Integrations
fr: Intégration de l'éditeur de code
gl: Integracións do editor de código

source: You can use clickable with the `Atom Editor <https://atom.io>`__ by installing the `atom-clickable-plugin <https://atom.io/packages/atom-clickable-plugin>`__. This provides some common clickable tools needed to build and run click packages for Ubuntu Touch from within Atom editor.
fr: Vous pouvez utiliser clickable avec l' `éditeur Atom <https://atom.io>`__ en installant `atom-clickable-plugin <https://atom.io/packages/atom-clickable-plugin>`__. Cela fournit certains outils clickable communs nécessaires pour construire et exécuter des paquets clickable pour Ubuntu Touch à partir de l'éditeur Atom.
gl: Podes usar clicable co `Atom Editor <https://atom.io>` __ instalando o `atom-clickable-plugin <https://atom.io/packages/atom-clickable-plugin>` __. Isto proporciona algunhas ferramentas comúns que se poden premer para construír e executar paquetes de clic para Ubuntu Touch desde o editor Atom.

source: Available on top of clickable docker image, ``clickable ide qtcreator`` command within your project directory will launch a QtCreator instance and auto setup the project for you, you will have code completion and navigation for Ubuntu Touch components as well as run/debug facilities.
gl: Dispoñible na imaxe de docker que se pode facer clic, o comando "clicable ide qtcreator" no seu directorio do proxecto iniciará unha instancia de QtCreator e configurará automaticamente o proxecto para ti, terá completación de código e navegación para os compoñentes de Ubuntu Touch, así como instalacións de execución / depuración.

source: Ubuntu SDK ( Unmaintained )
gl: SDK de Ubuntu (sen manter)

source: Alternatively there is the old `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__. Be aware that it is no longer supported by Canonical, and UBports has chosen to not support it either due to lack of manpower.
fr: Il y a aussi l’ancien `environnement de développement intégré Ubuntu SDK <https://docs.ubuntu.com/phone/en/platform/sdk>`__. Notez qu’il n’est plus pris en charge par Canonical et qu’UBports a choisi de ne pas le prendre en charge non plus en raison du manque de main-d’œuvre.
gl: Alternativamente, existe o antigo `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>` __. Ten en conta que Canonical xa non o admite, e UBports optou por non apoialo tampouco por falta de man de obra.

source: You can still install the SDK IDE in Ubuntu 16.04, but it is not guaranteed to work correctly. You can use the following commands to install::
fr: Vous pouvez toujours installer le kit de développement (SDK) sur Ubuntu 16.04, mais il n'est pas garanti qu'il fonctionne correctement. Vous pouvez utiliser les commandes suivantes pour l’installer::
gl: Aínda podes instalar o IDE SDK en Ubuntu 16.04, pero non está garantido que funcione correctamente. Podes usar os seguintes comandos para instalar:

source: Guides
fr: Les guides
gl: Guías

source: Get started building your first app or learn about advanced concepts with our :ref:`Developer guides <devguides>`.
fr: Commencez à construire votre première application ou apprenez des concepts avancés avec nos :ref:`Guides du développeur <devguides>`.
gl: Comeza a construír o teu primeiro aplicativo ou coñece conceptos avanzados coa nosa: ref: `Guías para desenvolvedores <devguides>`.

source: Publishing
fr: Publier
gl: Publicación

source: After you are done building your app, distribute it on the `OpenStore <https://open-store.io/>`__ with our :ref:`Publishing guides <publishing>`.
fr: Après avoir fini de construire votre application, distribuez-la sur l'`OpenStore <https://open-store.io/>`__ en vous servant de nos :ref:`Guides de publication <publishing>`.
gl: Despois de rematar de construír o teu aplicativo, distribúea no OpenStore <https://open-store.io/> `__ coa nosa: ref:` Publicación de guías <publishing> `.

source: `QML API <https://api-docs.ubports.com/sdk/apps/qml/index.html>`__
fr: `API QML <https://api-docs.ubports.com/sdk/apps/qml/index.html>`__
gl: `API QML <https://api-docs.ubports.com/sdk/apps/qml/index.html>` __

source: `Cordova HTML5 API <https://api-docs.ubports.com/sdk/apps/html5/index.html>`__
fr: `API Cordova HTML5 <https://api-docs.ubports.com/sdk/apps/html5/index.html>`__
gl: `API HTML5 de Córdoba <https://api-docs.ubports.com/sdk/apps/html5/index.html>` __
it: `API HTML5 per Cordova <https://api-docs.ubports.com/sdk/apps/html5/index.html>`__

source: `Clickable <http://clickable.bhdouglass.com/en/latest/>`__
gl: `Prema en <http://clickable.bhdouglass.com/en/latest/>` __

source: It is possible to develop cross-platform apps that don't depend on Ubuntu specific APIs, although this is not the official way of developing apps for Ubuntu Touch. If running on other operating systems is an requirement for your app, you can refer to this APIs instead:
fr: Il est possible de développer des applications multiplateforme qui ne dépendent pas des API spécifiques d'Ubuntu, bien que ce ne soit pas la manière officielle de développer des applications pour Ubuntu Touch. Si le fonctionnement sur d'autres systèmes d'exploitation est une exigence pour votre application, vous pouvez vous référer à ces API à la place :
gl: É posible desenvolver aplicativos multiplataforma que non dependan de API específicas de Ubuntu, aínda que este non é o xeito oficial de desenvolver aplicativos para Ubuntu Touch. Se executalo noutros sistemas operativos é un requisito para o teu aplicativo, podes consultar estas API:

source: `Kirigami API <https://api.kde.org/frameworks/kirigami/html/>`__
fr: `API Kirigami <https://api.kde.org/frameworks/kirigami/html/>`__
gl: `API Kirigami <https://api.kde.org/frameworks/kirigami/html/>` __

source: `Qt Quick Controls 2 API <https://doc.qt.io/qt-5/qtquickcontrols-index.html>`__
fr: `API Qt Quick Controls 2 <https://doc.qt.io/qt-5/qtquickcontrols-index.html>`__
gl: `API Qt Quick Controls 2 <https://doc.qt.io/qt-5/qtquickcontrols-index.html>` __

source: Sample apps
fr: Exemples d'applications
gl: Aplicativos de mostra

source: Learn more about app development by digging into our :ref:`Sample apps <sampleapps>`.
fr: Apprenez-en plus sur le développement d'applications en creusant dans nos :ref:`Applications types <sampleapps>`.
gl: Saber máis sobre o desenvolvemento de aplicativos cavando no noso: ref: `Aplicativos de mostra <sampleapps>`.

source: The :doc:`/contribute/preinstalled-apps` page has information on developing the apps which are included with Ubuntu Touch.
fr: La page :doc:`/contribute/preinstalled-apps` contient des informations sur le développement des applications qui sont inclues dans Ubuntu Touch.
gl: A páxina: doc: `/ contribute / preinstalled-apps` ten información sobre o desenvolvemento dos aplicativos incluídos con Ubuntu Touch.

source: Native applications
fr: Applications natives
gl: Aplicativos nativos
it: Applicazioni native

source: The recommended way to build a native application on Ubuntu Touch is to use the `Qt <https://doc.qt.io/>`__ framework ( current version shipped on Ubuntu Touch 16.04 is Qt 5.9.5 ). You do not have to stick with the traditional C++<->QML Qt model, you can use also Python, Go, Rust or even Javascript for your backend.
fr: La méthode recommandée pour construire une application native sur Ubuntu Touch est d'utiliser le framework `Qt <https://doc.qt.io/>`__ ( la version actuelle livrée sur Ubuntu Touch 16.04 est Qt 5.9.5 ). Vous n'êtes pas obligé de vous en tenir au modèle traditionnel C++<->QML Qt, vous pouvez également utiliser Python, Go, Rust ou même Javascript pour votre backend.
gl: O xeito recomendado de construír un aplicativo nativo en Ubuntu Touch é empregar o marco `Qt <https://doc.qt.io/>` __ (a versión actual que se entrega en Ubuntu Touch 16.04 é Qt 5.9.5). Non ten que seguir co modelo C ++ <-> QML Qt tradicional, tamén pode usar Python, Go, Rust ou incluso Javascript para o seu backend.

source: Ubuntu Touch provides a subset of Qt QML components to ease the development of your app : `QML API <https://api-docs.ubports.com/sdk/apps/qml/index.html>`__ and Icons: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/>`__, but you can also ship your cross platform app using standard Qt QML QtQuick2 components.
fr: Ubuntu Touch fournit un sous-ensemble de composants Qt QML pour faciliter le développement de votre appli : `API QML <https://api-docs.ubports.com/sdk/apps/qml/index.html>`__ et icônes : `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/>`__, mais vous pouvez également packager votre application multiplateforme en utilisant les composants Qt QML standard QtQuick2.
gl: Ubuntu Touch ofrece un subconxunto de compoñentes Qt QML para facilitar o desenvolvemento do teu aplicativo: `QML API <https://api-docs.ubports.com/sdk/apps/qml/index.html>` __ e Icons: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/> `__, pero tamén podes enviar o teu aplicativo multiplataforma empregando compoñentes estándar Qt QML QtQuick2.

source: You can use `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ to facilitate Packaging, deploying, publishing and tests .
fr: L'interface en ligne de commande `Clickable <http://clickable.bhdouglass.com/en/latest/>`_.
gl: Pode usar `Clickable <http://clickable.bhdouglass.com/en/latest/>` _ para facilitar o envasado, a implantación, a publicación e as probas.

source: Check out informations about the platform and confinement model in :ref:`Platform <platform>` section
fr: Consultez les informations sur la plateforme et le modèle de confinement dans la section :ref:`Plateforme <platform>`
gl: Consulte información sobre a plataforma e o modelo de confinamento en: ref: sección "Plataforma <plataforma>

source: AppArmor Policy Groups
fr: Groupes de stratégie d'AppArmor
gl: Grupos de políticas de «AppArmor»

source: This document contains a full list of Ubuntu Touch's available policy groups and a description of what they give your app permission to access.
fr: Ce document contient une liste complète des groupes de stratégie disponibles dans Ubuntu Touch ainsi qu'une description du type de droits qu'ils donnent à votre application.
gl: Este documento contén unha lista completa dos grupos de políticas dispoñibles de Ubuntu Touch e unha descrición do permiso para acceder ao teu aplicativo.

source: Each entry follows this format
fr: Chaque entrée est de ce format
gl: Cada entrada segue este formato

source: Policy usage affects whether your app will be accepted by the OpenStore. Apps containing policies with common usage are generally accepted immediately, while reserved usage policies will need to be manually reviewed.
fr: L'utilisation des stratégies change la façon dont votre application sera acceptée par l'OpenStore. Les applications contenant des stratégies communément utilisées seront généralement acceptées immédiatement, alors que les stratégies plus spécifiques devront être vérifiées manuellement.
gl: O uso da política afecta a que o seu aplicativo sexa aceptado por OpenStore. Os aplicativos que conteñen políticas de uso común adoitan aceptarse inmediatamente, mentres que as políticas de uso reservado deberán revisarse manualmente.

source: Coding tip: Everytime you change your apparmor policy file you need to update your app's version for this to be taken into account.
fr: Astuce de codage : Chaque fois que vous modifiez votre fichier de stratégie apparmor, vous devez mettre à jour la version de votre application pour que cela soit pris en compte.
gl: Consello de codificación: cada vez que cambias o ficheiro de política de apparmor, tes que actualizar a versión do teu aplicativo para que se teña en conta.

source: accounts
fr: comptes
gl: contas

source: Description: Can use Online Accounts.
fr: Description : peut utiliser des comptes en ligne.
gl: Descrición: pode usar contas en liña.

source: Usage: common
fr: Utilisation : commune
gl: Uso: común

source: The accounts policy gives your app the permissions it needs to access the `Online Accounts API`_.
fr: La politique relative aux comptes donne à votre application les permissions dont elle a besoin pour accéder à l'`API des comptes en ligne`_.
gl: A política de contas proporciona ao teu aplicativo os permisos que precisa para acceder á `API de contas en liña`_.

source: Description: Can play audio (allows playing remote content via media-hub)
fr: Description : peut lire du son (permet de lire des médias à distance via media-hub)
gl: Descrición: pode reproducir audio (permite reproducir contido remoto a través de media-hub)
