Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Now that you're logged in, there remain a number of things to be configured before Ubuntu Touch will be fully functional on your device. The correct way to do this is by storing these settings in overlay files (:ref:`Overlay-files`), and not by making the root directory writeable, as described below. However, in order to quickly set up udev rules which are necessary to complete subsequent steps, you can use this method for first time setup.
fr: Maintenant que vous êtes connecté, il reste un certain nombre de choses à configurer avant qu'Ubuntu Touch ne soit pleinement fonctionnel sur votre appareil. La bonne façon de procéder est de stocker ces paramètres dans des fichiers de superposition (:ref:`Fichiers de superposition`), et non de rendre le répertoire racine accessible en écriture, comme décrit ci-dessous. Cependant, afin de configurer rapidement les règles udev qui sont nécessaires pour effectuer les étapes suivantes, vous pouvez utiliser cette méthode pour la première installation.
gl: Agora que iniciaches sesión, quedan varias cousas por configurar antes de que Ubuntu Touch estea completamente funcional no teu dispositivo. O xeito correcto de facelo é almacenando estes axustes en ficheiros de superposición (: ref: `Overlay-files`), e non facendo que o directorio raíz poida escribirse, como se describe a continuación. Non obstante, para configurar rapidamente as regras de udev necesarias para completar os pasos posteriores, pode usar este método para a primeira configuración.

source: Make / writable
fr: Rendre modifiable
gl: Facer / Editable

source: Before you make any changes to the rootfs (which will be required for the next steps), you'll need to remount it with write permissions. To do that, run the following command::
fr: Avant de modifier le rootfs (ce qui sera nécessaire pour les étapes suivantes), vous devrez le remonter avec les permissions en écriture. Pour cela, lancez la commande suivante ::
gl: Antes de facer ningún cambio no rootfs (que será necesario para os seguintes pasos), terá que volver montalo con permisos de escritura. Para iso, execute o seguinte comando:

source: Add udev rules
fr: Ajouter des règles udev
gl: Engada as regras udev
it: Aggiungi le regole di udev

source: You must create some udev rules to allow Ubuntu Touch software to access your hardware. Run the following command, replacing [codename] with your device's codename::
fr: Vous devez créer des règles udev pour permettre aux logiciels d'Ubuntu Touch d'accéder à votre matériel. Exécutez la commande suivante en remplaçant [codename] par le nom de code de votre appareil::
gl: Debe crear algunhas regras de udev para que o software Ubuntu Touch poida acceder ao seu hardware. Executa o seguinte comando substituíndo [nome de código] polo nome de código do dispositivo ::

source: Now, reboot the device. If all has gone well, you will eventually see the Ubuntu Touch spinner followed by Unity 8. Your lock password is the same as you set for SSH.
fr: Maintenant, redémarrez votre appareil. Si tout s'est bien passé, vous devriez voir le logo animé d'Ubuntu Touch suivi par Unity 8. Votre mot de passe de verrouillage est le même que celui que vous aviez défini pour SSH.
gl: Agora reinicie o dispositivo. Se todo saíu ben, ao final verás o xirador Ubuntu Touch seguido de Unity 8. O teu contrasinal de bloqueo é o mesmo que fixaches para SSH.
it: A questo punto, riavvia il dispositivo. Se tutto è andato bene, eventualmente potresti vedere lo spinner di Ubuntu Touch seguito da Unity 8. La tua parola di accesso è la stessa che si è scelto per entrare con SSH.

source: When Unity 8 is first brought up on your device, you will probably notice that everything is very small. The :ref:`Display-scaling` section describes how to deal with this.
fr: Lorsque vous verrez pour la première fois Unity 8 sur votre appareil, vous remarquerez probablement que tout est très petit. La section :ref:`Mise à l'échelle de l'affichage` décrit comment régler cela.
gl: Cando Unity 8 apareza por primeira vez no seu dispositivo, probablemente notará que todo é moi pequeno. A sección: ref: "Escala de visualización" describe como tratar isto.

source: Problems when bringing up Unity 8
fr: Problèmes lors de la mise en place d'Unity 8
gl: Problemas cando se está executando Unity 8

source: Refer to :ref:`Known-issues-when-bringing-up-Unity-8`.
fr: Référez-vous à la section :ref:`Problèmes connus lors de la mise en place d'Unity 8`.
gl: Referir a :ref:`Known-issues-when-bringing-up-Unity-8`.

source: The four first sections below will take you through the porting steps described in the introduction.
fr: Les quatre premières sections ci-dessous vous guideront à travers les étapes de portage décrites dans l'introduction.
gl: As catro primeiras seccións a continuación guiaranse polos pasos de portaxe descritos na introdución.

source: The next section is a collection of documented errors and how to deal with them. These have been kept separate from the porting instructions themselves for the sake of keeping these brief. However, each section of the porting instructions concludes with a direct link to the relevant information on issues and errors.
fr: La section suivante est une collection d'erreurs documentées et la manière de les traiter. Elles ont été séparées des instructions de portage elles-mêmes afin de rester brèves. Toutefois, chaque section des instructions de portage se termine par un lien direct vers les informations pertinentes sur les problèmes et les erreurs.
gl: A seguinte sección é unha colección de erros documentados e como tratar con eles. Estes mantivéronse separados das propias instrucións de portaxe para manter estes breves. Non obstante, cada sección das instrucións de portada conclúe cunha ligazón directa á información relevante sobre problemas e erros.

source: The final section contains reference material that may be useful.
fr: La dernière section contient des documents de référence qui peuvent être utiles.
gl: A sección final contén material de referencia que pode ser útil.

source: GSI Porting
fr: Portage avec la GSI
gl: Portaxe con GSI

source: For the time being, refer to the UBports porting notes on `the generic system image (GSI) <https://github.com/ubports/porting-notes/wiki/Generic-system-image-(GSI)>`_ and `Halium 9 porting <https://github.com/ubports/porting-notes/wiki/Halium-9>`_.
fr: Pour l'instant, se référer aux notes de portage d'UBports sur `l'image système générique (Generic System Image ou GSI) <https://github.com/ubports/porting-notes/wiki/Generic-system-image-(GSI)>`_ et `le portage d'Halium 9 <https://github.com/ubports/porting-notes/wiki/Halium-9>`_.
gl: Polo momento, consulte as notas de portos de UBports sobre `a imaxe do sistema xenérico (GSI) <https://github.com/ubports/porting-notes/wiki/Generic-system-image- (GSI)>` _ e `Portación de Halium 9 <https://github.com/ubports/porting-notes/wiki/Halium-9>` _.

source: Introduction to porting
fr: Introduction au portage
gl: Introdución á portaxe
it: introduzione al porting

source: This first section will introduce you to the specifics of porting Ubuntu Touch to an Android device. Note that it is written with the general public in mind, not primarily the experienced porting developer. In subsequent sections we have made an effort to differentiate by keeping the main text more concise in order to meet the needs of the more experienced reader, while providing links to supplementary reading for the less experienced.
fr: Cette première section vous présentera les spécificités du portage d'Ubuntu Touch sur un appareil Android. Veuillez noter qu'elle a été rédigée à l'intention du grand public et non du développeur de portage expérimenté. Dans les sections suivantes, nous avons fait un effort de différenciation en gardant le texte principal plus concis afin de répondre aux besoins du lecteur plus expérimenté, tout en fournissant des liens vers des lectures complémentaires pour les moins expérimentés.
gl: Esta primeira sección presentaráche as especificidades para transportar Ubuntu Touch a un dispositivo Android. Ten en conta que está escrito pensando no público en xeral, non principalmente no experimentado desenvolvedor de portas. Nas seccións posteriores fixemos un esforzo por diferenciar mantendo o texto principal máis conciso para satisfacer as necesidades do lector máis experimentado, á vez que fornecemos ligazóns a lectura complementaria para os menos experimentados.
it: Questa prima sezione ti introdurrà alle specifiche di porting Ubuntu Touch a un dispositivo Android. Si noti che è scritto con il pubblico generale in mente, non principalmente lo sviluppatore porting esperto. Nelle sezioni successive abbiamo fatto uno sforzo per differenziare mantenendo il testo principale più conciso per soddisfare le esigenze del lettore più esperto, fornendo al contempo link alla lettura complementare per i meno esperti.

source: The guide as a whole is written as a sequence of steps describing how an ideal port might proceed. However, porting is unpredictable and messy. Every device is different and in reality you will likely iterate and revisit some steps, skip over other steps and uncover new and undocumented challenges.
fr: L'ensemble du guide est rédigé sous forme d'une séquence d'étapes décrivant comment pourrait se passer un portage idéal. Cependant, le portage est imprévisible et compliqué. Chaque appareil est différent et, en réalité, vous allez probablement itérer sur certaines étapes, en sauter d'autres et découvrir des défis nouveaux et non documentés.
gl: A guía no seu conxunto está escrita como unha secuencia de pasos que describen como podería proceder un porto ideal. Non obstante, a portabilidade é imprevisible e desordenada. Todos os dispositivos son diferentes e, en realidade, é probable que itineredes e revisedes algúns pasos, saltedes outros pasos e descubriredes retos novos e indocumentados.
it: La guida nel suo insieme è scritta come una sequenza di passi che descrive come un port ideale potrebbe procedere. Tuttavia, il porting è imprevedibile e disordinato. Ogni dispositivo è diverso e in realtà sarà probabile iterare e rivisitare alcuni passaggi, saltare su altri passaggi e scoprire nuove e non documentate sfide.

source: What is Ubuntu Touch?
fr: Qu'est-ce qu'Ubuntu Touch ?
gl: Que é Ubuntu Touch?
it: Cosa è Ubuntu Touch?

source: Ubuntu Touch is an open source operating system for mobile devices. It can be ported to devices that originally shipped with Android OS. Alas, the majority of these devices are dependent to some degree on proprietary software.
fr: Ubuntu Touch est un système d'exploitation libre pour les appareils mobiles. Il peut être porté sur des appareils qui, à l'origine, étaient équipés d'un système d'exploitation Android. Hélas, la majorité de ces appareils dépendent dans une certaine mesure de logiciels propriétaires.
gl: Ubuntu Touch é un sistema operativo de código aberto para dispositivos móbiles. Pódese transportar a dispositivos que se enviaron orixinalmente con sistema operativo Android. Por desgraza, a maioría destes dispositivos dependen ata certo punto do software propietario.
it: Ubuntu Touch è un sistema operativo open source per dispositivi mobili. Può essere portato a dispositivi che originariamente erano spediti con Android OS. Ahimè, la maggior parte di questi dispositivi dipende in qualche modo dal software proprietario.

source: To be specific, device vendors tend to keep the code that speaks directly to the device hardware (the low level device drivers) proprietary. These components are commonly called the 'vendor blobs'. The vendor blobs need to be incorporated into an Ubuntu Touch port. Note that these components are specific not only to each device, but also to each Android version. It is therefore necessary to secure the correct version of these components when building a port.
fr: Pour être spécifique, les vendeurs d'appareils ont tendance à garder le code qui parle directement au matériel de l'appareil, les pilotes de bas niveau propriétaires des fabricants. Ces composants sont communément appelés les « vendor blobs ». Ils doivent être incorporés dans un portage d'Ubuntu Touch. Notez que ces composants sont spécifiques non seulement à chaque appareil, mais aussi à chaque version d'Android. Il est donc nécessaire d'utiliser la version correcte de ces composants lors de la création d'un portage.
gl: Para ser específicos, os vendedores de dispositivos adoitan manter o código que fala directamente co hardware do dispositivo (os controladores de dispositivo de baixo nivel). Estes compoñentes chámanse normalmente "blobs de provedor". Os blobs do provedor deben incorporarse a un porto Ubuntu Touch. Teña en conta que estes compoñentes son específicos non só para cada dispositivo, senón tamén para cada versión de Android. Polo tanto, é necesario asegurar a versión correcta destes compoñentes cando se constrúe un porto.
it: Per essere specifici, i fornitori di dispositivi tendono a mantenere il codice che parla direttamente all'hardware del dispositivo (i driver di dispositivo a basso livello) proprietario. Questi componenti sono comunemente chiamati "Blobs del fornitore". I blobs del fornitore devono essere incorporati in una port Ubuntu Touch. Si noti che questi componenti sono specifici non solo per ogni dispositivo, ma anche per ogni versione Android. È quindi necessario garantire la corretta versione di questi componenti quando si costruisce un port.

source: This is why Ubuntu Touch cannot be built completely from source code for most commercial devices. Instead, porting the system to these devices involves integrating the previously mentioned vendor blobs into the rest of the system, which can be built from source.
fr: C'est pourquoi Ubuntu Touch ne peut pas être entièrement créé à partir du code source de la plupart des appareils commerciaux. Au lieu de cela, le portage du système sur ces appareils implique l'intégration des blobs mentionnés précédemment dans le reste du système, qui peut être construit à partir du code source.
gl: É por iso que Ubuntu Touch non se pode construír completamente a partir do código fonte para a maioría dos dispositivos comerciais. Pola contra, levar o sistema a estes dispositivos implica integrar os blobs do fornecedor mencionados anteriormente no resto do sistema, que se poden construír desde a fonte.
it: Ecco perché Ubuntu Touch non può essere costruito completamente dal codice sorgente per la maggior parte dei dispositivi commerciali. Invece, portare il sistema a questi dispositivi comporta l'integrazione dei blobs fornitore precedentemente menzionati nel resto del sistema, che può essere costruito dalla fonte.

source: The next component of Ubuntu Touch is a pre-compiled root filesystem which needs to be installed on the device. This component does not communicate directly with the device hardware. Instead, this communication is mediated by a Hardware Abstraction Layer (HAL) which needs to be built for each specific device, because each device has its specific hardware architecture. This component is called Halium and is available in different versions (5.1 which is largely obsolete, 7.1, and 9 as of writing) corresponding to different Android versions.
fr: Le composant suivant d'Ubuntu Touch est un système de fichiers racine pré-compilé qui doit être installé sur l'appareil. Ce composant ne communique pas directement avec le matériel de l'appareil. Cette communication est plutôt assurée par une couche d'abstraction matérielle (« Hardware Abstraction Layer », ou HAL) qui doit être créée pour chaque appareil spécifique, car chaque appareil a son architecture matérielle spécifique. Ce composant est appelé Halium et est disponible en différentes versions (5.1 qui est largement obsolète, 7.1 et 9 à l'heure actuelle) correspondant à différentes versions d'Android.
gl: O seguinte compoñente de Ubuntu Touch é un sistema de ficheiros raíz precompilado que precisa instalarse no dispositivo. Este compoñente non se comunica directamente co hardware do dispositivo. Pola contra, esta comunicación está mediada por unha capa de abstracción de hardware (HAL) que cómpre construír para cada dispositivo específico, porque cada dispositivo ten a súa arquitectura de hardware específica. Este compoñente chámase Halium e está dispoñible en diferentes versións (5.1 que está en gran parte obsoleta, 7.1 e 9 ao escribir) correspondentes a diferentes versións de Android.
it: Il componente successivo di Ubuntu Touch è un filesystem root precompilato che deve essere installato sul dispositivo. Questo componente non comunica direttamente con l'hardware del dispositivo. Invece, questa comunicazione è mediata da un livello di astrazione hardware (HAL) che deve essere costruito per ogni dispositivo specifico, perché ogni dispositivo ha la sua specifica architettura hardware. Questo componente è chiamato Halium ed è disponibile in diverse versioni (5.1 che è in gran parte obsoleto, 7.1 e 9 come da scrittura) corrispondenti a diverse versioni Android.

source: The Halium project enables Linux systems to run on Android hardware. It is a joint effort by multiple mobile operating systems, notably Plasma mobile, Lune OS and UBports. UBports porting builds on top of Halium porting. Consequently, you will be using both the Halium porting guide and the UBports porting guide. At times it can also be helpful to test with one of the other operating systems to debug a problem from different angles.
fr: Le projet Halium permet aux systèmes Linux de fonctionner sur du matériel Android. Il s'agit d'un effort conjoint de plusieurs systèmes d'exploitation mobiles, notamment Plasma mobile, Lune OS et UBports. Le portage UBports s'appuie sur le portage d'Halium. Par conséquent, vous utiliserez à la fois le guide de portage d'Halium et le guide de portage d'UBports. Parfois, il peut également être utile de tester avec l'un des autres systèmes d'exploitation pour déboguer un problème sous différents angles.
gl: O proxecto Halium permite que os sistemas Linux funcionen con hardware Android. É un esforzo conxunto de varios sistemas operativos móbiles, nomeadamente Plasma mobile, Lune OS e UBports. A portabilidade de UBports constrúese sobre a de Halium. En consecuencia, empregará tanto a guía de portada Halium como a guía de portada UBports. Ás veces tamén pode ser útil facer probas con outros sistemas operativos para depurar un problema desde diferentes ángulos.
it: Il progetto Halium consente ai sistemi Linux di funzionare su hardware Android. È uno sforzo congiunto da più sistemi operativi mobili, in particolare Plasma mobile, Lune OS e UBports. UBports porting costruisce sulla parte superiore del porting di Halium. Di conseguenza, userete sia la guida porting Halium che la guida porting UBports. A volte può anche essere utile per testare con uno degli altri sistemi operativi il debug di un problema da angoli diversi.

source: Halium is thus an indispensible part of an Ubuntu Touch port and is available in the form of open source software. Developing a new version of Halium is a very considerable task which is the why only a few versions of Halium are available. Each port of Ubuntu Touch has to be based on one of the available Halium versions and vendor blobs from the corresponding Android version. See the first two columns of the table below for details.
fr: Halium est donc une partie indispensable d'un portage d'Ubuntu Touch et est disponible sous forme de logiciel libre. Le développement d'une nouvelle version d'Halium est une tâche considérable, c'est pourquoi seules quelques versions d'Halium sont disponibles. Chaque portage d'Ubuntu Touch doit être basé sur une des versions d'Halium disponibles et sur les blobs de la version d'Android correspondante. Voir les deux premières colonnes du tableau ci-dessous pour plus de détails.
gl: Halium é, polo tanto, unha parte indispensable dun porto Ubuntu Touch e está dispoñible en forma de software de código aberto. O desenvolvemento dunha nova versión de Halium é unha tarefa moi considerable, polo que só hai algunhas versións de Halium dispoñibles. Cada porto de Ubuntu Touch ten que estar baseado nunha das versións dispoñibles de Halium e blobs do fornecedor da correspondente versión de Android. Vexa as dúas primeiras columnas da táboa seguinte para máis detalles.
it: Halium è quindi una parte indispensabile di un trasporto di Ubuntu Touch ed è disponibile sotto forma di software open source. Lo sviluppo di una nuova versione di Halium è un compito molto impegnativo ed è per questo che sono disponibili solo poche versioni di Halium. Ogni trasporto di Ubuntu Touch deve essere basato su una delle versioni di Halium disponibili e sui blob dei fornitori della corrispondente versione di Android. Per i dettagli si vedano le prime due colonne della tabella sottostante.

source: Thus an Ubuntu Touch port is composed of the these components:
fr: Ainsi, un portage d'Ubuntu Touch est composé de ces composants :
gl: Así, un porto Ubuntu Touch componse destes compoñentes:
it: Pertanto, un trasporto Ubuntu Touch è composto da questi componenti:

source: The Ubuntu Touch (UT) root filesystem (rootfs)
fr: Le système de fichiers racine (rootfs) d'Ubuntu Touch (UT)
gl: O sistema de ficheiros raíz de Ubuntu Touch (UT) (rootfs)
it: L'Ubuntu Touch (UT) root filesystem (rootfs)

source: `Halium <https://halium.org/>`_ (contained in the boot and system images)
fr: `Halium <https://halium.org/>`_ (contenu dans les images de démarrage et du système)
gl: `Halium <https://halium.org/>` _ (contido nas imaxes de arranque e do sistema)
it: `Halium <https://halium.org/>`_ (contenuto nelle immagini di avvio e di sistema)

source: The vendor blobs
fr: Les blobs des fabricants
gl: O vendedor blobs
it: Il fornitore blobs

source: You, the porter, need to build Halium (i.e. halium-boot.img and system.img) and install these together with the Ubuntu Touch rootfs in order to create a functioning Ubuntu Touch port.
fr: En tant que porteur/euse, vous devez compiler Halium (c'est-à-dire halium-boot.img et system.img) et les installer avec le rootfs d'Ubuntu Touch afin de créer un portage d'Ubuntu Touch fonctionnel.
gl: Ti, o porteiro, necesitas construír Halium (é dicir, halium-boot.img e system.img) e instalalos xunto cos rootfs de Ubuntu Touch para crear un porto Ubuntu Touch que funcione.
it: Tu, il porter, hai bisogno di costruire Halium (cioè halium-boot.img e system.img) e installarli insieme ai rootf Ubuntu Touch al fine di creare un trasporto Ubuntu Touch funzionante.
