Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Let's assume that you have an app created with Clickable and published on the OpenStore. But now you want to be able to send Push Notifications to your users. First of all, you need to understand how this is working:
fr: Supposons que vous ayez une appli créée avec Clickable et publiée sur l'OpenStore. Mais vous souhaitez maintenant pouvoir envoyer des notifications push à vos utilisateurs. Tout d'abord, vous devez comprendre comment tout cela fonctionne :
gl: Supoñamos que ten un aplicativo creado con Clickable e publicado en OpenStore. Pero agora quere enviar notificacións push aos seus usuarios. Primeiro de todo, debes entender como funciona isto:
it: Supponiamo di avere un'applicazione creata con Clickable e pubblicata su OpenStore. Ma ora volete essere in grado di inviare notifiche push ai vostri utenti. Prima di tutto, è necessario capire come funziona:

source: Every app which uses push notifications has got a unique token. This token identifies the user, the device and the app itself. The token is generated by the UBports Push Service.
fr: Chaque appli qui utilise les notifications push dispose d'un jeton unique. Ce jeton identifie l'utilisateur, l'appareil et l'application elle-même. Le jeton est généré par le service Push de UBports.
gl: Cada aplicación que usa notificacións push ten un token único. Este token identifica ao usuario, ao dispositivo e ao propio aplicativo. O token é xerado polo servizo push de UBports.
it: Ogni app che utilizza le notifiche push ha un token unico. Questo token identifica l'utente, il dispositivo e l'app stessa. Il token è generato dal servizio Push di UBports.

source: You will need the token to send a push notification. So the app sends its token to the app developer's server.
fr: Vous aurez besoin du jeton pour envoyer une notification push. Ceci pour que l'appli puisse l'envoyer au serveur du développeur.
gl: Necesitarás o token para enviar unha notificación push. Así, o aplicativo envía o seu token ao servidor do programador de aplicativos.
it: Il token è necessario per inviare una notifica push. Quindi l'applicazione invia il proprio token al server dello sviluppatore dell'applicazione.

source: With the token you can send a HTTP request to the UBports Push Server which will forward the notification the user's device.
fr: Avec le jeton, vous pouvez envoyer une requête HTTP au serveur Push de UBports qui transmettra la notification à l'appareil de l'utilisateur.
gl: Coa ficha pode enviar unha solicitude HTTP ao servidor push de UBports que reenviará a notificación ao dispositivo do usuario.
it: Con il token è possibile inviare una richiesta HTTP al server UBports Push che inoltrerà la notifica al dispositivo dell'utente.

source: Let's practice this step-by-step.
fr: Faisons-le donc étape par étape.
gl: Practicemos este paso a paso.
it: Esercitiamoci passo dopo passo.

source: In the following example we will not implement a server. Also the communication between your app and your server is up to you. Please inform the user about the communication with your server by providing a privacy policy!
fr: Dans l'exemple suivant, nous n'implémenterons pas de serveur. C'est vous qui gérez la communication entre votre appli et votre serveur. Veuillez informer l'utilisateur à ce sujet en fournissant une politique de confidentialité !
gl: No seguinte exemplo non implementaremos un servidor. Tamén a comunicación entre o teu aplicativo e o teu servidor depende de ti. Informe ao usuario sobre a comunicación co seu servidor proporcionando unha política de privacidade!
it: Nell'esempio che segue non implementeremo un server. Anche la comunicazione tra la vostra applicazione e il vostro server dipende da voi. Si prega di informare l'utente sulla comunicazione con il server fornendo un'informativa sulla privacy!

source: Make the app ready for push notifications
fr: Préparons l'application pour les notifications push
gl: Prepara o aplicativo para as notificacións push
it: Preparare l'app per le notifiche push

source: Implementing the PushClient
fr: Implémentation du client push
gl: Implementando o PushClient
it: Implementazione del PushClient

source: First we need to add the policy group "push-notification-client". Your apparmor file could look like this:
fr: Tout d'abord, nous devons ajouter la stratégie de groupe "push-notification-client". Votre fichier apparmor pourrait ressembler à ceci :
gl: Primeiro necesitamos engadir o grupo de políticas "push-notification-client". O seu ficheiro apparmor podería ter este aspecto:
it: Per prima cosa è necessario aggiungere il gruppo di criteri "push-notification-client". Il file di apparmor potrebbe essere simile a questo:

source: In the next step we need to modify the Qml parts. We need to add a pushclient component:
fr: Dans l'étape suivante, nous devons modifier la partie Qml. Nous devons ajouter un composant pushclient :
gl: No seguinte paso necesitamos modificar as partes Qml. Necesitamos engadir un compoñente pushclient:
it: Nel passo successivo dobbiamo modificare le parti Qml. Dobbiamo aggiungere un componente pushclient:

source: You need to set the correct appId! If the app name in your manifest file is myapp.yourname and the name of the main hook (the one which handles the .desktop file) is hookname, then the appId is: myapp.yourname_hookname. When we now start the app, it will get a token and print this token in the logs. With clickable logs we will be able to copy this token out of the terminal. But the app is not yet ready to receive a push notification. For this we need something called a pushhelper!
fr: Vous devez définir le bon appId ! Si le nom de l'application dans votre fichier manifeste est myapp.yourname et que le nom du hook principal (celui qui gère le fichier .desktop) est hookname, alors l'appId est : myapp.yourname_hookname. Lorsque nous démarrons l'application, elle obtient un jeton et l'inscrit dans les journaux. Avec les journaux cliquables, nous serons en mesure de copier ce jeton à partir du terminal. Mais l'application n'est pas encore prête à recevoir une notification push. Pour cela, nous avons besoin de quelque chose appelé pushhelper !
gl: Debe configurar o appId correcto. Se o nome do aplicativo no ficheiro manifesto é myapp.yourname e o nome do gancho principal (o que manexa o ficheiro .desktop) é hookname, entón o ID do aplicativo é: myapp.yourname_hookname. Cando iniciamos o aplicativo, obterá un token e imprimirá este token nos rexistros. Cos rexistros que se poden premer poderemos copiar este token do terminal. Pero o aplicativo aínda non está preparada para recibir unha notificación push. Para iso precisamos algo chamado axudante!
it: È necessario impostare l'appId corretto! Se il nome dell'applicazione nel file manifest è myapp.yourname e il nome dell'hook principale (quello che gestisce il file .desktop) è hookname, allora l'appId è: myapp.yourname_hookname. Quando ora si avvia l'applicazione, questa otterrà un token e lo stamperà nei log. Con i log cliccabili, saremo in grado di copiare questo token dal terminale. Ma l'applicazione non è ancora pronta a ricevere una notifica push. Per questo abbiamo bisogno di qualcosa chiamato pushhelper!

source: Implementing the pushhelper
fr: Implémentation du pushhelper
gl: Implementando o axudante push
it: Implementazione del pushhelper

source: The pushhelper is a part of the app which will receive all push notifications and process them before sending them to the system notification center. It will receive a json-file and must output another json-file in the correct format. The pushhelper is seperated from the app. So we need a new hook in the manifest. It could look like this:
fr: Le pushhelper est une partie de l'application qui va recevoir toutes les notifications push et les traiter avant de les envoyer au centre de notification du système. Il recevra un fichier json et devra produire un autre fichier json formaté correctement. Le pushhelper est séparé de l'appli. Nous avons donc besoin d'un nouveau hook dans le manifeste. Cela pourrait ressembler à ceci :
gl: O pushhelper é unha parte do aplicativo que recibirá todas as notificacións push e as procesará antes de envialas ao centro de notificacións do sistema. Recibirá un ficheiro json e deberá emitir outro ficheiro json no formato correcto. O pushhelper está separado do aplicativo. Así que necesitamos un novo enganche no manifesto. Podería ter o seguinte aspecto:
it: Il pushhelper è una parte dell'applicazione che riceve tutte le notifiche push e le elabora prima di inviarle al centro notifiche del sistema. Riceverà un file json e dovrà produrre un altro file json nel formato corretto. Il pushhelper è separato dall'applicazione. Quindi abbiamo bisogno di un nuovo hook nel manifest. Potrebbe essere così:

source: It should be clear that we now need a different apparmor file and a different executable file. The **push-apparmor.json** file must only contain the policy group push-notification-client and should look like this:
fr: Il est clair que nous avons maintenant besoin d'un fichier apparmor et d'un fichier executable différents. Le fichier **push-apparmor.json** doit uniquement contenir la stratégie de groupe push-notification-client et doit ressembler à ceci :
gl: Debe quedar claro que agora necesitamos un ficheiro apparmor diferente e un ficheiro executable diferente. O ficheiro ** push-apparmor.json ** só debe conter o grupo de políticas push-notification-client e debería ter o seguinte aspecto:
it: Dovrebbe essere chiaro che ora abbiamo bisogno di un file apparmor diverso e di un file eseguibile diverso. Il file **push-apparmor.json** deve contenere solo il gruppo di policy push-notification-client e deve avere questo aspetto:

source: The **push.json** is for redirecting to the executable file:
fr: **push.json** sert à la redirection vers le fichier exécutable :
gl: O ** push.json ** serve para redireccionar ao ficheiro executable:
it: Il file **push.json** serve a reindirizzare al file eseguibile:

source: In our tutorial we will use python to create a executable named **pushexec** which will forward the notification without changing anything:
fr: Dans notre tutoriel, nous allons utiliser le langage python pour créer un exécutable nommé **pushexec** qui transmettra la notification sans rien changer :
gl: No noso tutorial usaremos python para crear un executable chamado ** pushexec ** que reenviará a notificación sen cambiar nada:
it: Nel nostro tutorial useremo python per creare un eseguibile chiamato **pushexec** che inoltrerà la notifica senza modificare nulla:

source: We also need to add this new files to the **CMakeLists.txt** and make the pushexec executable::
fr: Nous devons également ajouter ces nouveaux fichiers à **CMakeLists.txt** et rendre le fichier pushexec exécutable : :
gl: Tamén necesitamos engadir estes novos ficheiros ao ** CMakeLists.txt ** e facer executable o pushexec ::
it: È inoltre necessario aggiungere questi nuovi file a **CMakeLists.txt** e rendere eseguibile pushexec::

source: Now the app is ready to receive and process push notifications!
fr: L'appli est maintenant prête à recevoir et à traiter les notifications push !
gl: Agora o aplicativo está preparado para recibir e procesar notificacións push!
it: Ora l'applicazione è pronta a ricevere ed elaborare le notifiche push!

source: Using the Push Service API
fr: Utilisation de l'API Push Service
gl: Usando a API de servizo Push
it: Utilizzo dell'API del servizio Push

source: So now you have the token and the app is ready to receive and process push notifications. To send a notification, you need to send a HTTP request to this address: https://push.ubports.com/notify The content-type must be application/json and it must fit in the correct format. A example in javascript could look like this:
fr: A ce stade, vous avez le jeton et l'application est prête à recevoir et à traiter les notifications push. Pour envoyer une notification, vous devez envoyer une requête HTTP à cette adresse : https://push.ubports.com/notify. La valeur de l'entête http content-type doit être application/json et doit aussi être au bon format. Un exemple en javascript pourrait ressembler à ceci :
gl: Agora tes o token e o aplicativo está preparado para recibir e procesar notificacións push. Para enviar unha notificación, debe enviar unha solicitude HTTP a este enderezo: https://push.ubports.com/notify O tipo de contido debe ser application / json e debe encaixar no formato correcto. Un exemplo en javascript podería ter este aspecto:
it: Ora si dispone del token e l'applicazione è pronta a ricevere ed elaborare le notifiche push. Per inviare una notifica, occorre inviare una richiesta HTTP a questo indirizzo: https://push.ubports.com/notify Il tipo di contenuto deve essere application/json e deve essere nel formato corretto. Un esempio in javascript potrebbe essere questo:

source: Push Notification Object
fr: L'objet notification push
gl: Envío de notificacións
it: Oggetto di notifica push

source: Parameter
fr: Paramètre
gl: Parámetro
it: Parametro

source: Type
gl: Tipo
it: Tipo

source: Description
gl: Descrición
it: Descrizione

source: string
fr: chaîne
gl: cadea
it: stringa

source: Required. ID of the application that will receive the notification,
fr: Requis. ID de l'application qui recevra la notification,
gl: Obrigatorio. ID do aplicativo que recibirá a notificación,
it: Richiesto. ID dell'applicazione che riceverà la notifica,

source: as described in the client side documentation.
fr: comme décrit dans la documentation partie client.
gl: como se describe na documentación do lado do cliente.
it: come descritto nella documentazione del lato client.

source: Required. Expiration date/time for this message, in
fr: Requis. Date et heure d'expiration du message, au format
gl: Obrigatorio. Data / hora de caducidade desta mensaxe, en
it: Richiesto. Data/ora di scadenza per questo messaggio, in

source: Required. The token identifying the user+device to which the message is
fr: Requis. Le jeton identifiant utilisateur+dispositif auxquels le message est
gl: Obrigatorio. O token que identifica o usuario + dispositivo ao que está a mensaxe
it: Richiesto. Il token che identifica l'utente+dispositivo a cui il messaggio è

source: directed, as described in the client side documentation.
fr: destiné, comme décrit dans la documentation partie client.
gl: dirixido, como se describe na documentación do lado do cliente.
it: diretto, come descritto nella documentazione lato cliente.

source: Discards all previous pending notifications. Usually in response to
fr: Abandonne toutes les précédentes notifications en attente. Généralement en réponse
gl: Descarta todas as notificacións pendentes anteriores. Normalmente en resposta a
it: Scarta tutte le notifiche in sospeso precedenti. Di solito in risposta a

source: getting a "too-many-pending" error. Defaults to false.
fr: à une erreur "too-many-pending". La valeur par défaut est false.
gl: obtendo un erro "demasiados pendentes". O valor predeterminado é falso.
it: ottenere un errore "too-many-pending". Predefinisce il falso.

source: If there's a pending notification with the same tag, delete it before
fr: Si il y a une notification avec le même tag, elle sera effacée avant de
gl: Se hai unha notificación pendente coa mesma etiqueta, elimínaa antes
it: Se c'è una notifica in sospeso con lo stesso tag, cancellalo prima

source: queuing this new one.
fr: mettre la nouvelle dans la file d'attente.
gl: facendo cola neste novo.
it: in coda a questo nuovo.

source: data
gl: datos
it: dati

source: Data
fr: données
gl: Datos
it: Dati

source: A JSON object. The contents of the data field are arbitrary. We can use
fr: Un objet JSON. Le contenu du champ de données est arbitraire. On peut l'utiliser
gl: Un obxecto JSON. O contido do campo de datos é arbitrario. Podemos usalo
it: Un oggetto JSON. Il contenuto del campo dati è arbitrario. Si può usare

source: it to send any data to the app.
fr: pour envoyer tout type de données à l'appli.
gl: para enviar calquera dato ao aplicativo.
it: per inviare qualsiasi dato all'applicazione.

source: notification
gl: notificación
it: Notifica

source: Notification
gl: Notificación
it: Notifica

source: A JSON object which defines how this notification will be presented.
fr: Un objet JSON qui définit comment cette notification sera présentée.
gl: Un obxecto JSON que define como se presentará esta notificación.
it: Un oggetto JSON che definisce come verrà presentata questa notifica.

source: message
gl: mensaxe
it: messaggio

source: object
fr: objet
gl: obxecto
it: oggetto

source: A JSON object that is passed as-is to the application via PopAll.
fr: Un objet JSON qui est transmis tel quel à l'application via PopAll.
gl: Un obxecto JSON que se pasa tal cal ao aplicativo a través de PopAll.
it: Un oggetto JSON che viene trasmesso come-è all'applicazione tramite PopAll.

source: tag
gl: etiqueta
it: etichetta tag

source: The tag of the push notification.
fr: Le tag de la notification push.
gl: A etiqueta da notificación push.
it: Il tag della notifica push.

source: sound
gl: son
it: suono

source: bool or string
fr: booléen ou chaîne
gl: bool ou cadea
it: bool o stringa

source: This is either a boolean (play a predetermined sound) or the
fr: Il s'agit soit d'un booléen (lecture d'un son prédéterminé), soit du
gl: Este é un booleano (reproduce un son predeterminado) ou o
it: Si tratta di un booleano (riprodurre un suono predeterminato) o dell'elemento

source: path to a sound file. The user can disable it, so don't rely
fr: chemin vers un fichier son. L'utilisateur peut le désactiver, donc ne pas se baser
gl: Este é un booleano (reproduce un son predeterminado) ou o
it: percorso di un file audio. L'utente può disabilitarlo, quindi non fare affidamento su

source: on it exclusively. Defaults to empty (no sound). The path is
fr: exclusivement sur celui-ci. Vide par défaut (pas de son). Le chemin est
gl: sobre el exclusivamente. Os valores predeterminados son baleiros (sen son). A ruta é
it: esclusivamente su di esso. Il valore predefinito è vuoto (nessun suono). Il percorso è

source: relative, and will be looked up in (a) the application's
fr: relatif et sera recherché dans (a) le dossier ``.local/share/<pkgname>``
gl: parente e buscarase no aplicativo de
it: relativo, e sarà cercato in (a) dell'applicazione

source: ``.local/share/<pkgname>``, and (b) standard xdg dirs.
fr: de l'application, (b) les dossiers xdg standards.
gl: ".local / share / <pkgname>" "e (b) directorios xdg estándar.
it: ``.local/share/<pkgname>``, e (b) le directory xdg standard.

source: vibrate
gl: vibrar
it: vibrare

source: bool or Vibrate
fr: booléen ou vibrate
gl: bool ou Vibrar
it: bool o Vibrare

source: The notification can contain a vibrate field, causing haptic
fr: La notification peut contenir un champ vibration, pour déclencher le dispositif de
gl: A notificación pode conter un campo vibratorio, o que pode causar háptica
it: La notifica può contenere un campo di vibrazione, provocando un effetto tattile

source: feedback, which can be either a boolean (if true, vibrate a
fr: vibration, ce champ peut être soit un booléen (si vrai, vibre
gl: comentarios, que poden ser booleanos (se é verdadeiro, vibran a
it: feedback, che può essere un booleano (se vero, fa vibrare un

source: predetermined way) or an Vibrate object.
fr: d'une façon prédéterminée) ou un objet vibrate.
gl: forma predeterminada) ou un obxecto Vibrar.
it: modo predeterminato) o un oggetto Vibrare.

source: A JSON object, which defines how to display the emblem
fr: Un objet JSON qui définit comment afficher le compteur
gl: Un obxecto JSON, que define como amosar o emblema
it: Un oggetto JSON, che definisce come visualizzare l'emblema

source: counter.
fr: sur l'icône de l'appli.
gl: contas.
it: contatore.

source: card
gl: tarxeta
it: carta

source: Card
gl: Tarxeta
it: Carta

source: A JSON object with information about the notification card.
fr: Un objet JSON contenant des informations sur la carte de la notification.
gl: Un obxecto JSON con información sobre a tarxeta de notificación.
it: Un oggetto JSON con informazioni sulla carta di notifica.

source: summary
gl: resumo
it: sommario

source: Required. A title. The card will not be presented if this is
fr: Requis. Un titre. La carte ne sera pas affichée si il est
gl: Obrigatorio. Un título. A tarxeta non se presentará se é así
it: Richiesto. Un titolo. La carta non verrà presentata se questo è

source: missing.
fr: manquant.
gl: perdido.
it: mancante.

source: body
gl: corpo
it: corpo

source: Longer text, defaults to empty.
fr: Description plus longue, vide par défaut.
gl: Texto máis longo, por defecto baleiro.
it: Testo più lungo, predefinito vuoto.

source: actions
gl: accións
it: azioni

source: array
fr: tableau
gl: taboleiro

source: If empty (the default), a bubble notification is
fr: si vide (par défaut), une bulle de notification est
gl: Se está baleiro (o predeterminado), unha notificación de burbulla é
it: Se vuoto (il predefinito), una notifica bolla è

source: non-clickable. If you add a URL, then bubble notifications
fr: non cliquable. Si vous ajoutez une URL, alors ces bulles de notifications
gl: non se pode premer. Se engades un URL, entón notificacións de burbullas
it: non cliccabile. Se si aggiunge un URL, allora le notifiche a bolla

source: are clickable and launch that URL. One use for this is using
fr: sont cliquables et lancent cette URL. Une utilisation possible est d'utiliser
gl: pódese premer e lanzar ese URL. Un uso para isto é o uso
it: sono cliccabili e lanciano quell'URL. Un uso di questo tipo è l'utilizzo di

source: a URL like ``appid://com.ubuntu.developer.ralsina.hello``
fr: une URL comme ``appid://com.ubuntu.developer.ralsina.hello``
gl: un URL como ``appid://com.ubuntu.developer.ralsina.hello``
it: un URL come ``appid://com.ubuntu.developer.ralsina.hello``

source: which will switch to the app or launch it.
fr: qui permet de basculer sur l'application ou de la lancer.
gl: que cambiará ao aplicativo ou a iniciará.
it: che passerà all'applicazione o la avvierà.

source: icon
gl: icona
it: icona

source: An icon relating to the event being notified. Defaults to
fr: Une icône relative à l'événement qui est notifié. Est vide par défaut
gl: Unha icona relacionada co evento que se notifica. Por omisión
it: Un'icona relativa all'evento notificato. Predefiniti per

source: empty (no icon); a secondary icon relating to the application
fr: (pas d'icône); une icône secondaire en lien avec l'application
gl: baleiro (sen icona); unha icona secundaria relacionada co aplicativo
it: vuoto (non icona); icona secondaria relativa all'applicazione

source: will be shown as well, regardless of this field.
fr: sera également affiché, indépendamment de ce champ.
gl: tamén se amosará, independentemente deste campo.
it: sarà mostrato anche, indipendentemente da questo campo.

source: integer
fr: entier
gl: enteiro
it: integro

source: Seconds since the unix epoch, only used for persist for now.
fr: En secondes (heure Unix), pour le moment seulement utilisé pour persist.
gl: Segundos desde a época de Unix, só se usan para persistir por agora.
it: Secondi dall'epoca unix, utilizzato solo per persistere per ora.

source: If zero or unset, defaults to current timestamp.
fr: si à zéro ou non définit, l'horodatage courant sera la valeur par défaut.
gl: Se é cero ou non se define, a marca de tempo actual é a predeterminada.
it: Se zero o unset, si predefinisce il timestamp corrente.

source: persist
gl: persistir
it: persistere
