Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: **needs confirmation**: The bug needs confirmation and / or further information from affected users
fr: **needs confirmation** (confirmation nécessaire) : le problème demande une confirmation et / ou un complément d'information par les utilisateurs concernés.
gl: **needs confirmation** (necesita confirmación): o erro necesita confirmación e/ou máis información dos usuarios afectados
it: **in attesa di conferma**: Il bug deve essere confermato e/o gli utenti interessati devono integrarne la documentazione

source: **bug**: This issue is a confirmed bug. If it's reproducible, reproduction steps are described.
gl: **bug**: Erro - Este problema é un erro confirmado. Se é posible reproducilo, descríbense os pasos para reproducilo.

source: **opinion**: This issue needs further discussion.
fr: **opinion** (opinion) : ce problème nécessite une discussion plus importante.
gl: **opinion**: Opinión - Necesita máis discursión para un problema.
it: **opinione**: Questo problema ha bisogno di essere approfondito ulteriormente.

source: **enhancement**: This issue is a feature request.
fr: **enhancement** (amélioration) : ce problème est une demande de fonctionnalité.
gl: **enhancement** (mellora): este asunto é unha solicitude de función.
it: **miglioria**: Questo problema è una richiesta di una nuova funzionalità.

source: **question**: This issue is a support request or general question.
fr: **question** : ce problème est une demande de soutien ou une question d’ordre général.
gl: **question** (pregunta): este problema é unha solicitude de soporte ou unha pregunta xeral.
it: **domanda**: Questo problema è una richiesta di supporto o una domanda generale.

source: **invalid**: This issue can not be confirmed or was reported in the wrong tracker.
fr: **invalid** (invalide) : ce problème ne peut être confirmé ou a été signalé au mauvais endroit.
gl: **invalid** (inválido): este problema non pode confirmarse ou foicomunicado no lugar equivocado.
it: **non valido**: Questo problema non può essere confermato o è stato inserito nel sistema di tracciamento sbagliato.

source: **duplicate**: This has already been reported somewhere else. Please provide a link and close.
fr: **duplicate** (doublon) : ceci a déjà été signalé à un autre endroit. Veuillez fournir un lien et clôturer.
gl: **duplicate** (duplicado): xa foi comunicado nalgún outro lugar. Por favor proporcione unha ligazón e péchao.
it: **duplicato**: Questo problema è stato già riportato altrove. Inserire il collegamento e chiuderlo.

source: **help wanted**: This issue is ready to be picked up by a community developer.
fr: **help wanted** (aide recherchée) : ce problème peut être pris en charge par un développeur de la communauté.
gl: **help wanted** (búscase axuda): este problema está listo para ser escollido por un desenvolvedor da comunidade.
it: **necessita aiuto**: Questo problema è pronto per essere preso in carica da uno sviluppatore della comunità.

source: **good first issue**: The report contains instructions or hints required to fix it. It is an excellent place for someone new to learn about the project by fixing a real issue.
gl: **good first issue**: primeiro problema bo - o informe contén instrucións ou consellos necesarios para solucionalo. É un lugar excelente para que alguén novo poida coñecer o proxecto solucionando un problema real.

source: **wontfix**: It does not make sense to fix this bug, since it will probably resolve itself, it will be too much work to fix it, it's not fixable, or an underlying component will soon change.
fr: **wontfix** (ne sera pas corrigé) : il est inutile de corriger ce problème car il se résoudra sûrement de lui-même ; ce problème demande beaucoup trop de travail ; ce problème n'est pas réparable ou un composant d'une couche inférieure changera bientôt.
gl: **wontfix** (non se arranxará): non ten sentido arranxar este problema xa que probablemente se arranxará só, será demasiado traballo arranxalo, non ten arranxo, ou un compoñente subxacente cambiará pronto.
it: **wontfix**: Non ha senso risolvere questo problema, dal momento che si risolverà da solo, o richiederà molto lavoro per la sua soluzione, o non è possibile risolverlo o un componente affettato sarà cambiato presto.

source: Additional special labels can be defined. As an example, here's the labels used in the Ubuntu Touch tracker:
fr: Des mots-clés spéciaux supplémentaires peuvent être définis. À titre d'exemple, voici les mots-clés utilisés dans le suivi d'Ubuntu Touch :
gl: Pódense definir etiquetas especiais adicionais. Como exemplo, aquí están as etiquetas utilizadas no seguidor de Ubuntu Touch:
it: Ulteriori speciali etichette saranno presto definite. Per esempio, eccone alcune usate dal sistema di tracciamento di Ubuntu Touch:

source: **critical (devel)**: This critical issue that only occurs on the devel channel is blocking the release of the next rc image.
fr: **critical (devel)** (critique, développement) : ce problème critique qui ne se produit que sur le canal développement bloque la publication de l'image de la version admissible suivante.
gl: **critical (devel)** (crítico (desenvolvemento)): este problema crítico que só ocorre na canle desenvolvemento está bloqueando a publicación da seguinte imaxe da versión candidata.
it: **critico (sviluppo)**: Questo problema critico, che può succedere solo nel canale devel, blocca il rilascio della prossima immagine rc.

source: **critical (rc)**: This critical issue that only occurs on the devel and rc channel is blocking the release of the next stable release. Usually, issues that can not simply be moved to a different release and have the power to postpone the release are labeled this.
fr: **critical (rc)** (critique, version admissible) : ce problème critique qui ne se produit que sur les canaux développement et version admissible bloque la publication de la version stable suivante. Sont généralement étiquetés de cette manière les problèmes qui ne peuvent simplement être déplacés vers une version différente et ont le pouvoir de retarder la publication.
gl: **critical (rc)** (crítico (versión candidata)): este problema crítico que só ocorre na canle desenvolvemento e na canle versión candidata está bloqueando a publicación da próxima versión estable. Normalmente os problemas que non se poden adiar a outra publicación e teñen o poder de adiar a publicación etiquétanse así.
it: **critico (rc)**: Questo problema critico, che appare nei canali devel e rc, blocca il rilascio della prossima versione stabile. Normalmente, i problemi che non possono essere semplicemente spostato a un prossimo rilascio o che fanno ritardare il rilascio sono etichettati in questo modo.

source: **device: [DEVICE CODENAME]**: This issue affects only the specified device(s).
fr: **device: [DEVICE CODENAME]** (appareil : [NOM DE CODE]) : ce problème ne touche que le ou les appareil(s) spécifié(s).
gl: **device: [DEVICE CODENAME]** (dispositivo: [ALIAS DO DISPOSITIVO]): este problema afecta só a un ou uns dispositivos determinados.
it: ** dispositivo: [NOME IN CODICE DEL DISPOSITIVO]**: Questo problema affligge solamente uno o più dispositivi specifici.

source: **team: [TEAM NAME]**: This issue is falls under the responsibility of a specific team (hal, middleware, UI).
fr: **team: [TEAM NAME]** (équipe : [NOM DE L'ÉQUIPE]) : ce problème concerne une équipe spécifique (hal, middleware, UI).
gl: **team: [TEAM NAME]** (equipo: [NOME DO EQUIPO]): este problema recae baixo a responsabilidade dun equipo específico (hal, middleware, UI).
it: **gruppo [NOME DEL GRUPPO]**: Questo problema ricade sotto la disponibilità di un gruppo di lavoro specifico (hal, middleware, UI).

source: If a repository that tracks issues locally defines it's own labels, they should be documented in the README.md.
fr: Si un dépôt qui suit des problèmes localement définit ses propres mots-clés, ils doivent être documentés dans le fichier README.md.
gl: Se un rexistro que segue os problemas localmente define as súas propias etiquetas, estas deberían ser documentadas no README.md.
it: Se un repository che traccia problematiche locali definisce le proprie etichette, le si deve documentare nel README.md.

source: Milestones
fr: Jalons
gl: Fitos
it: Obiettivi stabiliti

source: Milestones are used for stable OTA releases only. In general, milestones for the work-in-progress OTA and the next OTA are created. The ETA is set, once the work on the release starts (that is 6 weeks from start date), but can be adjusted afterwards. See the :doc:`release-schedule <release-schedule>` for more info.
fr: Les jalons (milestones) sont utilisées pour les versions stables OTA seulement. En général, les étapes sont définies pour la version OTA en cours et la suivante. La date estimée d'arrivée est déterminée dès qu'on commence à travailler sur la version (dans les 6 semaines à partir de la date de démarrage), mais peut être modifiée après coup. Consultez :doc:`le planning de publication <release-schedule>` pour plus d'informations.
gl: Os fitos úsanse só para as publicacións estables OTA. En xeral, créanse fitos para a OTA traballo en marcha e a siguiente OTA. O tempo estimado de publicación establécese unha vez comeza o traballo sobre a publicación (isto é 6 semanas desde a data do comezo) pero pódese modificar máis tarde. Vexa o :doc:`calendario de publicación <release-schedule>`para máis información.
it: Gli obiettivi intermedi sono usati solamente per i rilasci delle versioni stabili OTA. In generale, queste tappe sono create per le OTA in lavorazione e il successivo rilascio OTA. L'ETA è stato stabilito, una volta che il lavoro per il rilascio inizia (per 6 settimane dopo la data di avvio), ma può essere adattato in seguito. Guarda :doc:`la schedulazione del rilascio <release-schedule>` per ulteriori informazioni.

source: Assignees
fr: Cessionnaires
gl: Asignados
it: Assegnatari

source: To make it transparent who's working on an issue, the developer should be assigned. This also allows the use of GitHub's global filtering as a type of TODO list. For example, `this is everything assigned to mariogrip in @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
fr: Pour voir de façon claire qui travaille sur un problème, le développeur doit être assigné à cette tâche. Cela permet l'utilisation du système de filtrage global de GitHub comme une sorte de liste de choses à faire. Par exemple, `voici tout ce qui est assigné à mariogrip dans @ubports <https://github.com/search?utf8=%E 12%9C 2%93& 3q=is%3A 4open+org%3A 5ubports+assignee%3A 6mariogrip&type=>`_.
gl: Para facer transparente quen está traballando nun problema, un desenvolvedor debería ser asignado. Isto ademáis permite o uso do filtrado global de GitHub como unha forma de lista POR FACER. Por exemplo, `isto é todo o asignado a mariogrip en @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
it: Per rendere trasparente chi sta lavorando su un problema, gli si deve assegnare uno sviluppatore. Ciò permette l'uso dei filtri globali di GitHub, a modo di lista di cose da farsi. Ad esempio, `questo è tutto ciò che è stato assegnato a mariogrip in @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.

source: Developers are encouraged to keep their list short and update the status of their issues.
fr: On demande aux développeurs de veiller à garder une liste courte et de mettre régulièrement à jour le statut de leur différentes tâches.
gl: Anímase aos desenvolvedores a manter a súa lista curta e a que manteñan o estado dos seus problemas actualizados.
it: Agli sviluppatori è richiesto di mantenere delle liste ridotte e di mantenere aggiornato lo stato dei problemi.

source: Examples
fr: Exemples
gl: Exemplos
it: Esempi

source: Bug Lifecycle
fr: Le cycle de vie d'un problème
gl: Ciclo de vida dos erros
it: Ciclo di vita dei bachi

source: The same principle applies to feature requests. The only difference is, that instead of the label **bug**, the label **enhancement** is used. The **needs confirmation** label is not applicable for feature requests.
fr: Le même principe s'applique pour les demandes de fonctionnalité. La seule différence est qu'à la place du mot-clé **bug** (bogue), le mot-clé **enhancement** (amélioration) est utilisé. Le mot-clé **needs confirmation** (demande confirmation) n'est pas applicable dans le cas des demandes de fonctionnalité.
gl: O mesmo principio aplícase ás solicitudes de función. A única diferenza é que en vez da etiqueta **erro**, úsase a etiqueta **mellora**. A etiqueta **necesita confirmación** non se aplica ás solicitudes de función.
it: Lo stesso principio si applica alle richieste di nuove funzionalità. L'unica differenza è, invece dell'etichetta **baco**, che gli viene assegnata quella di **miglioria**. L'etichetta di **in attesa di conferma** non si può usare per le richieste di nuove funzionalità.

source: A *User* files a new bug using the issue-template.
fr: Un *Utilisateur* poste un nouveau problème en utilisant le modèle de suivi de problème.
gl: Un *Usuario* rexistra un novo informe do erro usando o modelo de problemas.
it: Un *Utente* può riportare un nuovo bag attraverso il modulo di creazione di nuovi problemi.

source: The *QA-Team* adds the label **needs confirmation** and tries to work with the user to confirm the bug and add potentially missing information to the report. Once the report is complete a **team-label** will be added to the issue, the issue will be put on the **awaiting-triage-list** of the project and the label needs confirmation will be replaced with **bug**.
fr: L'équipe de *l'assurance qualité* ajoute le mot-clé **needs confirmation** (demande confirmation) et essaye de travailler de concert avec l'utilisateur pour confirmer le problème et ajouter les éventuelles informations manquantes au rapport. Une fois que le rapport est complet un **team-label** (étiquette d'équipe) sera ajouté au suivi du problème et il sera mis sur la liste d'attente de tri du projet (**awaiting-triage-list**). De plus le mot-clé **needs confirmation** sera remplacé par **bug** (bogue).
gl: O *Equipo de control de calidade* engade a etiqueta **necesita confirmación** e trata de traballar co usuario para confirmar o erro e engadir información potencialmente ausente no informe. Unha vez se completou o informe unha **etiqueta de equipo** será engadida ao problema, o problema será posto na **lista esperando clasificación** do proxecto e a etiqueta necesita confirmación será reemprazada por **erro**.
it: Il *QA-Team* aggiunge l'etichetta **needs confirmation** (**richiesta conferma**) e cerca di lavorare con l'utente per la conferma del bug e aggiungere al report le informazioni eventualmente mancanti. Quando il report è completo, verrà aggiunta, accanto al problema, l'etichetta **team-label** (**etichetta del team**) e il problema verrà posto nello stato di **awaiting-triage-list** (**lista di attesa**) all'interno del progetto, in attesa che bug sia confermato e che l'etichetta venga trasformata in **bug**.

source: The affected *Team* will triage the issue and either reject (label **wontfix**, close and remove from the project) or accept the issue. The team decides if it they will fix the issue in-house (move to "Accepted" and assign a team member) or wait for a community developer to pick it up (Label **help wanted**, remove from the project board and provide hints on how to resolve the issue and further details on the how the fix should be implemented if necessary). For non-critical issues that are trivial to fix, the label **good first issue** can be added as well.
fr: L'*équipe* dédiée effectuera un tri du problème, à la suite duquel le problème sera soit rejeté (c'est à dire marqué **wontfix** : ne sera pas corrigé, puis fermé et retiré du projet) soit accepté pour correction. L'équipe décide si le problème sera corrigé en interne (statut passé en « accepted » : accepté, et affecté à un membre de l'équipe) ou si elle attend qu'un membre de la communauté de développeurs le prenne en charge (statut passé en **help wanted** : aide souhaitée, dans ce cas le problème est retiré du tableau du projet tout en fournissant des indications sur la méthode de résolution et en fournissant si nécessaire des détails sur l'implémentation du correctif). Pour des problèmes non critiques qui sont évidents à résoudre, le mot-clé **good first issue** (bon premier problème) peut également être ajouté.
gl: O *Equipo* afectado triará o problema e ou rexeitará (etiquetado **wontfix** ou **non se arranxará**, pechado e eliminado do proxecto) ou aceptará o problema. O equipo decide se arraxará o problema internamente (movido a "Accepted" ou "aceptado" e asignado a un membro do equipo) ou espera para que un desenvolvedor da comunidade o tome (etiquetar **help wanted** o **necesítase axuda**, eliminar do taboleiro do proxecto e proporcionar pistas sobre como resolver o problema e máis detalles de como o arranxo debería implementarse de ser necesario). Para problemas non críticos que son triviais de reparar, la etiqueta **good first issue** o **bo primeiro problema** pode engadirse tamén.
it: Il *Gruppo* interessato farà il test (triage) del problema e lo rigetterà (etichettandolo **wontfix**, lo chiuderà e lo rimuoverà dal progetto) o lo accettarà. Il gruppo decide se ne troverà una soluzione in casa (spostandolo in "Accettato", "Accepted", e assegnandolo a un membro del gruppo) oppure aspetterà che uno sviluppatore della comunità lo prenda in carico (etichettandolo **necessita aiuto**, **help wanted**, rimuovendolo dal tabellone di progetto e fornendone suggerimenti su come risolverlo e dettagli ulteriori su come implementarne la soluzione, qualora fosse necessario). Per problemi non critici ci sono soluzioni triviali, potendolo etichettare pure come **buono per primi problemi** (**good first issue**).

source: Once a *developer* is assigned and starts working on the issue, it is moved to "In Development". As soon as they have something to show for, the issue is closed and automatically moved to "Quality Assurance" for feedback from the QA team. If necessary, the developer will provide hints on how to test his patch in a comment on the issue.
gl: Unha vez que designas a un *desenvolvedor* e comeza a traballar no problema, móvese a "En desenvolvemento". Tan cedo como teñan algo para ensinar, o problema está pechado e automaticamente móvese por "Quality Assurance" para facer comentarios desde o equipo QA. Se é necesario, o desenvolvedor fornecerá instrucións sobre como probar a súa ruta no comentario do problema.

source: The *QA-Team* tests the fix on all devices and provides feedback to the developer. If problems are found, the issue is re-opened and goes back to "Accepted", else it’s moved to "Release Candidate" to be included in the next release.
gl: o *Equipo de control de cualidade* verifica a corrección do problema a todos os dispositivos e fornecer reaccións ao desenvolvedor. Se atoparon problemas, o problema tornará a abrir e volver <<Aceptar>>, no caso contrario móvese a <<Versión candidat>> porque incluíuse ao propio lanzamento.

source: If not done already, the issue is added to the next milestone. Once the milestone is released, the issue is removed from the project board.
fr: Si ce n'est pas déjà fait, le problème est ajouté dans le prochain jalon. Une fois le jalon franchi, le problème est retiré du tableau de suivi du projet.
gl: Se non se fixo xa, o problema engádese ao seguinte fito. Unha vez que o fito é publicado, o problema é eliminado do taboleiro do proxecto.
it: Qualora non sia già stato fatto, il problema è aggiunto alla prossima "milestone". Una volta che questa è rilasciata, il problema è rimosso dal tabellone di progetto.

source: This is the package archive system for UBports projects. It hosts various PPAs containing all deb-components of Ubuntu Touch.
gl: Este é o sistema de arquivo de paquetes para proxectos UBports. Aloxa varios PPA que conteñen todos os compoñentes deb de Ubuntu Touch.

source: Repository naming convention
gl: Convención dos nomes do rexistro

source: Native packages
gl: Paquetes nativos

source: Native packages are repositories which contain a ``debian/`` directory **with** the source used to create the Debian source package (``.dsc``).
gl: Os paquetes nativos son rexistrados que conteñen un directorio ``debian/`` **coa** fonte usada para crear o paquete de fonte de Debian (``.dsc``).

source: The name of the Debian source package generated from the repository and the name of the git-repository should be the same.
gl: O nome do paquete fonte Debian xerado a partir do rexistro e o nome do rexistro git deben ser os mesmos.

source: Packaging repositories
gl: Rexistros dos paquetes

source: Packaging repositories contain a ``debian/`` directory **without** the source used to create the Debian source package (``.dsc``). They also contain instructions to tell ``debhelper`` how to get the source used to create the source package.
gl: Os repositorios de empaquetado conteñen un directorio ``debian/`` **sen** a fonte usado para crear o paquete da fonte Debian(``.dsc``). Eles só conteñen instrucións para contar ``debhelper`` como conseguir a fonte usado para crear o paquete fonte.

source: The repository should have the name of the source package it generates with ``-packaging`` appended to the end. For example, a packaging repository that generates a source package called ``sandwich`` would be called ``sandwich-packaging``.
gl: O repositorio debería ter o nome do paquete de orixe que xera co ``-packaging`` engadido ao final. Por exemplo, un repositorio de envases que xera un paquete de orixe chamado ``sandwich`` chamaríase ``sandwich-packaging``.

source: Creating new PPAs
gl: Creando novos PPAs

source: New PPAs can be created dynamically by the CI server using a special :doc:`git-branch naming convention <branch-naming>`. The name of the branch translates literally to the name of the PPA: ``http://repo.ubports.com/dists/[branch name]``
gl: O servidor CI pode crear dinamicamente novos PPA usando un especial: doc: `convención de nomes git-branch <branch-naming>`. O nome da sucursal tradúcese literalmente polo nome do PPA: "http://repo.ubports.com/dists/[nome da sucursal]"

source: Non-standard PPAs (i.e. not ``xenial``, ``vivid`` or ``bionic``) are kept for three months. In case they need to be kept for a longer time, a file with the name ``ubports.keep`` can be created in the root of the repository, containing the date until which the PPA shall be kept open in the form of ``YYYY-MM-dd``. If this file is empty, the PPA will be kept for two years after the last build.
gl: Os PPA non estándar (é dicir, non "xeniais", "vivos" ou "biónicos") mantéñense durante tres meses. No caso de que haxa que conservalos durante máis tempo, pódese crear un arquivo co nome "ubports.keep" na raíz do repositorio, que conteña os datos ata a que o PPA se manteña aberto en forma de " "AAAA-MM-dd". Se este ficheiro está baleiro, o PPA manterase durante dous anos despois da última compilación.

source: Release Schedule
fr: Planning de sortie des versions
gl: Calendario do lanzamento
it: Pianificazione di un rilascio

source: OTA updates usually follow this rhythm:
fr: Les mises à jour OTA suivent habituellement ce rythme :
gl: As actualizacións OTA normalmente seguen este ritmo:
it: Gli aggiornamenti OTA normalmente seguono questo ritmo:

source: devel: daily builds
fr: devel : versions journalières
gl: desenvolvemento: compilacións diarias
it: devel: rilasci giornalieri
