Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: With this launch command and URL pattern, the user can navigate to and open in the webapp any URL that starts with http://www.ubuntu.com/. For example, they can click on the Phone button (http://www.ubuntu.com/phone) in the banner and it opens in the webapp, or the Tablet button (http://www.ubuntu.com/tablet). But, clicking Developer opens the corresponding URL in the browser.
fr: Avec cette commande de lancement et ce modèle d'URL, l'utilisateur peut naviguer et ouvrir dans l'application web n'importe quelle URL qui commence par http://www.ubuntu.com/. Par exemple, ils peuvent cliquer sur le bouton Phone (http://www.ubuntu.com/phone) dans la bannière et il s'ouvre dans la application web, ou sur le bouton Tablet (http://www.ubuntu.com/tablet). Mais, en cliquant sur Developer, vous ouvrez l'URL correspondante dans le navigateur.
gl: Con este comando de lanzamento e este patrón de URL, o usuario pode navegar e abrir no aplicativo web calquera URL que comece por http://www.ubuntu.com/. Por exemplo, poden facer clic no botón Teléfono (http://www.ubuntu.com/phone) no banner e ábrese no aplicativo web ou no botón Tablet (http://www.ubuntu.com/tablet) . Pero ao premer en Desenvolvedor ábrese o URL correspondente no navegador.
it: Con questo comando e il pattern URL, l'utente può navigare e aprire nella webapp qualsiasi URL che inizia con http://www.ubuntu.com/. Ad esempio, si può fare clic sul pulsante Telefono (http://www.ubuntu.com/phone) nel banner e si apre nella webapp o sul pulsante Tablet (http://www.ubuntu.com/tablet) . Ma facendo clic su Sviluppatore si apre l'URL corrispondente nel browser.

source: Tip: Make sure to fully specify the subdomain in your starting URL, that is, use http://www.ubuntu.com instead of www.ubuntu.com. Not specifying the subdomain would create an ambiguous URL and thus introduces security concerns.
fr: Astuce : veillez à bien spécifier le sous-domaine dans votre URL de départ, c'est-à-dire, utilisez http ://www.ubuntu.com au lieu de www.ubuntu.com. Ne pas spécifier le sous-domaine créerait une URL ambiguë et introduirait donc des soucis de sécurité. Des modèles avec joker plus complexes.
gl: Consello: asegúrese de especificar completamente o subdominio no seu URL inicial, é dicir, use http://www.ubuntu.com no canto de www.ubuntu.com. Non especificar o subdominio crearía un URL ambiguo e, polo tanto, introduciría problemas de seguridade.

source: More complex wildcard patterns
fr: Combinaison de caractères génériques plus complexes
gl: Patróns comodíns máis complexos

source: You might want to limit access to only some subpages of your site from within the webapp. This is easy with wildcard patterns. (Links to other subpages are opened in the browser.) For example, the following allows access to www.ubuntu.com/desktop/features and www.ubuntu.com/phone/features while not allowing access to www.ubuntu.com/desktop or www.ubuntu.com/phone::
fr: Vous voudrez peut-être limiter l'accès à certaines sous-pages de votre site à partir de l'application web. C'est facile avec des modèles utilisant des jokers. (Les liens vers d'autres sous-pages sont ouverts dans le navigateur.) Par exemple, ce qui suit permet d'accéder à www.ubuntu.com/desktop/features et www.ubuntu.com/phone/features sans permettre l'accès à www.ubuntu.com/desktop ou www.ubuntu.com/phone :
gl: Pode querer limitar o acceso a algunhas subpáxinas do seu sitio desde o aplicativo web. Isto é fácil cos patróns comodíns. (As ligazóns a outras subpáxinas ábrense no navegador.) Por exemplo, o seguinte permite acceder a www.ubuntu.com/desktop/features e www.ubuntu.com/phone/features sen permitir o acceso a www.ubuntu.com/ escritorio ou www.ubuntu.com/phone ::
it: Potresti voler limitare dalla webapp l'accesso solo ad alcune sottopagine del tuo sito. Questo è facile con i caratteri jolly. (I collegamenti ad altre pagine secondarie sono aperti nel browser.) Ad esempio, quanto segue consente l'accesso a www.ubuntu.com/desktop/features e www.ubuntu.com/phone/features pur non consentendo l'accesso a www.ubuntu.com/ desktop o www.ubuntu.com/phone ::

source: Multiple patterns
fr: Les modèles multiples
gl: Patróns múltiples
it: Modelli multipli

source: You can use multiple patterns by separating them with a comma. For example, the following allows access only to www.ubuntu.com/desktop/features and www.ubuntu.com/phone/features:::
fr: Vous pouvez utiliser plusieurs modèles en les séparant par une virgule. Par exemple, ce qui suit n'autorise l'accès qu'aux sites www.ubuntu.com/desktop/features et www.ubuntu.com/phone/features :
gl: Podes usar varios patróns separándoos cunha coma. Por exemplo, o seguinte permite acceder só a www.ubuntu.com/desktop/features e www.ubuntu.com/phone/features :::
it: Puoi utilizzare modelli multipli separandoli con una virgola. Ad esempio, quanto segue consente l'accesso solo a www.ubuntu.com/desktop/features e www.ubuntu.com/phone/features :::

source: Tip: Multiple patterns are often necessary to achieve the intended containment behavior.
fr: Astuce : Il est souvent nécessaire d'utiliser plusieurs modèles pour obtenir le comportement de confinement prévu.
gl: Consello: a miúdo son necesarios varios patróns para lograr o comportamento de contención previsto.
it: Suggerimento: spesso sono necessari modelli multipli per ottenere il comportamento di contenimento previsto .

source: Adding a specific subdomain
fr: Ajouter un sous-domaine spécifique
gl: Engadindo un subdominio específico
it: Aggiungere un sottodominio specifico

source: Many URLs have one or more subdomains. (For example, in the following, "developer" is the subdomain: developer.ubuntu.com.) You can allow access to a single subdomain (and all of its subpages) with a pattern like this:::
fr: Beaucoup d'URL ont un ou plusieurs sous-domaines. (Par exemple, dans ce qui suit,"déveloper" est le sous-domaine : developer. ubuntu. com.) Vous pouvez autoriser l'accès à un seul sous-domaine (et à toutes ses sous-pages) avec un modèle comme celui-ci :
gl: Moitos URL teñen un ou máis subdominios. (Por exemplo, a continuación, "desenvolvedor" é o subdominio: developer.ubuntu.com.) Pode permitir o acceso a un único subdominio (e a todas as súas subpáxinas) cun patrón coma este :::

source: However, one usually wants the user to be able to navigate back to the starting URL (and its subpages). So, if the starting URL is http://www.ubuntu.com, a second pattern is needed:::
fr: Cependant, on souhaite généralement que l'utilisateur puisse revenir à l'URL de départ (et ses sous-pages). Donc, si l'URL de départ est http://www.ubuntu.com, un second modèle est nécessaire :
gl: Non obstante, normalmente quere que o usuario poida volver á URL inicial (e ás súas subpáxinas). Entón, se o URL inicial é http://www.ubuntu.com, necesítase un segundo patrón :::
it: Tuttavia, generalmente si vuole che l'utente sia in grado di tornare all'URL iniziale (e alle sue sottopagine). Quindi, se l'URL di partenza è http://www.ubuntu.com, è necessario un secondo modello :::

source: Putting these together, here’s an example that starts on http://www.ubuntu.com and allows navigation to http://developer.ubuntu.com and subpages and back to http://www.ubuntu.com and subpages:::
fr: En les conjuguant, voici un exemple qui commence sur http://www.ubuntu.com et permet de naviguer vers http://developer.ubuntu.com et ses sous-pages et de revenir à http://www.ubuntu.com et ses sous-pages :
gl: Xuntándoos, aquí tes un exemplo que comeza en http://www.ubuntu.com e permite navegar a http://developer.ubuntu.com e subpáxinas e volver a http://www.ubuntu.com e subpáxinas :::
it: Mettendoli insieme, ecco un esempio che avvia http://www.ubuntu.com e che consente la navigazione su http://developer.ubuntu.com e relative sottopagine e infine ritorno a http://www.ubuntu.com e sottopagine :::

source: Adding subdomains with a wildcard
fr: Ajouter des sous-domaines avec un joker
gl: Engadindo subdominios cun comodín
it: Aggiunta di sottodomini con un carattere jolly

source: Some URLs have multiple subdomains. For example, www.ubuntu.com has design.ubuntu.com, developer.ubuntu.com and more. You can add access to all subdomains with a wildcard in the subdomain position:::
fr: Certaines URL ont plusieurs sous-domaines. Par exemple, www.ubuntu.com contient design.ubuntu. com, developer.ubuntu. com et plus encore. Vous pouvez ajouter l'accès à tous les sous-domaines avec un joker à l'emplacement du sous-domaine :
gl: Algúns URL teñen varios subdominios. Por exemplo, www.ubuntu.com ten design.ubuntu.com, developer.ubuntu.com e moito máis. Podes engadir acceso a todos os subdominios cun comodín na posición do subdominio :::
it: Alcuni URL hanno più sottodomini. Ad esempio, www.ubuntu.com ha design.ubuntu.com, developer.ubuntu.com e altro ancora. Puoi aggiungere l'accesso a tutti i sottodomini con un jolly nella posizione del sottodominio :::

source: Note: An asterisk in the subdomain position matches any valid single subdomain. This single pattern is sufficient to enable browsing to any subdomain and subpages, including back to the starting URL (http://www.ubuntu.com) and its subpages.
fr: Remarque : un astérisque dans la position du sous-domaine correspond à n'importe quel sous-domaine valide. Ce modèle unique est suffisant pour permettre la navigation vers n'importe quel sous-domaine et sous-pages, y compris le retour à l'URL de départ (http://www.ubuntu.com) et ses sous-pages.
gl: Nota: un asterisco na posición do subdominio coincide con calquera subdominio válido. Este patrón único é suficiente para permitir a navegación por calquera subdominio e subpáxinas, incluíndo a URL de inicio (http://www.ubuntu.com) e as súas subpáxinas.
it: Nota: un asterisco nella posizione del sottodominio corrisponde a qualsiasi sottodominio singolo valido. Questo modello singolo è sufficiente per consentire la navigazione verso qualsiasi sottodominio e sottopagine, incluso l'URL iniziale (http://www.ubuntu.com) e le sue sottopagine.

source: Adding https
fr: Ajouter https
gl: Engadindo https
it: Aggiungere https

source: Sometimes a site uses https for some of its URLs. Here is an example that allows https and https as access within the webapp to www.launchpad.net (and all subpages due to the wildcard):::
fr: Parfois, un site utilise https pour certaines de ses URL. Voici un exemple qui autorise https et https comme accès au sein de l'application web à www.launchpad.net (et toutes les sous-pages en raison du joker) :
gl: Ás veces, un sitio usa https para algúns dos seus URL. Aquí tes un exemplo que permite https e https como acceso na webapp a www.launchpad.net (e todas as subpáxinas debidas ao comodín) :::
it: Talvota un sito utilizza https per alcuni dei suoi URL. Ecco un esempio che consente a https e https come accesso all'interno della webapp di www.launchpad.net (e di tutte le sottopagine tramite l'uso del carattere jolly) :::

source: Note: the question mark in https?. This means the preceding character (the ‘s’) is optional. If https is always required, omit the question mark.
fr: Note : le point d'interrogation en https? Cela signifie que le caractère précédent (le 's') est facultatif. Si https est toujours requis, omettez le point d'interrogation.
gl: Nota: o signo de interrogación en https ?. Isto significa que o carácter anterior (o 's') é opcional. Se sempre se precisa https, omita o signo de interrogación.
it: Nota: il punto interrogativo in https ?. Questo significa che il carattere precedente (la 's') è facoltativo. Se https è sempre richiesto allora ometti il punto interrogativo.

source: Command line arguments
fr: Les arguments de la ligne de commande
gl: Argumentos da liña de comandos
it: Argomenti a linea di comando

source: The webapp-container accepts many options to fine tune how it hosts various web applications.
fr: Le conteneur de l'application web accepte de nombreuses options pour affiner la façon dont il héberge diverses applications web.
gl: O recipiente webapp acepta moitas opcións para axustar como aloxa varios aplicativos web.
it: Il container webapp accetta diverse opzioni per perfezionare il modo in cui ospita varie applicazioni web.

source: See all help with:::
fr: Voir toute l'aide avec :
gl: Ver toda a axuda con:::
it: Vedi l'aiuto con :::

source: Note: Only the following options apply to converged Ubuntu.::
fr: Remarque : seules les options suivantes s'appliquent à la convergence d'Ubuntu :
gl: Nota: só se aplican as seguintes opcións a Ubuntu converxido.::
it: Nota: solo le seguenti opzioni si applicano ad Ubuntu convergente. ::

source: Chrome options (if none specified, no chrome is shown by default):::
fr: Les options de Chrome (si aucune option n'est spécifiée, aucune n'est affichée par défaut) :
gl: Opcións de Chrome (se non se especifica ningunha, non se mostra ningún chrome por defecto) :::
it: Opzioni chrome (se nessuna specificata, non viene mostrato chrome di defaul):::

source: Note: The other available options are specific to desktop webapps. It is recommended to not use them anymore.
fr: Remarque : les autres options disponibles sont spécifiques aux applications web pour l'ordinateur de bureau. Il est recommandé de ne plus les utiliser.
gl: Nota: as outras opcións dispoñibles son específicas para aplicativos web de escritorio. Recoméndase non usalos máis.
it: Nota: le altre opzioni disponibili sono specifiche per le webapp desktop. Si raccomanda di non usarle più.

source: User-Agent string override
fr: Forcer la chaîne User-Agent
gl: Ignorar a cadea axente de usuario («User-Agent»)
it: Annullamento stringa User-Agent

source: Some websites check specific portions of the web engine identity, aka the User-Agent string, to adjust their presentation or enable certain features. While not a recommended practice, it is sometimes necessary to change the default string sent by the webapp container.
fr: Certains sites vérifient des portions spécifiques de l'identité du moteur web, alias la chaîne User-Agent, pour ajuster leur présentation ou activer certaines fonctionnalités. Bien que ce ne soit pas une pratique recommandée, il est parfois nécessaire de changer la chaîne par défaut envoyée par le conteneur de l'application web.
gl: Algúns sitios web comproban porcións específicas da identidade do motor web, tamén coñecida como a cadea User-Agent, para axustar a súa presentación ou activar certas funcións. Aínda que non é unha práctica recomendada, ás veces é necesario cambiar a cadea predeterminada enviada polo recipiente webapp.
it: Alcuni siti web controllano parti specifiche dell'identità del motore Web, ovvero la stringa User-Agent, per regolare la loro presentazione o abilitare certe funzionalità. Sebbene non sia una pratica consigliata, a volte è necessario modificare la stringa predefinita inviata dal contenitore webapp.

source: To change the string from the command line, use the following option:::
fr: Pour changer la chaîne de caractères depuis la ligne de commande, utilisez l'option suivante :
gl: Para cambiar a cadea na liña de ordes, use a seguinte opción:::
it: Per cambiare la stringa dalla riga di comando, utilizzare la seguente opzione:::

source: Browser data containment
fr: Confinement des données du navigateur
gl: Confinamento dos datos do navegador
it: Contenimento dati del browser

source: The webapp experience is contained and isolated from the browser data point of view. That is webapps do not access data from any other installed browser, such as history, cookies and so on. Other browser on the system do not access the webapp’s data.
fr: L'expérience de l'application web est confinée et isolée du point de vue des données du navigateur. C'est-à-dire que les applications web n'accèdent pas aux données de tout autre navigateur installé, comme l'historique, les cookies et ainsi de suite. Les autres navigateurs du système n'accèdent pas aux données de l'application web.
gl: A experiencia do aplicativo web está contido e illado desde o punto de vista dos datos do navegador. É dicir, as webapps non acceden a datos de ningún outro navegador instalado, como o historial, as cookies, etc. Outros navegadores do sistema non acceden aos datos do aplictivo web.

source: Storage
fr: Stockage
gl: Almacenamento

source: W3C allows apps to use local storage, and Oxide/Webapp-container supports the main standards here: LocalStorage, IndexedDB, WebSQL.
fr: Le W3C permet aux applis d’utiliser la mémoire locale, et Oxide/Webapp-container prend en charge les normes principales suivantes : LocalStorage, IndexedDB, WebSQL.
gl: W3C permite que os aplicativos utilicen almacenamento local e Oxide / Webapp-container admite os principais estándares aquí: LocalStorage, IndexedDB, WebSQL.
it: Lo standard W3C permette alle app di utilizzare la memoria locale e il webapp container Oxide ne supporta i principali standard come: Memoria locale, Database indicizzati, WebSQL.

source: Web applications
fr: Applications Web
gl: Aplicativos web
it: Applicazioni web

source: Ubuntu Webapps are a great way to deliver online web applications into Ubuntu.
fr: Les applications web Ubuntu sont un excellent moyen de fournir des applications web en ligne dans Ubuntu.
gl: Os aplicativos web de Ubuntu son unha gran maneira de levar os aplicativos web en liña a Ubuntu.
it: Le webapp per Ubuntu sono un'ottima via per permettere di utilizzare applicazioni all'interno di ubuntu.

source: The Ubuntu platform provides an advanced web engine container to run online applications on the Ubuntu client devices.
fr: La plate-forme Ubuntu fournit un conteneur de moteur web avancé pour exécuter des applications en ligne sur les appareils clients Ubuntu.
gl: A plataforma Ubuntu ofrece un recipiente avanzado de motores web para executar aplicativos en liña nos dispositivos cliente de Ubuntu.
it: La piattaforma di Ubuntu fornisce un avanzato web engine container per eseguire applicazioni on-line sui dispositivi Ubuntu.

source: Web applications are hosted online. They can be as simple as a website, like an online news site, or they can distribute content like videos. They can also have a rich user interface or use the WebGL extension to deliver games online.
fr: Les applications web sont hébergées en ligne. Elles peuvent être aussi simples qu'un site Web, comme un site de nouvelles en ligne, ou elles peuvent distribuer du contenu comme des vidéos. Elles peuvent également disposer d'une interface utilisateur riche ou utiliser l'extension WebGL pour proposer des jeux en ligne.
gl: Os aplicativos web son aloxados en liña. Poden ser tan simple como un sitio web, por exemplo un sitio de noticias en liña, ou poden distribuír contido como vídeos. Poden ter tamén unha rica interface de usuario ou usar a extensión «WebGL» para proporcionar xogos en liña.
it: Le applicazioni web sono ospitate online. Queste possono essere semplici come un sito web, un sito di notizie, o possono mostrare contenuti come video. Inoltre possono avere un'interfaccia utente elaborata o usare l'estensione WebGL per eseguire eseguire giochi on-line.

source: Note: Ubuntu webapps and Ubuntu HTML5 apps are similar but not identical. The main difference is that the content of a webapp is provided through a URL, whereas HTML5 apps install their content (and usually provide an Ubuntu HTML5 GUI). Webapps also have restricted access to platform APIs.
fr: Note : Les applications Web et les applications HTML5 d'Ubuntu sont similaires mais pas identiques. La principale différence est que le contenu d'une application Web est fourni par l'intermédiaire d'un lien, alors que les applications HTML5 installent leur contenu (et fournissent généralement une interface graphique HTML5 à Ubuntu). Les applications Web ont également un accès restreint aux API de la plateforme.
gl: Nota: os aplicativos web Ubuntu e os aplicativos HTML5 de Ubuntu son similares pero non idénticas. A principal diferenza é que o contido dun aplicativo web fornécese a través dun URL, mentres que os aplicativos HTML5 instalan o seu contido (e normalmente proporcionan unha GUI HTML5 de Ubuntu). As webapps tamén teñen acceso restrinxido ás API de plataforma.

source: This guide targets webapps for converged Ubuntu, that is, Ubuntu for Devices (phones and tablets). The Ubuntu Desktop has additional webapps support not covered here. Support for webapps on converged Ubuntu will continue to grow, and of course the future of Ubuntu is convergence, so stay tuned.
fr: Ce guide cible les applications web pour la version convergente d'Ubuntu, c'est-à-dire Ubuntu pour les appareils mobiles (téléphones et tablettes). Ubuntu pour l'ordinateur de bureau dispose d'un support supplémentaire qui n'est pas couvert ici. La prise en charge des applications web pour Ubuntu convergent continuera à croître et bien sûr l'avenir d'Ubuntu est la convergence, alors restez à l'écoute.
gl: Esta guía está dirixida a aplicativos web para Ubuntu converxido, é dicir, Ubuntu para dispositivos (teléfonos e tabletas). O escritorio Ubuntu ten soporte webapps adicional non cuberto aquí. O soporte para webapps en Ubuntu converxente seguirá crecendo e, por suposto, o futuro de Ubuntu é a converxencia, así que estade atentos.
it: Questa guida si rivolge a webapp per Ubuntu convergente, ovvero Ubuntu per dispositivi (telefoni e tablet). Il desktop di Ubuntu ha un ulteriore supporto per le applicazioni web non trattato qui. Il supporto per le webapp su Ubuntu convergente continuerà a crescere e, naturalmente, il futuro di Ubuntu è la convergenza, quindi rimanete sintonizzati.

source: Quick start
fr: Démarrage rapide
gl: Inicio rápido
it: Avvio rapido

source: There are several tools to help you package and deploy your webapp to your device:
fr: Il existe plusieurs outils pour vous aider à empaqueter et déployer votre application web sur votre appareil :
gl: Existen varias ferramentas para axudarlle a empaquetar e implementar o seu aplicativo web no seu dispositivo:
it: Ci sono molti strumenti per aiutarti a creare e installare le tue webapp sul tuo dispositivo:

source: `Webapp creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ application available from the openstore
fr: `Webapp creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ application disponible sur l'openstore
gl: `Creador de aplicativos web <https://open-store.io/app/webapp-creator.jujuyeh>` _ aplicativo dispoñible desde a tenda aberta
it: `Webapp creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ applicazione disponibile dall'openstore

source: Debugging your webapp
fr: Déboguer votre application Web
gl: Depuración do seu aplicativo web
it: Eseguo debug della tua webapp

source: This guide give you some tips to help you debug your webapp.
fr: Ce guide vous donne quelques conseils pour vous aider à déboguer votre application Web.
gl: Esta guía dálle algúns consellos para axudarlle a depurar o seu aplicativo web.
it: Questa guida ti da alcuni suggerimenti per aiutarti nel debug della tua webapp.

source: Debug web application
fr: Déboguer une applications Web
gl: Depuración do aplicativo web
it: Debug applicazione web
