Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Once strings have been translated, they are made available for users with a new release of an app.
fr: Une fois que les chaînes ont été traduites, elles sont mises à la disposition des utilisateurs/trices avec une nouvelle version d'une application.
gl: Unha vez traducidas as cadeas, ponse a disposición dos usuarios cunha nova versión dun aplicativo.
it: Una volta che le stringhe sono state tradotte, sono resi disponibili per gli utenti con una nuova versione di un'app.

source: Methods of Translation
fr: Les méthodes de traduction
gl: Métodos de tradución
it: Metodi di traduzione

source: There are three commonly used ways to translate an app:
gl: Hai tres formas comunmente usadas de traducir un aplicativo:

source: Weblate: A web based translation tool. UBports apps using Weblate can be translated `here <https://translate.ubports.com/projects/>`_. There is an automatic transfer of new strings from an apps repo to weblate. Translated strings get back as commits to the repo from weblate.
fr: Weblate : un outil de traduction sur internet. Les applications d'UBports utilisant Weblate peuvent être traduites `ici <https://translate.ubports.com/projects/>`_. Il y a un transfert automatique des nouvelles chaînes de caractères du dépôt d'une application vers Weblate. Les chaînes traduites sont renvoyées dans le dépôt par Weblate en tant que modification.
gl: Weblate: unha ferramenta de tradución baseada na web. As aplicacións de UBports que usan Weblate pódense traducir `aquí <https://translate.ubports.com/projects/>` _. Hai unha transferencia automática de novas cadeas dun repositorio de aplicativos a weblate. As cadeas traducidas volven a medida que se compromete coa reposición de weblate.
it: Weblate: Uno strumento di traduzione basato sul web. Le applicazioni UBports che utilizzano Weblate possono essere tradotte `qui <https://translate.ubports.com/projects/>`_. C'è un trasferimento automatico di nuove stringhe da un repo di applicazioni a Weblate. Le stringhe tradotte vengono restituite come commit al repo da weblate.

source: Editor: Translation is done by changing *.po* files with the editor of your choice, and a GitHub/GitLab account. The *.po*/*.ts* files for each project are in their repository on `our GitLab organization <https://gitlab.com/ubports/apps>`_ or on `our GitHub organization <https://github.com/ubports>`_. After translating the translator commits new translations to an apps repo generally by opening a merge request/pull request.
fr: Éditeur : la traduction se fait en changeant les fichiers *.po* avec l'éditeur de votre choix et un compte GitHub/GitLab. Les fichiers *.po*/*.ts* de chaque projet se trouvent dans leur dépôt sur `notre projet GitLab <https://gitlab.com/ubports/apps>`_ ou sur `notre projet GitHub <https://github.com/ubports>`_. Après la traduction, les nouvelles traductions sont envoyées à un dépôt d'applications, généralement en ouvrant une demande de fusion.
gl: Editor: a tradución faise cambiando os ficheiros * .po * co editor que elixa e cunha conta GitHub / GitLab. Os ficheiros * .po * / *. Ts * de cada proxecto están no seu repositorio na `nosa organización GitLab <https://gitlab.com/ubports/apps>` _ ou na `nosa organización GitHub <https: // github .com / ubports> `_. Despois de traducir, o tradutor engade novas traducións a un repositorio de aplicativos xeralmente abrindo unha solicitude de combinación / solicitude de extracción.
it: Editor: La traduzione si effettua modificando i file *.po* con l'editor di propria scelta e un account GitHub/GitLab. I file *.po*/*.ts* per ogni progetto si trovano nel loro repository su `nostra organizzazione GitLab <https://gitlab.com/ubports/apps>`_ o su `nostra organizzazione GitHub <https://github.com/ubports>`_. Dopo aver tradotto, il traduttore effettua il commit delle nuove traduzioni su un repository delle applicazioni, generalmente aprendo una richiesta di fusione/rimozione.

source: Team translation: We also have a `Translation Forum <https://forums.ubports.com/category/39/translations>`_ to discuss translating Ubuntu Touch and its core apps. Some projects are using Telegram or Matrix groups too, and some teams are still using the Ubuntu Launchpad framework.
gl: Tradución do equipo: tamén temos un `Foro de tradución <https://forums.ubports.com/category/39/translations>` _ para discutir a tradución de Ubuntu Touch e os seus principais aplicativos. Algúns proxectos tamén usan grupos Telegram ou Matrix, e algúns equipos seguen usando o framework Ubuntu Launchpad.

source: Core apps and some community apps like dekko or TELEports are generally using weblate for translation. This is the preferred way to translate and it does not need any programming skills. Please have a look at the `UBports translation projects <https://translate.ubports.com/projects/>`_. When using weblate do not edit *.po* files manually. Commiting edited *.po* files can break the automated process of translation.
fr: Les applications de base et certaines applications communautaires comme Dekko ou TELEports utilisent généralement Weblate pour la traduction. C'est la méthode de traduction préférée et elle ne nécessite aucune compétence en programmation. Veuillez consulter les projets de traduction de `UBports <https://translate.ubports.com/projects/>`_. Lorsque vous utilisez Weblate, ne modifiez pas les fichiers *.po* manuellement. La publication de fichiers *.po* modifiés peut interrompre le processus de traduction automatique.
gl: Os aplicativos básicos e algúns aplicativos da comunidade como dekko ou TELEports normalmente utilizan weblate para a tradución. Esta é a forma preferida de traducir e non precisa habilidades de programación. Bota unha ollada aos `proxectos de tradución de UBports <https://translate.ubports.com/projects/>` _. Ao usar weblate, non edite ficheiros * .po * manualmente. O envío de ficheiros * .po * editados pode romper o proceso automatizado de tradución.
it: Le app core e alcune app della comunità come dekko o TELEports stanno generalmente utilizzando weblate per la traduzione. Questo è il modo preferito per tradurre e non ha bisogno di alcuna abilità di programmazione. Si prega di dare un'occhiata ai `progetti di traduzione UBports <https://translate.ubports.com/projects/>`_. Quando si utilizza weblate non modificare manualmente i file *.po*. I file *.po* modificati possono rompere il processo automatizzato di traduzione.

source: Most apps maintained by individual developers are mainly using *.pot*/*.po* files for translation. Those generally need to be edited manually and commited to the apps repo.
fr: La plupart des applications maintenues par les développeurs/euses utilisent principalement des fichiers *.pot*/*.po* pour la traduction. Ceux-ci doivent généralement être modifiés manuellement et envoyés au dépôt de l'application.
gl: A maioría dos aplicativos mantidos por desenvolvedores individuais empregan principalmente ficheiros * .pot * / *. Po * para a tradución. Xeralmente hai que editalos manualmente e encamiñarse á reposición de aplicativos.
it: La maggior parte delle applicazioni mantenute dai singoli sviluppatori utilizzano principalmente i file *.pot*/*.po* per la traduzione. Coloro che generalmente hanno bisogno di essere modificati manualmente e impegnati al repo delle applicazioni.

source: How-To
fr: Tutoriels
gl: Guía básica
it: How-To (Come fare)

source: UBports Weblate
fr: Le Weblate d'UBports
gl: UBports en Weblate

source: You can go to `UBports Weblate <https://translate.ubports.com/projects/>`_, click on "Dashboard" button, go to a project, and start making anonymous suggestions without being registered. If you want to save your translations, you must be logged in.
fr: Vous pouvez accéder au `Weblate d'UBports <https://translate.ubports.com/projects/>`_, cliquer sur le bouton « Tableau de bord », vous rendre dans un projet et commencer à faire des suggestions de manière anonyme sans avoir à vous enregistrer. Si vous souhaitez enregistrer vos traductions, vous devez être connecté.
gl: Pode ir a `UBports Weblate <https://translate.ubports.com/projects/>` _, premer no botón "Taboleiro de control", ir a un proxecto e comezar a facer suxestións anónimas sen estar rexistrado. Se queres gardar as túas traducións, debes iniciar sesión.

source: For that, go to UBports Weblate and click on the "Register" button. Once in the "Registration" page, you'll find two options:
fr: Pour cela, rendez-vous dans le Weblate d'UBports et cliquez sur le bouton « S'inscrire ». Une fois dans la page « Inscription », vous aurez deux options :
gl: Para iso, vai a UBports Weblate e prema no botón "Rexistrarse". Unha vez na páxina "Rexistro", atoparás dúas opcións:
it: Per ciò, vai su UBports Weblate e clicca sul bottone "Registrati". Quindi nella pagina di "Registrazione", avrai due opzioni:

source: Register using a valid email address, a username, and your full name. You'll need to resolve an easy control question too.
fr: Inscrivez-vous en utilisant une adresse courriel valide, un nom d’utilisateur et votre nom complet. Vous devrez aussi résoudre une question de contrôle facile.
gl: Rexístrate usando un enderezo de correo electrónico válido, un nome de usuario e o teu nome completo. Tamén terás que resolver unha pregunta de control sinxelo.
it: Registrarti con un indirizzo di posta valido, un nome utente e il tuo nome per esteso. Dovrai pure passare una semplice domanda di controllo di accessi.

source: Register using a third party registration. Currently the system supports accounts from openSUSE, GitHub, Fedora, and Ubuntu.
fr: Inscrivez-vous en utilisant un service d’inscription tiers. Le système prend actuellement en charge openSUSE, GitHub, Fedora et Ubuntu.
gl: Rexístrate mediante un rexistro de terceiros. Actualmente o sistema admite contas de openSUSE, GitHub, Fedora e Ubuntu.
it: Registrarti usando una registrazione di terze parti. L'attuale sistema supporta account di openSUSE, GitHub, Fedora, e Ubuntu.

source: Once you're logged in, the site is self-explanatory and there you'll find all the options and customization you can do.
gl: Unha vez iniciado sesión, o sitio explícase por si mesmo e alí atoparás todas as opcións e personalización que podes facer.

source: Now, get on with it. The first step is to search if your language already exists in the project of your choice. If your language is not available for a specific project, you can add it yourself.
fr: Maintenant, continuez. La première étape consiste à rechercher si votre langue existe déjà dans le projet de votre choix. Si votre langue n'est pas disponible pour un projet spécifique, vous pouvez l'ajouter vous-même.
gl: Agora, segue con iso. O primeiro paso é buscar se o seu idioma xa existe no proxecto que escolla. Se o teu idioma non está dispoñible para un proxecto específico, podes engadilo ti mesmo.
it: Ora, vai avanti. Il primo passo è verificare che ci sia la tua lingua per il progetto che hai scelto. Se la tua lingua non è disponibile per un progetto specifico, puoi aggiungerla tu stesso.

source: .po/.ts File Editor
fr: Éditeurs de fichier .po/.ts
gl: Editor de ficheiros .po/.ts
it: Editor di file .po/.ts

source: If you want to work with *.po*/*.ts* files directly you need to know what you're doing for sure. The first thing you should always remember is:
fr: Si vous voulez travailler directement avec des fichiers *.po*/*.ts*, vous devez être sûr de ce que vous faites. La première chose que vous devez toujours vous rappeler est la suivante :
gl: Se quere traballar directamente con ficheiros * .po * / *. Ts * precisas saber con certeza o que fas. O primeiro que sempre debes recordar é:
it: Se vuoi lavorare con i file *.po*/*.ts*, devi sapere cosa stai facendo di sicuro. La prima cosa che dovresti sempre ricordare è:

source: Do **never** commit *.po* files to projects that are translated using weblate. This could break the whole translation exchange process with weblate.
fr: Ne jamais modifier des fichiers *.po* sur des projets traduits par Weblate. Cela pourrait rompre tout le processus d'échange de traduction avec Weblate.
gl: ** Nunca ** comprometa ficheiros * .po * a proxectos que se traducen usando weblate. Isto podería romper todo o proceso de intercambio de tradución con weblate.
it: Non impegnare **mai** i file *.po* nei progetti tradotti con weblate. Questo potrebbe interrompere l'intero processo di scambio di traduzioni con weblate.

source: As was said up above, you need a file editor of your choice and a GitHub/GitLab account to translate *.po*/*.ts* files directly. Idealy you do have `clickable <http://clickable.bhdouglass.com/en/latest/>`_ set up and know how to build an app.
fr: Comme expliqué précédemment, vous aurez besoin d'un éditeur de votre choix et d'un compte sur GitHub/GitLab pour traduire directement les fichiers *.po*/*.ts*. L'idéal serait que vous disposiez de `clickable <http://clickable.bhdouglass.com/en/latest/>`_ et que vous sachiez comment générer une application.
gl: Como se dixo anteriormente, precisa un editor de ficheiros que escolla e unha conta GitHub / GitLab para traducir directamente os ficheiros * .po * / *. Ts *. Ideamente, ten que configurar `http://clickable.bhdouglass.com/en/latest/>` clickable e saber construír un aplicativo.
it: Come è stato detto sopra, è necessario un editor di file di propria scelta e un account GitHub/GitLab per tradurre direttamente i file *.po*/*.ts*. Idealmente si è già configurato `clickable <http://clickable.bhdouglass.com/en/latest/>`_ e si sa come costruire un'applicazione.

source: There are online gettext .po editors and those you can install on your computer. You can choose whatever editor you want, but we prefer to work with free software only. There are too many plain text editors and tools to help you translate *.po*/*.ts* files to list here.
gl: Hai editores getpo .po en liña e aqueles que podes instalar no teu ordenador. Podes escoller o editor que queiras, pero preferimos traballar só con software libre. Hai demasiados editores de texto sinxelo e ferramentas para axudarche a traducir ficheiros * .po * / *. Ts * para listalos aquí.

source: For high quality translations it is recommended to go through all of the steps given below. Although if you are not familiar with building apps using clickable, skip the steps 4. to 6. Although, you may not be able to translate the latest strings and you will not know if the strings fit into the apps layout.
gl: Para traducións de alta calidade recoméndase seguir todos os pasos que se indican a continuación. Aínda que se non está familiarizado coa creación de aplicacións mediante o que se pode premer, omita os pasos 4. a 6. Non obstante, é posible que non poida traducir as últimas cadeas e non saberá se as cadeas encaixan no deseño dos aplicativos.

source: How to proceed:
fr: Comment procéder :
gl: Como proceder:
it: Come procedere:

source: Fork the apps repo into your GitHub or GitLab account
gl: Atope o repositorio de aplicativos na súa conta GitHub ou GitLab

source: Clone the repo locally or use GitLab's online editor
gl: Clonar o repositorio localmente ou usar o editor en liña de GitLab

source: (optional) Create a new branch for the translation
gl: (opcional) Crear unha nova rama para a tradución

source: Build the app using clickable to get up-to-date *.pot*/*.ts* template files
gl: Constrúe o aplicativo premendo para obter ficheiros de modelo * .pot * / *. Ts * actualizados

source: Update the desired *.po*/*.ts* language file(s) from the template
gl: Actualice os ficheiros de idioma * .po * / *. Ts * desexados desde o modelo

source: Translate all strings
gl: Traducir todas as cadeas

source: Build and install the app on your device and test the translations
gl: Construír e instalar o aplicativo no teu dispositivo e probar as traducións

source: (optional) Repeat steps 6. and 7. until you are satisfied with your work
gl: (opcional) Repita os pasos 6. e 7. ata que estea satisfeito co seu traballo

source: Push the translated *.po*/*.ts* file(s) to your forked repo [do NOT commit *.pot*/*.ts* template files]
gl: Empurre os ficheiros * .po * / *. Ts * traducidos no seu repositorio bifurcado [NON cometa * .pot * / *. Ts * ficheiros modelo]

source: Open a merge/pull request from your fork to the apps repo
gl: Abre unha solicitude de combinación / extracción desde a súa bifurcación á reposición de aplicativos

source: Translation Team Communication
fr: Communication de l'équipe de traduction
gl: Comunicación do equipo de tradución
it: Comunicazione con il gruppo di traduzioni

source: You may talk to others regarding translations by using `the forum category <https://forums.ubports.com/category/39/translations>`_ that UBports provides for this task. To use it you need to register, or login if you're registered already.
fr: Vous pouvez parler à d'autres personnes du sujet des traductions en utilisant `la catégorie de forum <https://forums.ubports.com/category/39/translations>`_ qu'UBports fournit pour cette tâche. Pour l'utiliser, vous devez vous inscrire, ou vous connecter si vous êtes déjà inscrit/e.
gl: Podes falar con outras persoas acerca das traducións usando "a categoría do foro <https://forums.ubports.com/category/39/translations>" _ que UBports ofrece para esta tarefa. Para usalo cómpre rexistrarse ou iniciar sesión se xa está rexistrado.
it: Si può parlare con altri per quanto riguarda le traduzioni utilizzando `la categoria forum <https://forums.ubports.com/category/39/translations>`_ che UBports fornisce per questo compito. Per utilizzarlo è necessario registrarsi, o effettuare il login se sei già registrato.

source: The only requirement is to start your post putting down your language in brackets in the "Enter your topic title here" field. For example, ``[Spanish] How to translate whatever?``
fr: La seule obligation est de commencer votre publication en mettant entre crochets votre langue dans le champ « Saisissez le titre de votre sujet ici ». Par exemple, ``[French] How to translate whatever?`` ([Français] Comment traduire n'importe quoi ? »)
gl: O único requisito é comezar a publicar o seu idioma entre parénteses no campo "Insira aquí o título do tema". Por exemplo, "[español] Como traducir o que sexa?"
it: L'unico requisito è di iniziare il tuo post precisando la tua lingua tra parentesi nel campo "Inserisci qui il titolo del tuo tema". Ad esempio, ``[Spagnolo] Come tradurre whatever?``

source: In your interactions with your team you'll find the best way to coordinate your translations.
fr: Dans vos interactions avec votre équipe, vous trouverez la meilleure façon de coordonner vos traductions.
gl: Nas túas interaccións co teu equipo atoparás o mellor xeito de coordinar as túas traducións.
it: Nelle tue interazioni con il gruppo, troverai il modo migliore per coordinare le tue traduzioni.

source: License
fr: Licence
gl: Licenza
it: Licenza

source: All the translation projects, and all your contributions to this project, are under a `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ license that you explicitly accept by contributing to the project.
fr: Tous les projets de traduction et toutes vos contributions à ce projet sont placés sous une licence `Creative Commons Attribution-Partage à l'identique 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ que vous acceptez explicitement en contribuant à ce projet.
gl: Todos os proxectos de tradución e todas as túas contribucións a este proxecto están baixo un "Creative Commons Recoñecemento-CompartirIgual 4.0 Internacional (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>" _ licenza que acepta explícitamente contribuíndo ao proxecto.
it: Tutte i progetti di traduzione, così come tutti i tuoi contributi a questo progetto sono sotto una licenza`Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ che esplicitamente accetti per contribuire al progetto.

source: Go to that link to learn what this exactly means.
fr: Visitez ce site pour apprendre ce que cela signifie exactement.
gl: Siga esa ligazón para aprender que significa exactamente.
it: Vai a quel collegamento per sapere ciò che significa esattamente.

source: About
fr: À propos
gl: Sobre
it: A proposito

source: User Guide
fr: Guide de l'utilisateur
gl: Guía de usuario
it: Guida Utente

source: Contribute
fr: Contribuer
gl: Contribuír
it: Contribuire

source: Development
fr: Développement
gl: Desenvolvedor
it: Sviluppo

source: Porting
fr: Portage
gl: Adaptación
it: Trasporto

source: Click Packages
fr: Paquets Click
gl: Paquetes click
it: Fare clic su Pacchetti

source: Ubuntu UI-Toolkit
gl: Caixa de ferrramentas da interface de usuario de Ubuntu

source: Welcome to the UBports documentation!
fr: Bienvenue dans la documentation d'UBports !
gl: Dámosche a benvida á documentación de UBports!
it: Benvenuto nella documentazione di UBports!

source: Welcome to the official documentation of the UBports project!
fr: Bienvenue dans la documentation officielle du projet UBports !
gl: Dámosche a benvida á documentación oficial do proxecto UBports!
it: Benvenuto nella documentazione ufficiale del progetto UBports!

source: UBports develops the mobile phone operating system Ubuntu Touch. Ubuntu Touch is a mobile operating system focused on ease of use, privacy, and convergence.
fr: UBports développe le système d'exploitation pour téléphone mobile Ubuntu Touch. Ubuntu Touch est un système d'exploitation mobile axé sur la facilité d'utilisation, le respect de la vie privée et la convergence.
gl: UBports desenvolve o sistema operativo móbil Ubuntu Touch. Ubuntu Touch é un sistema operativo móbil focalizado na facilidade de uso, privacidade e converxencia.
it: UBports sviluppa il sistema operativo mobile Ubuntu Touch. Ubuntu Touch è un sistema operativo mobile focalizzato sulla facilità d'uso, sulla privacy e sulla convergenza.

source: If you want to help improving this documentation, :doc:`the Documentation contribute page <contribute/documentation>` will get you started.
fr: Si vous voulez contribuer à améliorer cette documentation, :doc:`la page de contribution à la Documentation <contribute/documentation>` vous permettra de démarrer.
gl: Se quere axudar a mellorar a documentación, :doc:`a páxina de contribución á documentación <contribute/documentation>` axudaravos a comezar.
it: Se vuoi aiutare a migliorare questa documentazione, :doc:`la pagina Contributo alla documentazione <contribute/documentation>` ti aiuterà.

source: You may view this documentation in the following languages:
fr: Vous pouvez consulter cette documentation dans les langues suivantes :
gl: Pode ver esta documentación nas seguintes linguas:
it: Puoi vedere questa documentazione nelle seguenti lingue:

source: `English <https://docs.ubports.com/en/latest/>`_
fr: `Anglais <https://docs.ubports.com/en/latest/>`_
gl: `Inglés <https://docs.ubports.com/en/latest/>`_
it: `Inglese <https://docs.ubports.com/en/latest/>`_

source: `Català <https://docs.ubports.com/ca/latest/>`_
fr: `Catalan <https://docs.ubports.com/ca/latest/>`_
gl: `Catalán <https://docs.ubports.com/ca/latest/>`_
it: `Catalano <https://docs.ubports.com/ca/latest/>`_

source: `Français <https://docs.ubports.com/fr/latest/>`_
gl: `Francés <https://docs.ubports.com/fr/latest/>`_
it: `Francese <https://docs.ubports.com/fr/latest/>`_

source: `Deutsch <https://docs.ubports.com/de/latest/>`_
fr: `Allemand <https://docs.ubports.com/de/latest/>`_
gl: `Alemán <https://docs.ubports.com/de/latest/>`_
it: `Tedesco <https://docs.ubports.com/de/latest/>`_
