Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: `openstore-app on GitLab`_
fr: `openstore-app sur GitLab`_
gl: `openstore-app en GitLab`_
it: `openstore-app su GitLab`_

source: `Terminal on OpenStore`_
fr: `Terminal sur l'OpenStore`_
gl: `Terminal en OpenStore`_
it: `Terminale on OpenStore`_

source: `terminal-app on GitLab`_
fr: `terminal-app sur GitLab`_
gl: `terminal-app en GitLab`_
it: `terminale-app su GitLab`_

source: UBports Welcome
fr: Accueil d'UBports
gl: Dámosche a benvida a UBports
it: Benvenuti a UBports

source: `UBports Welcome on OpenStore`_
fr: `Accueil d'UBports sur l'OpenStore`_
gl: `Dámosche a benvida a UBports en OpenStore`_
it: ` Benvenuti a UBports on OpenStore`_

source: `ubports-app on GitLab`_
fr: `ubports-app sur GitLab`_
gl: `ubports-app en GitLab`_
it: `ubports-app su GitLab`_

source: Weather
fr: Météo
gl: Tempo
it: Il tempo

source: `Weather on OpenStore`_
fr: `Météo sur l'OpenStore`_
gl: `Tempo en OpenStore`_
it: `Il tempo su OpenStore`_

source: `weather-app on GitLab`_
fr: `weather-app sur GitLab`_
gl: `weather-app en GitLab`_
it: `il tempo-app on GitLab`_

source: Other preinstalled apps
fr: Autres applications préinstallées
gl: Outros aplicativos preinstalados
it: Altre applicazioni preistallate

source: The following applications are preinstalled in Ubuntu Touch but are not considered core apps. Most of the time these projects must be updated with the system because they use many system services which do not necessarily have a stable API.
fr: Les applications suivantes sont préinstallées dans Ubuntu Touch mais ne sont pas considérées comme des applications de base. La plupart du temps, ces projets doivent être mis à jour avec le système car ils utilisent de nombreux services du système qui ne possèdent pas nécessairement d'API stable.
gl: Os seguintes aplicativos están preinstalados en Ubuntu Touch pero non se consideran aplicativos básicos. A maioría das veces estes proxectos deben actualizarse co sistema porque utilizan moitos servizos do sistema que non necesariamente teñen unha API estable.
it: Le seguenti applicazioni sono preinstallate in Ubuntu Touch ma non sono considerate applicazioni core. Nella maggior parte dei casi questi progetti devono essere aggiornati con il sistema perché utilizzano molti servizi di sistema che non hanno necessariamente un'API stabile.

source: These apps may be more difficult to work with, but their repository should contain a document stating how to build and run them on a device.
fr: Ces applications peuvent être plus difficiles à utiliser, mais leurs dépôts devraient contenir un document expliquant comment les compiler et les exécuter sur un appareil.
gl: É posible que estes aplicativos sexan máis difíciles de traballar, pero o seu repositorio debería conter un documento no que se indique como construílas e executalas nun dispositivo.
it: Queste applicazioni possono essere più difficili da gestire, ma il loro repository (deposito) dovrebbe contenere un documento che spieghi come costruirle ed eseguirle su un dispositivo.

source: Browser (`morph-browser on GitHub`_)
fr: Navigateur (`morph-browser sur GitHub`_)
gl: Navegador (`morph-browser en GitHub`_)
it: Browser (`morph-browser su GitHub`_)

source: Contacts (`address-book-app on GitHub`_)
fr: Contacts (`address-book-app sur GitHub`_)
gl: Contactos (`address-book-app en GitHub`_)
it: Contatti (`rubrica-app su GitHub`_)

source: Camera (`camera-app on GitLab`_)
fr: Caméra (`camera-app sur GitLab`_)
gl: Cámara (`camera-app en GitLab`_)
it: Camera (`camera-app su GitLab`_)

source: External Drives (`ciborium on GitHub`_)
fr: Périphériques externes (`ciborium sur GitHub`_)
gl: Unidades externas (`ciborium en GitHub`_)
it: Unità esterne (`ciborium su GitHub`_)

source: Media Player (`mediaplayer-app on GitHub`_)
fr: Lecteur multimédia (`mediaplayer-app sur GitHub`_)
gl: Reprodutor multimedia (`mediaplayer-app en GitHub`_)
it: Lettore multimediale (`mediaplayer-app su GitHub`_)

source: Messaging (`messaging-app on GitHub`_)
fr: Messagerie (`messaging-app sur GitHub`_)
gl: Mensaxaría (`messaging-app en GitHub`_)
it: Messaggistica (`messaggistica-app su GitHub`_)

source: Phone (`dialer-app on GitHub`_)
fr: Téléphone (`dialer-app sur GitHub`_)
gl: Teléfono (`dialer-app en GitHub`_)
it: Telefono (`dialer-app su GitHub`_)

source: System Settings (`system-settings on GitHub`_)
fr: Paramètres du système (`system-settings sur GitHub`_)
gl: Configuración do sistema (`system-settings en GitHub`_)
it: Impostazioni di sistema (`impostazioni di sistema su GitHub`_)

source: Instructions for contributing to these applications can be found in their respective repositories.
fr: Les instruction pour contribuer à ces applications peuvent être trouvées dans leurs dépôts respectifs.
gl: As instrucións para contribuír a estes aplicativos pódense atopar nos respectivos repositorios.
it: Le istruzioni per contribuire a queste applicazioni si trovano nei rispettivi depositi (repositories).

source: Quality Assurance
fr: Assurance qualité
gl: Control de calidade
it: Controllo di qualità (Quality Assurance)

source: This page explains how to help the UBports QA team, both as an official member or a new contributor. Please also read the :doc:`issue tracking </about/process/issue-tracking>` and :doc:`bugreporting <bugreporting>` guides to better understand the workflow. For real-time communication, you can join our `telegram group <http://t.me/ubports_qa_team>`_.
fr: Cette page explique comment aider l'équipe d'assurance qualité d'UBports, à la fois comme un membre officiel et en tant que nouveau contributeur. Veuillez aussi lire les guides de :doc:`suivi des problèmes </about/process/issue-tracking>` et de :doc:`signalement de problèmes <bugreporting>` pour mieux comprendre le déroulement des processus. Pour communiquer en temps réel, vous pouvez joindre notre `groupe telegram <http://t.me/ubports_qa_team>`_.
gl: Esta páxina explica como axudar ao equipo de control de calidade de UBports, como membro oficial ou novo colaborador. Lea tamén as guías: doc: `issue tracking </ about / process / issue-tracking>` e: doc: `bugreporting <bugreporting>` para comprender mellor o fluxo de traballo. Para a comunicación en tempo real, podes unirte ao noso `grupo de telegramas <http://t.me/ubports_qa_team>` _.
it: Questa pagina spiega come aiutare il gruppo QA di UBports, sia come membro ufficiale o come nuovo contribuente. Leggi pure le guide come :doc:`tracciare i problemi </about/process/issue-tracking>` e :doc:`riportare bachi <bugreporting>` per comprendere meglio il flusso di lavoro. Per una comunicazione in tempo reale, puoi unirti al `gruppo telegram <http://t.me/ubports_qa_team>`_.

source: Smoke testing
fr: Bêta test
gl: Probas de fume
it: Beta test

source: To test the core functionality of the operating system, we have compiled `a set of standardized tests <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Run these tests on your device to :doc:`find and report bugs and regressions <bugreporting>`. It's usually run on all devices before a new release to make sure no new issues were introduced.
fr: Pour tester les fonctionnalités de base du système d'exploitation, nous avons sélectionné `un ensemble de tests standards <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Lancez ces tests sur votre appareil pour :doc:`trouver et signaler des problèmes ou des régressions <bugreporting>`. Ceci est fait d'habitude sur tous les modèles d'appareil avant de publier une nouvelle version pour détecter l'apparition d'éventuels nouveaux problèmes.
gl: Para probar a funcionalidade principal do sistema operativo, compilamos "un conxunto de probas estandarizadas <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots> _. Executa estas probas no teu dispositivo para: doc: `buscar e informar de erros e regresións <bugreporting>`. Normalmente execútase en todos os dispositivos antes dunha nova versión para asegurarse de que non se introduciron novos problemas.
it: Per testare le funzioni principali (core) del sistema operativo, abbiamo compilato `un set di test standardizzati<https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Esegui questi test sul tuo dispositivo per :doc:`trovare e riportare bug e regressioni <bugreporting>`. È solitamente eseguito su tutti i dispositivi prima di una nuova versione per assicurarsi di non aver introdotto nuovi problemi.

source: Confirming bug reports
fr: Confirmation des signalements de problèmes
gl: Confirmación dos informes de erro
it: Conferma dei bachi riportati

source: Unconfirmed bugreports are labeld **needs confirmation** to enable `global filtering <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Browse through the list, read the bugreports and try to reproduce the issues that are described. If necessary, add :doc:`missing information or logs, or improve the quality of the report by other means <bugreporting>`. Leave a comment stating your device, channel, build number and whether or not you were able to reproduce the issue.
fr: Les rapports de problèmes sont identifiés par les mots-clés **needs confirmation** (confirmation nécessaire) pour activer le `filtrage global <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Parcourez la liste, lisez les rapports et essayez de reproduire les problèmes qui sont décrits. Si nécessaire, ajoutez :doc:`des informations manquantes ou des rapports d'erreur, ou améliorez la qualité du rapport via d'autres moyens <bugreporting>`. Laissez un commentaire décrivant votre appareil, votre canal, votre numéro de version et si vous avez été en mesure de reproduire ou pas l'erreur.
gl: Os informes de erros non confirmados están etiquetados ** precisa confirmación ** para habilitar o "filtrado global <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation% 22> `__. Navega pola lista, le os informes de erros e intenta reproducir os problemas que se describen. Se é necesario, engada: doc: `falta información ou rexistros ou mellore a calidade do informe por outros medios <bugreporting>`. Deixe un comentario no que indique o seu dispositivo, canle, número de compilación e se foi capaz de reproducir ou non o problema.
it: I bugreport non confermati vengono etichettati **needs confirm** per abilitare il `filtraggio globale<https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Sfoglia la lista, leggi le segnalazioni di bug e cerca di riprodurre i problemi che vengono descritti. Se necessario, aggiungere :doc:`lascio informazioni o registri, o migliorare la qualità della relazione con altri mezzi <bugreporting>`. Lascia un commento che indica il tuo dispositivo, canale, numero di costruzione e se sei stato in grado di riprodurre il problema.

source: If you have write-access to the repository, you can replace the **needs confirmation** label with **bug** (to mark it confirmed) or **invalid** (if the issue is definitely not reproducible). In that case it should be closed.
fr: Si vous avez accès en écriture dans le dépôt, vous pouvez remplacer le mot-clé **needs confirmation** (confirmation nécessaire) par **bug** (problème) pour le marquer comme confirmé ou **invalid** (invalide) si le problème n'est pas reproductible. Dans ce cas, il devrait être fermé.
gl: Se tes acceso de escritura ao repositorio, podes substituír a etiqueta ** precisa confirmación ** por ** erro ** (para marcalo confirmado) ou ** non válido ** (se o problema definitivamente non se pode reproducir). Nese caso debería pecharse.
it: Qualora avessi un accesso in scrittura nel repository, potresti sostituire l'etichetta **needs confirmation** (**in attesa di conferma**) con **bug** (per marchiarlo confermato) oppure **invalid** (se il problema non fosse riproducibile). In questo caso dovrebbe essere chiuso.

source: If you find two issues describing the same problem, leave a comment and try to find their differences. If they are in fact identical, close the newer one and label it **duplicate**.
fr: Si vous trouvez deux problèmes portant sur le même sujet, laissez un commentaire et essayez de trouver leurs différences. S'ils sont en fait identiques, fermez le plus récent et attribuez lui le mot-clé **duplicate** (doublon).
gl: Se atopas dous problemas que describen o mesmo problema, deixa un comentario e intenta atopar as súas diferenzas. Se en realidade son idénticos, pecha o máis recente e etiquétalo como ** duplicado **.
it: Se trovassi due report che descrivono lo stesso problema, lascia un commento o prova a vedere dove differiscono. Se fossero di fatto identici, chiudine il più recente con una etichetta **duplicato** (**duplicate**).

source: Testing patches
fr: Tester les correctifs
gl: Comprobación dos parches
it: Provare delle pezze (patch)

source: Pull-requests can be tested using the `QA scripts <https://github.com/ubports/ubports-qa-scripts>`_. Run ``ubports-qa -h`` for usage information.
fr: Les contributions peuvent être testées en utilisant les `scripts de l'Assurance Qualité<https://github.com/ubports/ubports-qa-scripts>`_. Lancez ``ubports-qa -h`` pour les informations concernant l'utilisation.
gl: As solicitudes de extracción pódense probar empregando os `scripts QA <https://github.com/ubports/ubports-qa-scripts>` _. Executa "ubports-qa -h" para obter información de uso.
it: Le richieste possono essere testate usando gli script `QA <https://github.com/ubports/ubports-qa-scripts>`_. Eseguire ``ubports-qa -h`` per informazioni sull'uso.

source: Once the pull-request has been merged, the issue it fixes is moved to the quality assurance column of the `GitHub project <https://github.com/ubports/ubuntu-touch/projects/3>`__. Please check if the issues in this column are still present in the latest update on the devel channel, then see if anything else has broken in the update. Check if the developer mentioned specific things to look out for when testing and leave a comment detailing your experience. If you have write-access to the repository, you can move the issue back to **In Development** (and reopen it) or forward to **Release Candidate** as specified by the :doc:`issue tracking guidelines </about/process/issue-tracking>`.
fr: Une fois qu'un développeur a terminé de travailler sur un problème, celui-ci est déplacé dans la colonne assurance qualité du `projet sous GitHub <https://github.com/ubports/ubuntu-touch/projects/3>`__. Vérifiez si le problème persiste dans la dernière mise à jour sur le canal « Développement » et essayez de recréer un des problèmes causés. Regardez si le développeur a mentionné des choses spécifiques à vérifier lors du test et laissez un commentaire détaillant votre expérience. Si vous disposez des droits d'écriture dans le répertoire, vous pouvez déplacer le problème dans **In Development** (en développement) ou le transférer vers **Release Candidate** (version candidate) tel que spécifié dans les :doc:`recommandations de suivi des problèmes </about/process/issue-tracking>`.
gl: Unha vez que se fusionou a solicitude de extracción, o problema que soluciona móvese á columna de garantía de calidade do proxecto GitHub <https://github.com/ubports/ubuntu-touch/projects/3> `__. Comprobe se os problemas desta columna aínda están presentes na última actualización da canle de desenvolvemento e, a continuación, vexa se hai algunha outra cousa na actualización. Comproba se o programador mencionou cousas específicas que debes ter en conta ao probar e deixa un comentario detallando a túa experiencia. Se ten acceso de escritura ao repositorio, pode mover o problema de novo a ** En desenvolvemento ** (e reabrilo) ou reenviar ao ** Candidato de lanzamento ** segundo se especifica no: doc: `directrices de seguimento de problemas </ about / process / tracking-issue> `.

source: Initial triaging of issues
fr: Tri initial des problèmes
gl: Triaxe inicial dos problemas
it: Fase di prioritizzazione (triage) di un problema

source: Initial triaging of new issues is done by QA-team members with write-access to the repository. If a new issue is filed, read the report and add the correct labels as specified by the :doc:`issue tracking guidelines </about/process/issue-tracking>`. You can also immediately start confirming the bugreport.
fr: Le tri initial de nouveaux problèmes est réalisé par les membres de l'équipe de l'assurance qualité ayant les droits d'écriture dans le répertoire. Si un nouveau problème est signalé, lisez le rapport et ajoutez les mots-clés appropriés tel que spécifié dans les :doc:`recommandations de suivi des problèmes </about/process/issue-tracking>`. Vous pouvez également immédiatement commencer à confirmer le rapport.
gl: Os membros do equipo QA realizan o triado inicial de novas cuestións con acceso de escritura ao repositorio. Se presenta un novo problema, lea o informe e engada as etiquetas correctas segundo se especifica en: doc: `directrices de seguimento de problemas </ about / process / issue-tracking>`. Tamén pode comezar inmediatamente a confirmar o informe de erros.
it: La fase di prioritizzazione (triaging) di un nuovo problema è fatta dai membri del gruppo QA-team members con accesso in scrittura al repository. Se un nuovo problema è riportato, leggi il report e aggiungi le etichette corrette come specificato nelle :doc:`linee guida per tracciare problemi </about/process/issue-tracking>`. Puoi pure iniziare immediatamente con la conferma del bugreport.

source: If the new issue has already been reported elsewhere, label it **duplicate** and close it.
fr: Si le nouveau problème a déjà été signalé ailleurs, marquez-le comme **duplicate** (doublon) et fermez-le.
gl: Se o novo problema xa se informou noutro lugar, etiquétao como ** duplicado ** e péchao.
it: Se il problema è già stato riportato, etichettalo come **duplicato** (**duplicate**) e chiudilo.

source: Although English is the official base language for all UBports projects we believe you have the right to use it in any language you want.
fr: Bien que l'Anglais soit la langue de base officielle pour tous les projets menés par UBports, nous pensons que vous avez le droit de les utiliser dans toutes les langues que vous souhaitez.
gl: Aínda que o inglés é o idioma base oficial para todos os proxectos de UBports, cremos que tes o dereito de usalo no idioma que queiras.
it: Nonostante l'inglese sia la lingua officiale di base dei progetti di UBports, crediamo che tu abbia il diritto di usare la lingua che tu voglia.

source: We are working hard to meet that goal, and you can help as well. You decide how much time you can put into translation. From minutes to hours, everything counts.
fr: Nous travaillons dur pour atteindre cet objectif et vous pouvez également nous aider. Vous décidez du temps à investir dans la traduction. De quelques minutes à plusieurs heures, toutes les contributions comptent.
gl: Estamos a traballar duro para cumprir ese obxectivo e tamén podes axudar. Ti decides canto tempo podes dedicar á tradución. De minutos a horas, todo conta.
it: Stiamo lavorando duramente per raggiungere questo obiettivo e anche voi potete aiutarci. Siete voi a decidere quanto tempo potete dedicare alla traduzione. Dai minuti alle ore, tutto conta.

source: How does a text get translated (technical background)
gl: Como se traduce un texto (antecedentes técnicos)

source: Most apps running on Ubuntu Touch use `GNU gettext <https://www.gnu.org/software/gettext/>`_ for translations. A *.pot* template file holds an apps strings. From this template for every language an individual *.po* file is derived. Those *.po* files do contain the actual translations. To add a new language a new *.po* file needs to be created. To translate a string the *.po* file needs to be edited. Next to the original string (english in most cases) the appropriate translation needs to be entered following the *.po* gettext file syntax. Some apps do use `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`_ for translation. It does follow the same priciples only using *.ts* files for translations with another syntax. As template one *.ts* file is used.
fr: La plupart des applications fonctionnant sur Ubuntu Touch utilisent `GNU gettext <https://www.gnu.org/software/gettext/>`_ pour les traductions. Un fichier modèle *.pot* contient les chaînes de caractères d'une application. Un fichier *.po* individuel est dérivé de ce modèle pour chaque langue. Ces fichiers *.po* contiennent les traductions réelles. Pour ajouter une nouvelle langue, un nouveau fichier *.po* doit être créé. Pour traduire une chaîne, le fichier *.po* doit être édité. À côté de la chaîne originale (en anglais dans la plupart des cas), la traduction appropriée doit être saisie en suivant la syntaxe du fichier gettext *.po*. Certaines applications utilisent `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`_ pour la traduction. Elles suivent les mêmes principes en utilisant uniquement les fichiers *.ts* pour les traductions avec une autre syntaxe. Un fichier *.ts* est utilisé comme modèle.
gl: A maioría dos aplicativos que se executan en Ubuntu Touch usan `GNU gettext <https://www.gnu.org/software/gettext/>` _ para traducións. Un ficheiro de modelo * .pot * contén cadeas de aplicativos. Deste modelo para cada idioma derívase un ficheiro * .po * individual. Eses ficheiros * .po * conteñen as traducións reais. Para engadir un novo idioma cómpre crear un novo ficheiro * .po *. Para traducir unha cadea hai que editar o ficheiro * .po *. Xunto á cadea orixinal (inglés na maioría dos casos) hai que introducir a tradución adecuada seguindo a sintaxe do ficheiro gettext * .po *. Algúns aplicativos usan `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>` _ para a tradución. Segue os mesmos principios só usando ficheiros * .ts * para traducións con outra sintaxe. Como modelo úsase un ficheiro * .ts *.
it: La maggior parte delle applicazioni in esecuzione su Ubuntu Touch utilizzano `GNU gettext <https://www.gnu.org/software/gettext/>`_ per le traduzioni. Un file di modello *.pot* contiene una stringa di applicazioni. Da questo modello per ogni lingua deriva un singolo file *.po*. Questi file *.po* contengono le traduzioni effettive. Per aggiungere una nuova lingua è necessario creare un nuovo file *.po*. Per tradurre una stringa il file *.po* deve essere modificato. Accanto alla stringa originale (in inglese nella maggior parte dei casi) la traduzione appropriata deve essere inserita seguendo la sintassi del file gettext *.po*. Alcune applicazioni utilizzano `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`_ per la traduzione. Essa segue gli stessi pricipi utilizzando solo i file *.ts* per le traduzioni con un'altra sintassi. Come modello uno *.ts* file viene utilizzato.

source: Within an app strings are marked either this way ``i18n.tr("string")`` when using gettext or like this ``tr("string")`` when using QtLinguist. When the app is built those translatable strings are extracted and written into the *.pot* or *.ts* template files. The *.po* and *.ts* language files then need to be updated from their template.
gl: Dentro dun aplicativo, as cadeas márcanse deste xeito `i18n.tr (" cadea ")` cando se usa gettext ou como este `tr (" cadea ")` cando se usa QtLinguist. Cando o aplicativo está construído, esas cadeas traducibles extráense e escríbense nos ficheiros de modelos * .pot * ou * .ts *. Os ficheiros de idioma * .po * e * .ts * deberán actualizarse a partir do seu modelo.
