Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Contribution workflow
fr: Circuit de contribution
gl: Fluxo de traballo das contribucións
it: Flusso del contributo

source: The following steps will help you to make a contribution to this documentation after you have written a document.
fr: Les étapes suivantes vous aideront à apporter une contribution à cette documentation après avoir rédigé un document.
gl: Os seguintes pasos axudaranche a contribuír a esta documentación despois de escribir un documento.
it: I seguenti passaggi ti aiuteranno a contribuire a questa documentazione dopo aver scritto un documento.

source: You will need a GitHub account to complete these steps. If you do not have one, click `here <https://github.com/join>`_ to begin the process of making an account.
fr: Vous aurez besoin d'un compte GitHub pour réaliser ces étapes. Si vous n'en avez pas, cliquez `ici <https://github.com/join>`_ pour lancer le processus de création d'un compte.
gl: Necesitarás unha conta de GitHub para completar estes pasos. Se non a tes, prema en "aquí <https://github.com/join>" _ para comezar o proceso de creación dunha conta.
it: Avrai bisogno di un accesso a GitHub per completare questi passi. Se non ne avessi uno, fai click `qui <https://github.com/join>`_ per iniziarne il processo di creazione.

source: Forking the repository
fr: Clonage du répertoire
gl: Bifurcación do repositorio
it: Duplicando i repository

source: You can make more advanced edits to our documentation by forking `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ on GitHub. If you're not sure how to do this, check out the excellent GitHub guide on `forking projects <https://guides.github.com/activities/forking/>`_.
fr: Vous pouvez effectuer des modifications plus poussées dans notre documentation en clonant `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ sur GitHub. Si vous n'êtes pas certain sur la manière de procéder, consultez l'excellent guide de GitHub sur `le clonage de projets <https://guides.github.com/activities/forking/>`_.
gl: Podes facer edicións máis avanzadas na nosa documentación bifurcando `ubports / docs.ubports.com <https://github.com/ubports/docs.ubports.com>` _ en GitHub. Se non está seguro de como facelo, consulte a excelente guía de GitHub sobre `forking projects <https://guides.github.com/activities/forking/>` _.
it: Puoi fare delle modifiche più avanzate alla nostra documentazione deviando da `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ in GitHub. Se non fossi sicuro come farlo, controlla l'eccellente guida di GitHub sui `progetti di deviazione (forking projects) <https://guides.github.com/activities/forking/>`_.

source: Building the documentation
fr: Compilation de la documentation
gl: Compilación da documentación
it: Creazione della documentazione

source: If you'd like to build this documentation *before* sending a PR (which you should), follow these instructions on your *local copy* of your fork of the repository.
fr: Si vous souhaitez compiler cette documentation *avant* de proposer votre modification (ce que vous devriez faire), suivez ces instructions dans votre *copie locale* de votre clone du répertoire.
gl: Se desexa crear esta documentación * antes de * enviar un PR (o que debería), siga estas instrucións na súa * copia local * da súa bifurcación do repositorio.
it: Se volessi creare questa documentazione *prima* di inviare una PR (come dovrebbe essere), segui queste istruzioni per la tua *copia locale* della tua deviazione del repository.

source: The documentation can be built by running ``./build.sh`` in the root of this repository. The script will also create a virtual build environment in ``~/ubportsdocsenv`` if none is present.
fr: La documentation peut être compilée en exécutant ``./build.sh`` à la racine de ce répertoire. Le script créera également un environnement virtuel de compilation dans ``~/ubportsdocsenv`` s'il n'est pas déjà présent.
gl: A documentación pódese construír executando ". / Build.sh" na raíz deste repositorio. O script tamén creará un contorno de compilación virtual en "~ / ubportsdocsenv" se non hai ningún.
it: La documentazione può essere creata eseguendo ``./build.sh`` nella radice di questo repository. Lo script creerà anche un ambiente virtuale di creazione ``~/ubportsdocsenv``, qualora non fosse presente.

source: If all went well, you can enter the ``_build/html`` directory and open ``index.html`` to view the UBports documentation.
fr: Si tout s'est bien passé, vous pourrez accéder au répertoire ``_build`` et ouvrir ``index.html`` pour visualiser la documentation d'UBports.
gl: Se todo saíu ben, pode entrar no directorio "_build / html" e abrir "index.html" para ver a documentación de UBports.
it: Se tutto andasse bene, potrai accedere alla cartella ``_build`` e aprire ``index.html`` per vedere la documentazione di UBports.

source: If you have trouble building the docs, the first thing to try is deleting the build environment. Run ``rm -r ~/ubportsdocsenv`` and try the build again. Depending on when you first used the build script, you may need to run the ``rm`` command with ``sudo``.
fr: Si vous rencontrez des problèmes lors de la compilation de la documentation, la première chose à essayer est la suppression de l'environnement de compilation. Exécutez ``rm -r ~/ubportsdocsenv`` et essayez de le compiler de nouveau. En fonction du moment où vous avez utilisé pour la première fois le script de compilation, vous aurez besoin d'exécuter la commande ``rm`` avec ``sudo``.
gl: Se tes problemas para crear os documentos, o primeiro que debes probar é eliminar a contorna de compilación. Execute "rm -r ~ / ubportsdocsenv" e intente a compilación de novo. Dependendo de cando usou o script de compilación, pode que precise executar o comando "rm" con "sudo".
it: Se riscontri problemi nel compilare la documentazione, la prima cosa da tentare è rimuovere l'ambiente di sviluppo. Esegui il comando ``rm -r ~/ubportsdocsenv`` e tenta di nuovo la compilazione. A seconda di quando hai utilizzato per la prima volta lo script di compilazione, potresti aver bisogno di avviare il comando ``rm`` con ``sudo``.

source: Final check of your contribution
fr: Contrôle final de votre contribution
gl: Comprobación final da túa contribución
it: Verifica finale del contributo

source: After you have created your PR on github, the CI (continuous integration) system will make a test build of your contribution. Please double check whether this builds successfully and whether the result looks as you intended it to:
fr: Après avoir créé votre demande de fusion sur Github, le système d'intégration continue fera un test de votre contribution. Veuillez vérifier si cette génération est réussie et si le résultat est conforme à vos attentes :
gl: Despois de crear o teu PR en github, o sistema CI (integración continua) fará unha proba da túa contribución. Comprobe se foi construída correctamente e se o resultado ten o aspecto que pretendía:
it: Dopo aver creato il PR su github, il sistema CI (continuous integration) eseguirà una build di prova del vostro contributo. Si prega di controllare se la compilazione è andata a buon fine e se il risultato è quello desiderato:

source: Scroll to the bottom of the "Conversation" tab of your PR on github, here you will see the checks (You may have to click on "Show all checks")
fr: Faites défiler jusqu'au bas de l'onglet « Conversation » de votre demande de fusion sur Github. Vous verrez ici les vérifications (vous devrez peut-être cliquer sur « Afficher toutes les vérifications »)
gl: Desprácese ata a parte inferior da xanela "Conversa" do seu PR en github, aquí verá as comprobacións (Pode ter que premer en "Mostrar todas as comprobacións")
it: Scorrere in fondo alla scheda "Conversazione" della propria PR su github, per vedere i controlli (potrebbe essere necessario cliccare su "Mostra tutti i controlli")

source: It can have a yellow dot, i.e., "pending" then wait a few more seconds.
fr: Il se peut qu'un point jaune apparaisse, c'est-à-dire « en attente ». Dans ce cas, attendez quelques secondes de plus.
gl: Pode ter un punto amarelo, é dicir, "pendente" e agarde uns segundos máis.
it: Può avere un punto giallo, cioè "in attesa", quindi attendere qualche altro secondo.

source: Or it may have a red X, i.e., it failed. In this case please check why it failed
fr: Ou bien il peut avoir une croix rouge, c'est-à-dire qu'elle a échoué. Dans ce cas, veuillez vérifier pourquoi elle a échoué
gl: Ou pode ter un X vermello, é dicir, fallou. Neste caso, comprobe por que fallou
it: Oppure può avere una X rossa, cioè fallita. In questo caso, verificare il motivo del fallimento

source: If it shows a green check mark, it means the PR could be built successfully
fr: Si une case verte est cochée, cela signifie que la demande de fusion a pu être générée avec succès
gl: Se mostra unha marca de verificación verde, significa que o PR podería construírse con éxito
it: Se viene visualizzato un segno di spunta verde, significa che la PR può essere costruita con successo

source: Now please click on "Details",
fr: Veuillez maintenant cliquer sur « Détails »,
gl: Agora prema en "Detalles",
it: Ora cliccate su "Dettagli",

source: then "Artifacts" on the top right,
fr: puis « Artefacts » en haut à droite,
gl: despois "Artefactos" na parte superior dereita,
it: poi "Artefatti" in alto a destra,

source: then "_build/html/..index.html",
fr: puis « _build/html/..index.html »,
gl: despois "_build/html/..index.html",
it: poi "_build/html/..index.html",

source: and finally on "Go to start page".
fr: et enfin sur « Aller à la page de démarrage ».
gl: e finalmente en "Ir á páxina de inicio".
it: e infine su "Vai alla pagina iniziale".

source: Now you can browse a complete build of the UBports docs site with your contribution included. Double check whether your changes look ok.
fr: Vous pouvez maintenant parcourir une version complète du site de la documentation d'UBports avec votre contribution incluse. Vérifiez que vos modifications sont correctes.
gl: Agora podes navegar por unha compilación completa do sitio de documentos de UBports coa túa contribución incluída. Comprobe se os teus cambios parecen correctos.
it: Ora è possibile consultare una build completa del sito dei documenti di UBports con il proprio contributo incluso. Verificate se le vostre modifiche sono corrette.

source: Alternative methods to contribute
fr: Méthodes alternatives pour contribuer
gl: Métodos alternativos para contribuír
it: Metodi alternativi per contribuire

source: Translations
fr: Traductions
gl: Traducións

source: You may find the components of this document to translate at `its project in UBports Weblate`_.
fr: Le contenu de ce document est disponible à la traduction au niveau de `son projet sous le Weblate d'UBports`_.
gl: Pode atopar os compoñentes deste documento para traducir en `its project in UBports Weblate`_.
it: Puoi trovare i componenti di questo documento da tradurre in `its project in UBports Weblate`_.

source: Writing documents not in RST format
fr: Rédaction de documents dans un format autre que RST
gl: Escritura de documentos en formatos diferentes ao RST
it: Scrivere documenti non nel formato RST

source: If you would like to write documents for UBports but are not comfortable writing ReStructuredText, please write it without formatting and post it on the `UBports Forum`_ in the relevant section (likely General). Someone will be able to help you revise your draft and write the required ReStructuredText.
fr: Si vous souhaitez écrire des documents pour UBports mais que vous n'êtes pas à l'aise avec l'écriture en ReStructuredText, veuillez l'écrire sans formatage et l'afficher sur le `Forum UBports`_ dans la section appropriée (probablement Général). Quelqu'un pourra vous aider à réviser votre ébauche et à rédiger le texte restructuré requis.
gl: Se desexa escribir documentos para UBports pero non é cómodo escribir ReStructuredText, escriba sen formato e publíqueo no `Foro UBports`_ na sección correspondente (probablemente Xeral). Alguén poderá axudarche a revisar o borrador e escribir o texto reestruturado necesario.
it: In caso ti interessasse scrivere documenti per UBports ma non sei a tuo agio nel compilare un TestoRistrutturato, ti preghiamo di scriverlo e postarlo su `UBports Forum`_ nella relativa sezione (verosimilmente General). Qualcuno ti aiuterà a revisionare la tua bozza e a scrivere il TestoRistrutturato richiesto.

source: Uncomfortable with Git
fr: Mal à l'aise avec Git
gl: Incomodidade con Git
it: Scomodo con Git

source: If you've written a complete document in ReStructuredText but aren't comfortable using Git or GitHub, please post it on the `UBports Forum`_ in the relevant section (likely General). Someone will be able to help you revise your draft and submit it to this documentation.
fr: Si vous avez écrit un document complet dans ReStructuredText mais que vous n'êtes pas à l'aise avec Git ou GitHub, veuillez le poster sur le `Forum UBports`_ dans la section appropriée (probablement Général). Quelqu'un pourra vous aider à réviser votre ébauche et à la soumettre à cette documentation.
gl: Se escribiu un documento completo en ReStructuredText pero non se sente cómodo usando Git ou GitHub, publíqueo no `Foro UBports`_ na sección correspondente (probablemente Xeral). Alguén poderá axudarche a revisar o borrador e envialo a esta documentación.
it: Se hai scritto un documento completo in ReStructuredText ma non ti trovi bene a usare Git o GitHub, pubblicalo in `UBports Forum`_ nella sezione adeguata (probabilmente in General). Qualcuno ti aiuterà a correggere la bozza e a inviarlo a questa documentazione.

source: Current TODOs
fr: Actuellement à faire
gl: POR FACER actuais
it: Attuali TODOs

source: This section lists the TODOs that have been included in this documentation. If you know how to fix one, please send us a Pull Request to make it better!
fr: Cette page liste les choses à faire qui devraient être incluses dans cette documentation. Si vous savez comment en régler une, merci de nous envoyer une proposition pour l'améliorer !
gl: Esta sección enumera os TODO incluídos nesta documentación. Se sabes arranxar un, envíanos unha solicitude de extracción para melloralo!
it: Questa pagina elenca i DAFAREs che sono state incluse in questo documento. Se sai come risolverne uno, mandaci una PR per farlo come si deve!

source: To create a todo, add this markup to your page::
fr: Pour créer une chose à faire, ajoutez cet indicateur dans votre page ::
gl: Para crear un por facer, engada esta marcaxe á súa páxina::
it: Per creare un todo, aggiungi questo marcatore (markup) alla tua pagina::

source: Contributing to UBports
fr: Contribuer à UBports
gl: Contribuíndo a UBports
it: Contribuire a UBports

source: Welcome! You're probably here because you want to contribute to UBports. The pages you'll find below here will help you do this in a way that's helpful to both the project and yourself.
fr: Bienvenue ! Vous êtes probablement ici parce que vous souhaitez contribuer à UBports. Les pages que vous trouverez ici vous aideront à le faire de manière efficace à la fois pour le projet et pour vous-même.
gl: Dámosche a benvida! Probablemente estea aquí porque quere contribuír a UBports. As páxinas que atoparás aquí abaixo axudaranche a facelo dun xeito útil tanto para o proxecto como para ti mesmo.
it: Benvenuto! Probabilmente sei qui perchè vorresti contribuire a UBports. Le pagine che troverai di seguito, ti aiuteranno a farlo in modo utile per entrambi, il progetto e tu.

source: If you're just getting started, we always need help with :doc:`thorough bug reporting <bugreporting>`. If you are multilingual, :doc:`translations <translations>` are also a great place to start.
fr: Si vous venez juste d'arriver, nous avons toujours besoin d'aide avec le :doc:`signalement rigoureux d'un problème <bugreporting>`. Si vous êtes multilingue, les :doc:`traductions <translations>` sont également un très bon endroit pour démarrer.
gl: Se estás empezando, sempre precisamos axuda con: doc: `informe de erros completo <bugreporting>`. Se es multilingüe,: doc: `traducións <translations>` tamén son un bo lugar para comezar.
it: Se sei alle prime armi, abbiamo sempre bisogno di aiuto nel :doc:`riportare bachi <bugreporting>`. Se conosci più lingue, le :doc:`traduzioni <translations>` sono un bel punto di partenza.

source: If those aren't enough for you, see `our contribute page <https://ubports.com/page/vo-get-involved>`_ for an introduction of our focus groups.
fr: Si ce n'est pas suffisant pour vous, consultez `notre page de contribution <https://ubports.com/page/vo-get-involved>`_ pour une introduction à nos groupes de réflexion.
gl: Se eses non che son suficientes, consulta "a nosa páxina de contribución <https://ubports.com/page/vo-get-involved>" _ para unha introdución dos nosos grupos focais.
it: Se non fossero sufficienti per te, guarda `la nostra pagina di come contribuire <https://ubports.com/page/vo-get-involved>`_ per una introduzione dei gruppi di lavoro tematici (focus group).

source: Monetary support
fr: Soutien financier
gl: Apoio monetario
it: Supporto monetario

source: You can help us keep the lights on at UBports by becoming a patron on `Liberapay <https://liberapay.com/UBports/>`_ or `Patreon <https://www.patreon.com/ubports>`_!
fr: Vous pouvez nous aider à assurer la survie d’UBports en devenant un de nos mécènes sur `Liberapay <https://liberapay.com/UBports/>`_ ou `Patreon <https://www.patreon.com/ubports>`_ !
gl: Podes axudarnos a manter as luces acesas en UBports converténdote en mecenas en `Liberapay <https://liberapay.com/UBports/>` _ ou `Patreon <https://www.patreon.com/ubports>` _!
it: Puoi aiutarci nel mantenere vivo UBports diventandone un patreon (patrocinatore) su `Liberapay <https://liberapay.com/UBports/>`_ o su `Patreon <https://www.patreon.com/ubports>`_!

source: Your contribution finances our server infrastructure and debug services, and helps covering additional costs.
fr: Votre contribution finance notre infrastructure de serveur, nos services de dépannage et nous aide à couvrir les coûts supplémentaires.
gl: A súa contribución financia a nosa infraestrutura de servidores e servizos de depuración e axuda a cubrir custos adicionais.
it: Il tuo contributo contribuisce a finanziare la nostra infrastruttura di server e i servizi di debug, e aiuta a coprire costi addizionali.

source: This page will help you get started with developing the apps which are included with Ubuntu Touch.
fr: Cette page vous aidera à vous lancer dans le développement des applications qui sont inclues dans Ubuntu Touch.
gl: Esta páxina axudarache a comezar co desenvolvemento dos aplicativos os cales son incluídos con Ubuntu Touch.
it: Questa pagina vi aiuterà a iniziare a sviluppare le applicazioni incluse in Ubuntu Touch.

source: Core apps
fr: Applications de base
gl: Aplicativos principais
it: Core Apps (Nucleo Apps)

source: Core apps are applications which are included with UBports distributions of Ubuntu Touch **and** placed in the OpenStore for updates. Core apps are a good "first development" experience within UBports. Many are built with `Clickable`_, an easy to use build and test system for Ubuntu Touch apps. Most core apps can even be built and run without an Ubuntu Touch device!
fr: Les applications de base sont celles qui sont inclues dans les distributions d'Ubuntu Touch provenant d'UBports **et** placées pour mises à jour dans l'OpenStore. Les applications de base sont de bonnes expériences de « premiers développements » au sein d'UBports. Beaucoup sont compilées avec `Clickable`_, un système de compilation et de test facile à utiliser pour les applications sur Ubuntu Touch. La plupart de ces applications peuvent même être compilées et exécutées sans appareils sous Ubuntu Touch !
gl: Os aplicativos básicos son aplicativos que se inclúen coas distribucións UBports de Ubuntu Touch ** e ** colocadas no OpenStore para actualizacións. Os aplicativos básicos son unha boa experiencia de "primeiro desenvolvemento" dentro de UBports. Moitos están construídos con `Clickable`_, un sistema de compilación e proba doado de usar para os aplicativos Ubuntu Touch. A maioría dos aplicativos básicos poden incluso construírse e executarse sen un dispositivo Ubuntu Touch!
it: Le applicazioni core (nucleo) sono applicazioni incluse nelle distribuzioni UBports di Ubuntu Touch **e** inserite nell'OpenStore per gli aggiornamenti. Le applicazioni Core sono una buona esperienza di "primo sviluppo" all'interno di UBports. Molte sono costruite con `Clickable`_, un sistema di compilazione e test facile da usare per le applicazioni Ubuntu Touch. La maggior parte delle applicazioni core può essere costruita ed eseguita anche senza un dispositivo Ubuntu Touch!

source: Which core apps currently exist?
fr: Quelles applications de base existent actuellement ?
gl: Que aplicativos principais existen actualmente?
it: Quali applicazioni core esistono attualmente?

source: A full list of the Ubuntu Touch core apps follows.
fr: Voici la liste exhaustive des applications de base existant sur Ubuntu Touch.
gl: Lista completa de aplicativos principais de Ubuntu Touch a continuación.
it: Segue un elenco completo delle applicazioni principali di Ubuntu Touch.

source: Application Name
fr: Nom de l'application
gl: Nome do aplicativo
it: Nome applicazione

source: Store page
fr: Page dans la logithèque
gl: Páxina en OpenStore
it: Pagina del negozio

source: Code repository
fr: Dépôt du code
gl: Repositorio do código
it: Deposito del codice

source: Calculator
fr: Calculatrice
gl: Calculadora
it: Calcolatrice

source: `Calculator on OpenStore`_
fr: `Calculatrice sur l'OpenStore`_
gl: `Calculadora en OpenStore`_
it: `Calcolatrice su OpenStore`_

source: Calendar
fr: Agenda
gl: Calendario
it: Calendario

source: `Calendar on OpenStore`_
fr: `Agenda sur l'OpenStore`_
gl: `Calendario en OpenStore`_
it: `Calendario su OpenStore`_

source: `calendar-app on GitLab`_
fr: `calendar-app sur GitLab`_
gl: `calendar-app en GitLab`_
it: `calendario-app su GitLab`_

source: Clock
fr: Horloge
gl: Reloxo
it: Orologio

source: `Clock on OpenStore`_
fr: `Horloge sur l'OpenStore`_
gl: `Reloxo en OpenStore`_
it: `Orologio su OpenStore`_

source: `clock-app on GitLab`_
fr: `clock-app sur GitLab`_
gl: `clock-app en GitLab`_
it: `orologio-app su GitLab`_

source: File Manager
fr: Fichiers
gl: Xestor de ficheiros
it: Gestione File (file manager)

source: `File Manager on OpenStore`_
fr: `Fichiers sur l'OpenStore`_
gl: `Xestor de ficheiros en OpenStore`_
it: `Gestore File su OpenStore`_

source: `filemanager-app on GitLab`_
fr: `filemanager-app sur GitLab`_
gl: `filemanager-app en GitLab`_
it: `gestionefile-app su GitLab`_

source: Gallery
fr: Galerie
gl: Galería
it: Galleria

source: `Gallery on OpenStore`_
fr: `Galerie sur l'OpenStore`_
gl: `Galería en OpenStore`_
it: `Galleria su OpenStore`_

source: `gallery-app on GitLab`_
fr: `gallery-app sur GitLab`_
gl: `gallery-app en GitLab`_
it: `galleria-app su GitLab`_

source: `Music on OpenStore`_
fr: `Musique sur l'OpenStore`_
gl: `Música en OpenStore`_
it: `Musica su OpenStore`_

source: `music-app on GitLab`_
fr: `music-app sur GitLab`_
gl: `music-app en GitLab`_
it: `musica-app su GitLab`_

source: Notes
gl: Notas
it: Note

source: `Notes on OpenStore`_
fr: `Notes dans l'OpenStore`_
gl: `Notas en OpenStore`_
it: `Note su OpenStore`_

source: `notes-app on GitLab`_
fr: `notes-app sur GitLab`_
gl: `notes-app en GitLab`_
it: `note-app su GitLab`_

source: `OpenStore... on OpenStore`_
fr: `OpenStore... sur l'OpenStore`_
gl: `OpenStore... en OpenStore`_
it: `NegozioAperto... on OpenStore`_
