Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: rc: weekly if no critical issue exists in the devel channel
fr: rc : versions hebdomadaires s'il n'y a pas de problèmes critiques dans le canal développement
gl: versión candidata: semanalmente se non existe un problema crítico na canle desenvolvemento
it: rc: settimanali se non esistono problematiche critiche nel canale devel

source: stable: every six through eight weeks, if no critical issue exists in the rc channel
fr: stable : tous les six à huit mois , s'il n'y a pas de problème critique dans le canal de la version admissible
gl: estable: de seis a oito semanas, se non existe un problema crítico na canle versión candidata
it: stabile: ogni 6 o 8 settimane, se non esistono problematiche critiche nel canale rc

source: This is not a definitive cycle. Stable releases are ready when they're ready and should not introduce new bugs or ship very incomplete features. Since the OTA update can not be released before all critical issues are closed, the ETA might have to be moved by making an educated guess for when all the issues can be handled. If there are too many issues added to a milestone, they are either removed or added to the next milestone.
fr: Ce n'est pas un cycle gravé dans le marbre. Les versions stables sont jugées prêtes avec circonspection, elles ne doivent pas introduire de nouveaux problèmes ou comporter des fonctionnalités incomplètes. Comme la mise à jour OTA ne peut être publiée tant que tous les problèmes critiques ne sont pas résolus, la date estimée d'arrivée peut être réactualisée en faisant une estimation du temps nécessaire à la résolution de ces problèmes. S'il y a trop de problèmes associés à un jalon, ils sont soit retirés, soit ajoutés au jalon suivant.
gl: Isto non é un ciclo definitivo. As publicacións estables están listas cando están listas e non deberían introducir novos erros ou ter funcións incompletas. Como a actualización OTA non se pode publicar antes de que todos os problemas críticos estean pechados, o tempo estimado de publicación podería ter que ser movido facendo unha estimación de cando se poderán tratar todos os problemas. Se hai demasiados problemas engadidos a un fito, ou se eliminan ou se engaden ao seguinte fito.
it: Questo non è un ciclo definitivo. I rilasci stabili sono disponibili quando considerati pronti e quando non introducono problemi ulteriori o quando non incorporano funzionalità incomplete. Siccome non si possono rilasciare degli aggiornamenti OTA prima che tutti i bachi critici siano stati risolti, gli ETA potrebbero essere spostati per permetterne la gestione. In presenza di numero di problemi troppo elevato nella lista di un obiettivo intermedio, questi potrebbero essere rimossi o spostati all'interno del prossimo rilascio.

source: The content hub - tips and tricks
fr: Le centre de contenus - trucs et astuces
gl: O centro de contido: consellos e trucos
it: Hub dei contenuti - tips and tricks

source: Content Hub Share Page
fr: Page de partage du centre de contenus
gl: Páxina de contido do Hub de contido
it: Hub dei contenuti Pagina di condivisione

source: On Ubuntu Touch the apps are confined. The way of sharing files between them is through the Content Hub, a part of the system that takes care of file import, export and sharing.
fr: Sur Ubuntu Touch, les applications sont confinées. Une façon de partager des fichiers entre elles est de passer par le centre de contenus, une partie du système qui s'occupe de l'import, de l'export et du partage de fichiers.
gl: En Ubuntu Touch os aplicativos están confinadas. A forma de compartir ficheiros entre eles é a través do Content Hub, unha parte do sistema que se ocupa da importación, exportación e compartición de ficheiros.
it: Su Ubuntu Touch le app sono confinate. Il modo di condividere fie tra loro è attraverso il Content Hub, una parte del sistema che si occupa di importare, esportare e condividere file.

source: Different ways of sharing the content
fr: Différentes manières de partager le contenu
gl: Diferentes xeitos de compartir o contido
it: Modi diversi di condividere il contenuto

source: As we can see in the `Content Hub documentation <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, there are several ways of handling the file to be shared:
fr: Comme nous pouvons le voir dans la `documentation du centre de contenus<https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, il existe plusieurs manière de gérer le fichier à partager :
gl: Como podemos ver na documentación "Content Hub <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>" _, hai varias formas de tratar o ficheiro a compartir:
it: Come possiamo vedere nella `documentazionde del Content Hub <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, ci sono vari modi di gestire il file da condividere:

source: ``ContentHandler.Source`` (The selected app will provide a file to be imported)
fr: ``ContentHandler.Source`` (L'application sélectionnée va être la source du fichier à importer)
gl: "ContentHandler.Source" (O aplicativo seleccionado proporcionará un ficheiro para importar)
it: ``ContentHandler.Source`` (L'app selezionata verrà usata come sorgente del file importato)

source: ``ContentHandler.Destination`` (The selected app will be the destination for the exported file)
fr: ``ContentHandler.Destination`` (L'application sélectionnée sera la destination du fichier exporté)
gl: "ContentHandler.Destination" (O aplicativo seleccionado será o destino do ficheiro exportado)
it: ``ContentHandler.Destination`` (L'app selezionata verrà usata come destinazione del file esportato)

source: ``ContentHandler.Share`` (The selected app will be the destination for the exported file, which will then be shared externally)
fr: ``ContentHandler.Share`` (L'application sélectionnée va être la destination pour le fichier exporté, qui va ensuite être partagé)
gl: "ContentHandler.Share" (O aplicativo seleccionado será o destino do ficheiro exportado, que logo se compartirá externamente)
it: ``ContentHandler.Share`` (L'app selezionata sarà la destinazione per il file esportato, il quale sarà poi condiviso esternamente)

source: Importing
fr: Import
gl: Importando
it: Importazione

source: Webapp Creator on the OpenStore
fr: Créateur d'applications Web dans l'OpenStore
gl: Creador de Webapp no OpenStore
it: Webapp Creator sull'OpenStore

source: Looking into the code of Webapp Creator, we’ll find the code to import an image to be used as icon. Tapping on the place holder will open the Content Hub that will let us choose from where to import the image (`see the Webapp Creator source code <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)
fr: En regardant le code du créateur d'applications Web, nous trouvons le code pour importer une image à utiliser en tant qu'icône. Un appui sur le champ ouvre le centre de contenus qui nous laisse choisir à partir d'où importer l'image (`voir le code source du créateur d'applications Web <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)
gl: Buscando o código de Webapp Creator, atoparemos o código para importar unha imaxe que se usará como icona. Ao tocar o marcador de posición abrirase o Content Hub que nos permitirá escoller onde importar a imaxe (`ver o código fonte do creador de Webapp <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp- creator / app / ImportPage.qml # L38> `_)
it: Cercando all'interno del codice di Webapp Creator, troveremo il codice per importare un'immagine da utilizzare come icona. Cliccando sul segnaposto si aprirà l'Hub dei Contenuti, che permetterà di scegliere la posizione dalla quale importare l'immagine (`vedi il codice sorgente di Webapp Creator <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)

source: ``ContentPeerPicker`` is the element that shows the apps.
fr: ``ContentPeerPicker`` est l'élément qui affiche les applications.
gl: "ContentPeerPicker" é o elemento que mostra os aplicativos.
it: ``ContentPeerPicker`` è l'elemento che mostra le app.

source: ``contentType`` is passed in `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ as ContentType.Pictures. So, we will only see apps from which we only can import images. ``handler`` is passed in the same line as ContentHandler.Source. As we want to import an image from the app selected in the Content Hub.
fr: ``contentType``` est passé dans `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ comme ContentType.Pictures. Ainsi, nous ne verrons que les applications à partir desquelles nous ne pouvons importer que des images. ``handler`` est passé dans la même ligne que ContentHandler.Source. Comme nous voulons importer une image de l'application sélectionnée dans le Hub de Contenu.
gl: "ContentType" pasa en "Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>" _ como ContentType.Pictures. Entón, só veremos aplicativos das que só podemos importar imaxes. "manipulador" pasa na mesma liña que ContentHandler.Source. Como queremos importar unha imaxe do aplicativo seleccionado no Content Hub.
it: ``contentType`` viene passato in `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ come ContentType.Pictures. Quindi, vedremo solo le applicazioni da cui possiamo importare solo immagini. ``handler`` viene passato nella stessa riga come ContentHandler.Source. Poiché vogliamo importare un'immagine dall'applicazione selezionata nell'Hub dei contenuti.

source: Exporting
fr: Export
gl: Exportando
it: Esportazione

source: Gelek in the OpenStore
fr: Gelek dans l'OpenStore
gl: Gelek no OpenStore
it: Gelek nell'OpenStore

source: In Gelek, we are going to end with some saved games that we want to save in our device or share with ourselves (in Telegram and then save them to our computer).
fr: Dans Gelek, nous allons terminer avec quelques parties sauvegardées que nous voulons enregistrer sur notre appareil ou partager avec nous-même (dans Telegram pour les enregistrer ensuite sur notre ordinateur).
gl: En Gelek, imos rematar con algúns xogos gardados que queremos gardar no noso dispositivo ou compartilos con nós mesmos (en Telegram e logo gardalos no noso computador).
it: In Gelek, finiamo con alcuni giochi salvati che vogliamo salvare nel nostro dispositivo o condividere con noi stessi (in Telegram e poi salvarli al nostro computer).

source: Tapping on the download icon we will get a Content Hub to *save* the game file (which is actually an export).
fr: L'appui sur l'icône de téléchargement ouvrira le centre de contenus pour *enregistrer* le fichier de jeu (qui est en réalité un export).
gl: Premendo na icona de descarga obteremos un Content Hub para * gardar * o ficheiro do xogo (que en realidade é unha exportación).
it: Cliccando sull'icona di download otterremo un Content Hub per *salvare* il file del gioco (che in pratica è un esportazione).

source: The game file is a file of type ``glksave``. We will tell Content Hub that we are sending a file of type ``All`` (`see the Install Page code <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).
fr: Le fichier de jeu est un fichier de type ``glksave``. Nous allons dire au centre de contenus que nous envoyons un fichier de type ``All`` (Tout) (`voir le code de la page d'installation <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).
gl: O ficheiro do xogo é un ficheiro de tipo "glksave". Indicarémoslle a Content Hub que estamos enviando un ficheiro de tipo "Todo" ("consulte o código da páxina de instalación <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38> `_).
it: Il file del gioco è un file di tipo ``glksave``. Diremo al Content Hub che stiamo inviando un file di tipo ``All`` (`guardare la pagina di installazione <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).

source: ``contentType`` is ``ContentType.All``, so we will only see apps which are able to receive unmarked file types. ``handler`` is ``ContentHandler.Destination``, so the app selected should store the saved game.
fr: ``contentType`` est ``ContentType.All``, nous verrons donc uniquement les applications qui sont capables de recevoir des types de fichiers non marqués. ``handler`` est ``ContentHandler.Destination``, l'application sélectionnée devrait donc stocker la partie enregistrée.
gl: "contentType" é "ContentType.All", polo que só veremos os aplicativos que poden recibir tipos de ficheiros sen marcas. "Handler" é "ContentHandler.Destination", polo que o aplicativo seleccionado debería almacenar o xogo gardado.
it: ``contentType`` è ``ContentType.All``, quindi vedremo solo app capaci di ricevere file di tipo non definito. ``handler`` è ``ContentHandler.Destination``, quindi l'app selezionata dovrebbe memorizzare il gioco salvato.

source: Tapping on the File Manager we will save the saved game in the folder we choose.
fr: Nous enregistrerons la partie sauvegardée dans le dossier de notre choix en appuyant sur le gestionnaire de fichiers.
gl: Premendo no Xestor de ficheiros gardarase o xogo gardado no cartafol que escollemos.
it: Cliccando sul File Manager salveremo il gioco nella cartella da noi scelta.

source: Sharing
fr: Partage
gl: Compartindo
it: Condivisione

source: Similarly, tapping on the share icon will allow us to send the saved game through Telegram to ourselves (`see the Webapp Creator Import Page source code <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_). Sharing is similar to exporting, except the destination app may share the content externally (for example, over Telegram or text message).
fr: De la même manière, appuyer sur l'icône de partage permettra de nous envoyer le jeu sauvegardé via Telegram (`voir le code source ImportPage de l'application Webapp-Creator <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_). Le partage est similaire à l'export, sauf que l'application de destination peut partager le contenu à l'extérieur (par exemple, via Telegram ou texto).
gl: Do mesmo xeito, tocar a icona de compartir permitiranos enviar o xogo gardado a través de Telegram a nós mesmos ("vexa o código fonte da páxina de importación do creador de Webapp <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp- creator / app / ImportPage.qml # L38> `_). O uso compartido é similar ao da exportación, excepto que a aplicación de destino poida compartir o contido externamente (por exemplo, mediante Telegram ou mensaxe de texto).
it: In maniera simile, cliccando sull'icona di condivisione potremo inviare a noi stessi tramite Telegram il gioco salvato (`vedi il codice sorgente di Webapp Creator Import Page <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_). Condividere è simile all'esportazione, con la differenza che l'app di destinazione può condividere il contenuto esternamente (per esempio, attraverso Telegram o messaggi di testo).

source: The only difference between this and the previous code is that ``handler`` is ``ContentHandler.Share``.
fr: La seule différence entre ce code et le code précédent est que ``handler`` est ``ContentHandler.Share``.
gl: A única diferenza entre este e o código anterior é que "controlador" é "ContentHandler.Share".
it: L'unica differenza tra questo e il codice precedente è che ``handler`` è ``ContentHandler.Share``.

source: Wait a minute. Why the different apps?
fr: Attendez un instant : pourquoi des applications différentes ?
gl: Espera un momento. Por que hai diferentes aplicativos?
it: Aspetta un attimo. Perche app differenti?

source: Content Hub: Export vs Share
fr: Centre de contenus : exporter ou partager
gl: Centro de contido: Exportar vs Compartir
it: Hub dei contenuti: Esportazione e condivisione

source: Each developer can decide the rules each app would follow in relation to the Content Hub. Why the OpenStore is shown as the destination of an export?
fr: Chaque développeur peut décider des règles que chaque application suivra en relation avec le Hub de Contenu. Pourquoi l'OpenStore est-il affiché comme destination d'une exportation ?
gl: Cada desenvolvedor pode decidir as regras que seguiría cada aplicativo en relación co Content Hub. Por que OpenStore móstrase como o destino dunha exportación?
it: Ogni sviluppatore può decidere le regole che ogni applicazione deve seguire in relazione al Content Hub. Perché OpenStore è indicato come destinazione di un'esportazione?

source: Let’s check its manifest.json
fr: Vérifions son manifest.json
gl: Comprobemos o seu manifest.json
it: Controlliamo il suo manifest.json

source: The above code defines that the hooks for the app named ``"openstore"`` in relation to the ``"content-hub"`` should follow the rules defined in ``openstore-contenthub.json``
fr: Le code qui précède précise que les hooks pour l'application nommée ``"openstore"`` relativement au ``"content-hub"`` doivent suivre les règles définies dans ``openstore-contenthub.json``
gl: O código anterior define que os ganchos para o aplicativo chamado `` "openstore" `` en relación co `` "content-hub" `` deben seguir as regras definidas en `` openstore-contenthub.json``
it: Il codice precedente definisce che gli hook per l'applicazione chiamata ``"openstore"`` in relazione al ``"content-hub"`` devono seguire le regole definite in ``openstore-contenthub.json``

source: This means, the OpenStore will be the destination for *all* ``ContentTypes``.
fr: Cela signifie, l'Openstore sera la destination de *tout* les ``ContentTypes``.
gl: Isto significa que o OpenStore será o destino de * todos * "ContentTypes".
it: Questo significa che l'OpenStore sarà la destinazione per *tutti* i ``ContentTypes``.

source: What about uMatriks? Let’s see its ``content-hub.json``
fr: Qu'en est-il d'uMatriks? Regardons son ``content-hub.json``
gl: Que pasa con uMatriks? Vexamos o seu "content-hub.json"
it: A proposito di uMatriks? Vediamo il suo ``content-hub.json``

source: So, with this example, uMatriks will be able to be the destination, source and share app for all kinds of ``ContentType``. What about the other hooks in the ``manifest.json``? That is discussed in the next guide.
fr: Alors, avec cet exemple, uMatriks pourra devenir l'application de destination, source et de partage pour toute sorte de ``ContentType``. Qu'en est-il des autres hooks dans le ``manifest.json``? Cela est abordé dans le guide suivant.
gl: Así, con este exemplo, uMatriks poderá ser o destino, fonte e aplicativo compartido para todo tipo de "ContentType". Que pasa cos outros ganchos no "manifest.json"? Iso discútese na seguinte guía.
it: Quindi, con questo esempio, uMatriks potrà essere l' app di destinazione, sorgente e consivisione per tutti i tipi di ``ContentType``. Cosa approposito degli altri hooks nel ``manifest.json``? Questo sarà discusso nella prossima guida.

source: App development cookbook
fr: Livre de recettes pour le développement d'applications
gl: Recetario do desenvolvemento de aplicativos
it: Libro di cucina dello sviluppo di app

source: Unofficial resources
fr: Ressources non officielles
gl: Recursos non oficiais
it: Risorse non ufficiali

source: In this section you will find links to external resources about creating applications for Ubuntu Touch.
fr: Dans cette section, vous trouverez des liens vers des ressources externes sur la création d'applications pour Ubuntu Touch.
gl: Nesta sección atoparás ligazóns a recursos externos sobre a creación de aplicativos para Ubuntu Touch.
it: In questa sezione troverai i link a risorse esterne per creare applicazioni per Ubuntu Touch.

source: `Ubuntu Touch programming book <https://mimecar.gitbooks.io/ubuntu-touch-programming-course/content/>`__
gl: `Libro de programación Ubuntu Touch <https://mimecar.gitbooks.io/ubuntu-touch-programming-course/content/>`__

source: `Application Templates by fulvio <https://github.com/fulvio999/ubports_app_templates>`__
fr: `Modèles d'application par fulvio <https://github.com/fulvio999/ubports_app_templates>`__
gl: `Modelos do aplicativo por fulvio <https://github.com/fulvio999/ubports_app_templates>`__
it: Modelli di applicazione da fulvio <https://github.com/fulvio999/ubports_app_templates>`__

source: `Python examples by pavelprosto <https://forums.ubports.com/topic/5525/python-examples>`__
gl: `Exemplos de Python por pavelprosto <https://forums.ubports.com/topic/5525/python-examples>`__

source: `Python + UT apps quickstart guide by AaronTheIssueGuy <https://aaron.place/blogs/UbPortsPython.html>`__
gl: `Guía de inicio rápido de aplicativos Python + UT por AaronTheIssueGuy <https://aaron.place/blogs/UbPortsPython.html>`__

source: Playground
fr: Terrain de jeux
gl: Zona para xogar

source: In a completely free and open source community, it is natural to have community members exploring the limits of the platform in many many directions. In this section you will find links to external resources that do exactly that: Explore. The purpose of this list is to show the unlimited possibilities of an open platform like Ubuntu Touch.
fr: Dans une communauté totalement libre et open source, il est naturel d'avoir des membres de la communauté explorant les limites de la plate-forme dans de nombreuses directions. Dans cette section, vous trouverez des liens vers des ressources externes qui font exactement cela : explorer. Le but de cette liste est de montrer les possibilités illimitées d'une plate-forme ouverte comme Ubuntu Touch.
gl: Nunha comunidade de código aberto e totalmente gratuíta, é natural que os membros da comunidade exploren os límites da plataforma en moitas direccións. Nesta sección atoparás ligazóns a recursos externos que fan exactamente iso: Explorar. O propósito desta lista é mostrar as posibilidades ilimitadas dunha plataforma aberta como Ubuntu Touch.
it: In una comunità libera e open source, è naturale che alcuni suoi membri esplorino i limiti delle piattaforme in molte direzioni. In questa sezione troverai link a risorse esterne che vanno in questa direzione: Esplorare. Lo scopo di questa lista è quello di mostrare le possibilità illimitate di una piattaforma aperta come Ubuntu Touch.

source: The resources listed here do not necessarily represent the officially endorsed way of developing applications for Ubuntu Touch, but are interesting experiments.
fr: Les ressources répertoriées ici ne représentent pas nécessairement la meilleure manière de développer des applications pour Ubuntu Touch, mais sont des expériences intéressantes.
gl: Os recursos aquí enumerados non representan necesariamente o xeito oficialmente aprobado de desenvolver aplicativos para Ubuntu Touch, pero son experimentos interesantes.
it: Le risorse elencate qui non rappresentano necessariamente un modo ufficiale di sviluppare per Ubuntu Touch, ma sono esperimenti interessanti.

source: `Free Pascal development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
fr: `Le développement en Free Pascal pour Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
gl: `Desenvolvemento en Free Pascal para Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
it: `Sviluppo con Free Pascal per Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
