Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Start the installer and follow the on-screen instructions that will walk you through the installation process. That's it! Have fun exploring Ubuntu Touch!
fr: Démarrer l'installateur et suivre les instructions sur l'écran qui vous guideront à travers le processus d'installation. C'est tout ! Prenez plaisir en explorant Ubuntu Touch !
gl: Inicie o instalador e siga as instrucións en pantalla que o guiarán polo proceso de instalación. Xa está! Divírtete explorando Ubuntu Touch!
it: Avvia il programma di installazione e segui le istruzioni sullo schermo che ti guideranno attraverso il processo di installazione. Questo è tutto! Divertiti ad esplorare Ubuntu Touch!

source: If you're an experienced android developer and want to help us bring Ubuntu Touch to more devices, visit the :doc:`porting section </porting/index>`.
gl: Se es un desenvolvedor de Android experimentado e queres axudarnos a levar Ubuntu Touch a máis dispositivos, visita a: doc: `sección de portos </ porting / index>`.

source: Please do **not** start the installer with ``sudo``. It is meant to be run as a normal user, not as root. Using the installer with sudo will mess up permissions in the installer's cached files and lead to problems down the road. If the installer does not recognize your device, check the troubleshooting information below.
gl: ** Non ** inicie o instalador con "sudo". Está pensado para ser executado como un usuario normal, non como root. Usar o instalador con sudo desordenará os permisos nos ficheiros almacenados na caché do instalador e provocará problemas na estrada. Se o instalador non recoñece o seu dispositivo, consulte a información de solución de problemas a continuación.

source: If you need help, you can join UBports' support channels on `telegram <https://t.me/WelcomePlus>`_ or `matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ or ask a question `in the forum <https://forums.ubports.com/>`_ or on `askubuntu <https://askubuntu.com>`_. If you believe that the UBports Installer is not working correctly, you can also `file a new issue <https://github.com/ubports/ubports-installer/issues/new>`_ to help us solve the problem.
fr: Si vous avez besoin d'aide, vous pouvez rejoindre les salons de discussion et de soutient d'UBports sur `Telegram <https://t.me/WelcomePlus>`_ ou `Matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ ou poser une question `dans le forum <https://forums.ubports.com/>`_ ou sur `Ask Ubuntu <https://askubuntu.com>`_. Si vous pensez que l'Installateur d'UBports ne marche pas correctement, vous pouvez aussi `documenter un nouveau problème <https://github.com/ubports/ubports-installer/issues/new>`_ pour nous aider à le résoudre.
gl: Se precisa axuda, pode unirse ás canles de asistencia de UBports en `telegram <https://t.me/WelcomePlus>` _ ou `matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via = matrix.org & via = ubports.chat & via = disroot.org> `_ ou faga unha pregunta` no foro <https://forums.ubports.com/> `_ ou en` askubuntu <https://askubuntu.com> _. Se cres que o instalador de UBports non funciona correctamente, tamén podes "presentar un novo problema <https://github.com/ubports/ubports-installer/issues/new>" _ para axudarnos a resolver o problema.
it: Se avete bisogno di aiuto, potete unirvi ai canali di supporto di UBports su `telegram <https://t.me/WelcomePlus>`_ o `matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ o porre una domanda `nel forum <https://forums.ubports.com/>`_ o su `askubuntu <https://askubuntu.com>`_. Se ritenete che il programma di installazione di UBports non funzioni correttamente, potete anche `proporre un nuovo problema <https://github.com/ubports/ubports-installer/issues/new>`_ per aiutarci a risolvere il problema.

source: Connection lost during installation
fr: Connexion perdue pendant l'installation
gl: Perdeuse a conexión durante a instalación
it: Connessione persa durante l'installazione

source: Try a different USB cable and a different USB port on your computer. Cheap and old cables tend to lose connection during the installation.
fr: Essayez un autre câble USB et un autre port USB sur votre ordinateur. Les câbles bon marché et âgés ont tendance à perdre la connexion lors de l'installation.
gl: Proba cun cable USB diferente e un porto USB diferente no teu ordenador. Os cables baratos e antigos adoitan perder a conexión durante a instalación.
it: Provare un altro cavo USB e una diversa porta USB del computer. I cavi vecchi ed economici tendono a perdere la connessione durante l'installazione.

source: Windows Defender prevents Installer from starting
fr: Windows Defender empêche l'installateur de démarrer
gl: Windows Defender impide que o instalador se inicie
it: Windows Defender impedisce l'avvio del programma di installazione

source: We have contacted Microsoft about this problem, but they seem to think it's `enjoyable <https://twitter.com/Windows/status/1014984163433295875>`__. To dismiss the warning, click on "More Information", then select "Run anyway".
fr: Nous avons contacté Microsoft au sujet de ce problème, mais ils semblent penser que c'est une situation `normale <https://twitter.com/Windows/status/1014984163433295875>`__. Pour annuler l'avertissement, cliquez sur « Plus d'informations », puis sélectionnez « Exécuter quand même ».
gl: Contactamos con Microsoft sobre este problema, pero parece que é "agradable <https://twitter.com/Windows/status/1014984163433295875>" __. Para desactivar o aviso, faga clic en "Máis información" e logo seleccione "Executar de calquera xeito".
it: Abbiamo contattato Microsoft in merito a questo problema, ma sembra che la Microsoft ritenga che sia "piacevole" <https://twitter.com/Windows/status/1014984163433295875>`__. Per eliminare l'avviso, fate clic su "Ulteriori informazioni", quindi selezionate "Esegui comunque".

source: Device not detected
fr: Appareil non détecté
gl: Dispositivo non detectado
it: Dispositivo non rilevato

source: Virtual Machine
fr: Machine virtuelle
gl: Máquina virtual
it: Macchina Virtuale

source: If you're running the installer in a virtual machine, make sure the virtual machine is allowed to access the USB port.
fr: Si vous exécutez l'installateur dans une machine virtuelle, assurez-vous que la machine virtuelle a l'autorisation d'accéder au port USB.
gl: Se está a executar o instalador nunha máquina virtual, asegúrese de que a máquina virtual ten permiso para acceder ao porto USB.
it: Se si esegue il programma di installazione in una macchina virtuale, accertarsi che la macchina virtuale possa accedere alla porta USB.

source: Windows ADB drivers
fr: Pilotes ADB de Windows
gl: Controladores de Windows ADB

source: Install the `universal adb driver <http://adb.clockworkmod.com/>`_ and reboot your computer.
fr: Installez le `pilote ADB universel <http://adb.clockworkmod.com/>`_ et redémarrez votre ordinateur.
gl: Instale o `controlador universal adb <http://adb.clockworkmod.com/>` _ e reinicie o ordenador.
it: Installare il driver `universal adb <http://adb.clockworkmod.com/>`_ e riavviare il computer.

source: Fairphone 2 Vendor-ID
fr: Identification du fabricant pour le Fairphone 2
gl: Indentificación do fabricante para o Fairphone 2
it: Fairphone 2 ID-venditore

source: Run ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` in the terminal and restart the installer. This does not affect the snap package.
fr: Exécutez ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` dans le terminal et redémarrez l'installateur. Cela n'affecte pas le paquet Snap.
gl: Executa "echo 0x2ae5 >> ~ / .android / adb_usb.ini" no terminal e reinicia o instalador. Isto non afecta ao paquete snap.
it: Eseguire ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` nel terminale e riavviare il programma di installazione. Questo non influisce sul pacchetto snap.

source: Missing udev-rules
fr: Règles Udev manquantes
gl: Faltan as regras udev
it: Regole udev mancanti

source: If the device not detected on Linux and packages other than snap, you might be missing **udev-rules**.
fr: Si l'appareil n'est pas détecté sur Linux et pour les paquets autres que Snap, il se peut que vous manquiez de **règles Udev**.
gl: Se o dispositivo non se detecta en Linux e paquetes que non son snap, é posible que falte ** udev-rules **.
it: Se il dispositivo non viene rilevato su Linux e su pacchetti diversi da snap, potrebbe mancare **udev-rules**.

source: See if ``/etc/udev/rules.d/51-android.rules`` exists and contains the rules below. If not, add them to the file and run ``sudo service udev restart`` or ``sudo udevadm control --reload-rules && udevadm trigger``.
fr: Regardez si ``/etc/udev/rules.d/51-android.rules`` existe et contient les règles ci-dessous. Si ce n'est pas le cas, ajoutez-lesau fichier et exécutez ``sudo service udev restart`` ou ``sudo udevadm control --reload-rules && udevadm trigger``.
gl: Vexa se existe "/ etc / udev / rules.d / 51-android.rules" e contén as regras a continuación. Se non, engádeos ao ficheiro e execute "sudo service udev restart" ou "sudo udevadm control --reload-rules && udevadm trigger".
it: Verificare se ``/etc/udev/rules.d/51-android.rules`` esiste e contiene le regole seguenti. In caso contrario, aggiungerle al file ed eseguire ``sudo service udev restart`` o ``sudo udevadm control --reload-rules && udevadm trigger``.

source: Other issues
fr: Autres problèmes
gl: Outros problemas
it: Altri problemi

source: If the troubleshooting tips do not work, you might also try following the manual installation instructions for your device `on the devices page <https://devices.ubuntu-touch.io/>`_.
fr: Si les conseils de dépannage ne fonctionnent pas, vous pouvez également essayer de suivre les instructions d'installation manuelle de votre appareil `sur la page dédiée <https://devices.ubuntu-touch.io/>`_.
gl: Se os consellos de solución de problemas non funcionan, tamén pode intentar seguir as instrucións de instalación manual do dispositivo `na páxina de dispositivos <https://devices.ubuntu-touch.io/>` _.
it: Se i suggerimenti per la risoluzione dei problemi non funzionano, si può anche provare a seguire le istruzioni per l'installazione manuale del dispositivo `nella pagina dei dispositivi <https://devices.ubuntu-touch.io/>`_.

source: Install on legacy Android devices
fr: Installer sur des appareils Android plus anciens
gl: Instala en dispositivos Android herdados
it: Installa su dispositivi Android legacy

source: While the installation process is fairly simple on most devices, some legacy Bq and Meizu devices require special steps. This part of the guide does not apply to other devices.
fr: Bien que la procédure d'installation soit relativement simple pour la plupart des appareils, celle-ci requiert des étapes spécifiques pour certaines versions plus anciennes d'appareils Bq et Meizu. Cette partie du guide ne s'applique pas aux autres appareils.
gl: Aínda que o proceso de instalación é bastante sinxelo na maioría dos dispositivos, algúns dispositivos Bq e Meizu herdados requiren pasos especiais. Esta parte da guía non se aplica a outros dispositivos.
it: Mentre il processo di installazione è abbastanza semplice sulla maggior parte dei dispositivi, alcuni dispositivi legacy Bq e Meizu richiedono passaggi speciali. Questa parte della guida non si applica a nessun altro dispositivo.

source: This is more or less uncharted territory. If your device's manufacturer does not want you to install an alternative operating system, there's not a lot we can do about it. The instructions below should only be followed by experienced users. While we appreciate that lots of people want to use our OS, flashing a device with OEM tools shouldn't be done without a bit of know-how and plenty of research.
fr: C'est un territoire plus ou moins inexploré. Si le fabricant de votre appareil ne veut pas que vous installiez un système d'exploitation alternatif, il n'y a pas grand-chose que nous puissions faire. Les instructions ci-dessous ne doivent être suivies que par des utilisateurs expérimentés. Bien que nous apprécions le fait que beaucoup de gens veulent utiliser notre système d'exploitation, installer un appareil avec des outils du constructeur ne devrait pas être fait sans un peu de savoir-faire et beaucoup de recherches.
gl: Este é un territorio máis ou menos descoñecido. Se o fabricante do dispositivo non quere que instale un sistema operativo alternativo, non podemos facer moito ao respecto. As instrucións seguintes só deben ser seguidas por usuarios experimentados. Aínda que apreciamos que moita xente queira usar o noso sistema operativo, non se debería facer intermitente un dispositivo con ferramentas OEM sen un pouco de coñecemento e moitas investigacións.
it: Questo è più o meno territorio inesplorato. Se il produttore del tuo dispositivo non vuole che tu installi un sistema operativo alternativo, non c'è molto che possiamo fare. Le seguenti istruzioni devono essere seguite soltanto da utenti esperti. Apprezziamo il fatto che molte persone vogliano usare il nostro sistema operativo, ma flashare un dispositivo con strumenti OEM non andrebbe fatto senza un po' di conoscenze e parecchia ricerca.

source: Meizu devices are pretty much stuck on Flyme. While the MX4 can be flashed successfully in some cases, the Pro5 is Exynos-based and has its own headaches.
fr: Les appareils Meizu sont en grande partie bloqués sur Flyme. Alors que des installations sont possibles sur le MX4 avec succès dans certains cas, le Pro5 est basé sur Exynos et a ses propres problèmes.
gl: Os dispositivos Meizu están moi atascados en Flyme. Aínda que o MX4 pódese chamar con éxito nalgúns casos, o Pro5 está baseado en Exynos e ten as súas propias dores de cabeza.
it: I telefoni Meizu sono abbastanza bloccati con Flyme. Mentre l'MX4 può essere flashato con successo in alcuni casi, il Pro5 è basato su Exynos e ha i suoi grattacapi.

source: BE VERY CAREFUL! You are responsible for your own actions!
fr: SOYEZ TRÈS PRUDENT ! Vous êtes responsable de vos propres actions !
gl: SEDE MOI COIDADOSO! É responsable das súas propias accións!
it: SII MOLTO CAUTO! Sei responsabile delle tue azioni!

source: Disconnect all devices and non-essential peripherals from your PC. Charge your device on a wall-charger (not your PC) to at least 40 percent.
fr: Déconnectez tous les appareils et périphériques non essentiels de votre ordinateur. Chargez votre appareil sur un chargeur mural (et non sur votre ordinateur) à au moins 40%.
gl: Desconecte todos os dispositivos e periféricos non esenciais do seu PC. Cargue o dispositivo nun cargador de parede (non no PC) ata un 40% como mínimo.
it: Disconnetti dal tuo PC tutti i dispositivi e le periferiche non essenziali. Carica il tuo dispositivo con il caricabatteria (non con il tuo PC) fino ad almeno il 40 percento.

source: Download the Ubuntu Touch ROM for your device and extract the zip files:
fr: Téléchargez la ROM d'Ubuntu Touch pour votre appareil et extrayez les fichiers zippés :
gl: Descarga a ROM táctil de Ubuntu para o teu dispositivo e extrae os ficheiros zip:
it: Scarica la ROM di Ubuntu Touch per il tuo dispositivo ed estrai i file zippati:

source: Download the latest version of `SP flash tool <https://spflashtool.com/download/>`_ (*aka MTK flash tool*).
fr: Téléchargez la dernière version de `SP Flash Tool <https://spflashtool.com/download/>`_ (*aussi appelé MTK Flash Tool*).
gl: Descarga a última versión de `SP flash tool <https://spflashtool.com/download/>` _ (* tamén coñecida como ferramenta flash MTK *).
it: Scarica l'ultima versione di `SP flash tool <https://spflashtool.com/download/>`_ (*aka MTK flash tool*).

source: Extract the zip files
fr: Extrayez les fichiers zip
gl: Extraer os ficheiros zip
it: Estrai i file zip

source: Open a Terminal, enter the SP flash tool directory and run it with ``sudo ./flash_tool.sh``.
fr: Ouvrez un terminal, renseignez le répertoire de SP Flash Tool et lancez-le avec ``sudo ./flash_tool.sh``.
gl: Descarga a última versión de `SP flash tool <https://spflashtool.com/download/>` _ (* tamén coñecido como ferramenta flash MTK *).
it: Apri un terminale, entra nella directory di SP flash tool ed eseguilo con ``sudo ./flash_tool.sh``.

source: On Ubuntu 17.10, there are issues with flash_tool loading the shared library 'libpng12', so this can be used as a workaround:
fr: Sur Ubuntu 17.10, il y a des problèmes avec flash_tool qui charge la bibliothèque partagée 'libpng12', donc cela peut être utilisé comme une solution de contournement :
gl: En Ubuntu 17.10, hai problemas con flash_tool cargando a biblioteca compartida 'libpng12', polo que isto pode usarse como solución alternativa:
it: In Ubuntu 17.10, ci sono problemi con flash_tool nel caricare la libreria condivisa 'libpng12', dunque questo può essere utilizzato come metodo alternativo:

source: In the "Scatter-loading File" section, press the "choose" button and select the ``*Android_scatter.txt`` file from the archive you downloaded in the second step.
fr: Sélectionnez le fichier ``*Android_scatter.txt`` dans l'archive que vous avez téléchargée lors de la première étape en tant que fichier de chargement.
gl: Na sección "Ficheiro de carga de dispersión", prema o botón "escoller" e seleccione o ficheiro `` * Android_scatter.txt`` do arquivo que descargou no segundo paso.
it: Nella sezione "Scatter-loading File", premi il pulsante "choose" quindi seleziona il file ``*Android_scatter.txt`` dall'archivio che hai scaricato al punto due.

source: Choose "Firmware Upgrade" from the drop-down menu.
fr: Choisissez « Mise à jour du micrologiciel ».
gl: Escolla "Actualización de firmware" no menú despregable.
it: Scegli "Firmware Upgrade" dal menu a tendina.

source: If you select DOWNLOAD ONLY rather than FIRMWARE UPGRADE, you will end up with a useless brick rather than a fancy Ubuntu Touch device. Be sure to select FIRMWARE UPGRADE.
fr: Si vous sélectionnez TÉLÉCHARGER UNIQUEMENT au lieu de MISE À JOUR DU MICROLOGICIEL, vous obtiendrez une brique inutile en lieu et place d'un élégant appareil sous Ubuntu Touch. Assurez-vous de sélectionner MISE À JOUR DU MICROLOGICIEL.
gl: Se selecciona DESCARGAR SÓ en lugar de ACTUALIZAR FIRMWARE, acabarás cun ladrillo inútil en lugar dun dispositivo de luxo Ubuntu Touch. Asegúrese de seleccionar ACTUALZIAR FIRMWARE.
it: Se selezioni DOWNLOAD ONLY anziché FIRMWARE UPGRADE, ti ritroverai alla fine con un mattoncino inutile anziché un fighissimo dispositivo Ubuntu Touch. Assicurati di selezionare FIRMWARE UPGRADE.

source: Also, after selecting the ``*Android_scatter.txt``, the drop-down menu choice is reset to DOWNLOAD ONLY. Be sure to select it after selecting the file.
fr: De plus, après avoir sélectionné le fichier ``*Android_scatter.txt``, le choix du menu déroulant est réinitialisé sur TÉLÉCHARGER UNIQUEMENT. Assurez-vous de le sélectionner après avoir sélectionné le fichier.
gl: Ademais, despois de seleccionar o "* Android_scatter.txt", a opción do menú despregable restablécese a DESCARGAR SÓ. Asegúrese de seleccionalo despois de seleccionar o ficheiro.
it: Inoltre, dopo aver selezionato ``*Android_scatter.txt``, la scelta nel menu a tendina si resetta a DOWNLOAD ONLY. Assicurati di selezionare/riselezionare FIRMWARE UPGRADE dopo aver selezionato il file.

source: Turn your device completely off, but do not connect it yet.
fr: Éteignez complètement votre appareil, mais ne le connectez pas tout de suite.
gl: Apague o dispositivo completamente, pero aínda non o conecte.
it: Spegni completamente il tuo dispositivo, ma non connetterlo ancora.

source: Press the button labeled "Download".
fr: Appuyez sur le bouton « Téléchargement ».
gl: Preme o botón etiquetado como "Descargar".
it: Premi il tasto contrassegnato "Download".

source: Perform a final sanity-check that you selected the "Firmware Upgrade" option, not "Download Only".
fr: Effectuez une dernière vérification sur le fait que vous avez sélectionné l'option « Mise à jour du micrologiciel » et pas « Téléchargement ».
gl: Realice unha última comprobación de sanidade que seleccionou a opción "Actualización de firmware" e non "Só descargar".
it: Controlla ancora un'ultima volta di aver selezionato l'opzione "Firmware Upgrade" e NON "Download Only".

source: Make sure your device is off and connect it to your PC. Don't use a USB 3.0 port, since that's known to cause communication issues with your device.
fr: Assurez-vous que votre appareil est éteint et connecté à votre ordinateur. N'utilisez pas un port USB 3.0, car il s'agit d'une cause connue de problème de communication avec votre appareil.
gl: Asegúrate de que o teu dispositivo estea apagado e conéctao ao teu PC. Non use un porto USB 3.0, xa que se sabe que causa problemas de comunicación co seu dispositivo.
it: Assicurati che il tuo dispositivo sia spento e connettilo al PC. Non usare una porta USB 3.0, è già noto che causi problemi di comunicazione con il dispositivo.

source: `Magic <https://en.wikipedia.org/wiki/Clarke's_three_laws>`_ happens. Wait till all the progress bars ended.
fr: `La magie <https://fr.wikipedia.org/wiki/Trois_lois_de_Clarke>`_ opère. Attendez la fin de toutes les barres de progression.
gl: "Magic <https://en.wikipedia.org/wiki/Clarke's_three_laws>" _ acontece. Agarde a que rematen todas as barras de progreso.
it: `Avviene una magia <https://it.wikipedia.org/wiki/Tre_leggi_di_Clarke>`_ . Attendi la fine nella barra di avanzamento.

source: If the installation fails with a 100% red bar and hangs there (and logs says something like ``COM port is open. Trying to sync with the target...``), remove the ``modemmanager`` package as the one installed `is not compatible <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ with SP flash tool, close it and try again from step 4.
fr: Si l'installation échoue avec une barre rouge à 100 % et qu'elle y reste (et que les journaux indiquent quelque chose comme ``le port COM est ouvert. Essayez de synchroniser avec la cible...``), supprimez le paquet ``modemmanager`` puisque celui installé `n'est pas compatible <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ avec SP Flash Tool, fermez-le et essayez de nouveau à partir de l'étape 4.
gl: Se a instalación falla cunha barra 100% vermella e colga alí (e os rexistros din algo así como "O porto COM está aberto. Tentando sincronizar co destino ..."), elimine o paquete "modemmanager" como o único instalado `non é compatible <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for- bq-aquaris-e4-5-e-e5 /> `_ coa ferramenta flash SP, péchaa e inténtao de novo desde o paso 4.
it: Se l'installazione fallisce con una barra 100% rossa e lì si blocca (e il logs dice qualcosa tipo ``COM port is open. Trying to sync with the target...``), rimuovere il pacchetto``modemmanager`` perché quello installato`non è compatibile <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ con SP flash tool, chiudetelo e riprovate di nuovo dal punto 4.
