Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Connect the ubports device and the PC with a USB cable. Then copy the file using your filemanager.
fr: Connectez l'appareil UBports et le PC avec un câble USB. Copiez alors le fichier en utilisant votre gestionnaire de fichier.
gl: Conecte o dispositivo ubports e o PC cun cable USB. A continuación, copie o ficheiro usando o seu xestor de ficheiros.
it: Collega il dispositivo ubports e il PC con un cavo USB. Quindi copia il file usando il filemanager.

source: Or transfer the key via the internet by mailing it to yourself, or uploading it to your own cloud storage, or webserver, etc.
fr: Ou transférez la clé par Internet en vous l’envoyant par courriel, ou en la téléversant vers votre propre espace de stockage nuagique ou serveur Web, etc.
gl: Ou transfire a clave a través de internet enviándoa por correo ou cargándoa ao seu propio almacenamento na nube, ou servidor web, etc.
it: Oppure trasferisci la chiave via Internet inviandola a te stesso o caricandola sul tuo cloud storage o sul webserver, ecc.

source: You can also connect via :doc:`adb <adb>` and use the following command to copy it::
fr: Vous pouvez aussi vous connecter via :doc:`adb <adb>` et utiliser la commande suivante pour le copier::
gl: Tamén podes conectarte a través de: doc: `adb <adb>` e usar o seguinte comando para copialo ::
it: Puoi anche connetterti via :doc:`adb <adb>` e usare il seguente comando per copiarlo::

source: Configure your device
fr: Configurer votre appareil
gl: Configurar o teu dispositivo
it: Configura il tuo dispositivo

source: Now you have the public key on the UBports device. Let's assume it's stored as ``/home/phablet/id_rsa.pub``. Use the terminal app or and adb connection to perform the following steps on your phone. ::
fr: La clé publique se trouve maintenant sur l'appareil UBports. Il peut par exemple se trouver stocké sous le nom ``/home/phablet/id_rsa.pub``. Utilisez l'application terminal ou une connexion adb pour suivre les étapes suivantes sur votre téléphone::
gl: Agora tes a clave pública no dispositivo UBports. Supoñamos que está almacenado como "/ home / phablet / id_rsa.pub". Use o aplicativo de terminal ou a conexión adb para realizar os seguintes pasos no seu teléfono. ::
it: Ora hai la chiave pubblica sul dispositivo UBports. Supponiamo che sia memorizzato come ``/home/phablet/id_rsa.pub``. Utilizzare l'app terminale o/e la connessione adb per eseguire i seguenti passaggi sul telefono. ::

source: Now start the ssh server. If you are using an Android-based phone::
fr: Démarrez maintenant le serveur SSH. Si vous utilisez un téléphone basé sur Android ::
gl: Agora inicie o servidor ssh. Se está a usar un teléfono baseado en Android:
it: Ora avvia il servente ssh. Se stai usando un telefono basato su Android::

source: If you are using a Linux-based phone (like the Pinephone)::
fr: Si vous utilisez un téléphone basé sur Linux (comme le Pinephone) ::
gl: Se está a usar un teléfono baseado en Linux (como o Pinephone):
it: se stai usando un telefono basato su Linux (come il Pinephone)::

source: Connect
fr: Connexion
gl: Conectar
it: Connettere

source: Now everything is set up and you can use ``ssh`` ::
fr: Maintenant que tout est configuré, vous pouvez utiliser ``ssh``::
gl: Agora todo está configurado e pode usar ``ssh`` ::
it: Ora tutto è pronto per usare `` ssh`` ::

source: To identify the ip-address of your UT device , open Terminal application in your phone and run the following command::
gl: Para identificar o enderezo IP do seu dispositivo UT, abra o aplicativo Terminal no seu teléfono e execute o seguinte comando:

source: The output is a list of IP addresses separated by spaces . Use the first IP address from the list.
gl: A saída é unha lista de enderezos IP separados por espazos. Use o primeiro enderezo IP da lista.

source: Of course you can now also use ``scp`` or ``sshfs`` to transfer files.
fr: Vous pouvez bien sûr maintenant aussi utiliser ``scp`` ou ``sshfs`` pour transférer des fichiers.
gl: Por suposto, agora tamén podes usar "scp" ou "sshfs" para transferir ficheiros.
it: Ovviamente ora puoi anche usare `` scp`` o `` sshfs`` per trasferire i file.

source: `gurucubano: BQ Aquaris E 4.5 Ubuntu phone: How to get SSH access to the ubuntu-phone via Wifi <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en/chapter1.html>`_
fr: `gurucubano: BQ Aquaris E 4.5 Ubuntu phone : Comment obtenir un accès SSH vers un téléphone ubuntu via Wifi <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en/chapter1.html>`_
gl: `gurucubano: teléfono BQ Aquaris E 4.5 Ubuntu: Como obter acceso SSH ao teléfono ubuntu a través do Wifi <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en /capítulo1.html>`_
it: `gurucubano: BQ Aquaris E 4.5 Ubuntu phone: Come ottenere l'accesso SSH al telefono ubuntu via Wifi <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/it /chapter1.html>`_

source: Switch release channels
fr: Changer le canal de mise à jour
gl: Commutación das canles de lanzamento
it: Cambiare i canali di rilascio

source: You can change the release channel using the system settings. The 3 existing channels are stable, rc (release candidate) and devel (nightly builds). For more info, see :doc:`the release schedule </about/process/release-schedule>`.
fr: Vous pouvez changer le canal de diffusion en utilisant les paramètres du système. Les 3 canaux existants sont stable, candidate (rc pour release candidate) et développement (versions quotidiennes instables). Pour plus d'informations, consultez :doc:`le planning de diffusion</about/process/release-schedule>`.
gl: Pode cambiar a canle de lanzamento mediante a configuración do sistema. As 3 canles existentes son estables, rc (candidato á versión) e desenvolvo (versións nocturnas). Para obter máis información, consulte: doc: `o calendario de lanzamento </ about / process / release-schedule>`.
it: È possibile modificare il canale di rilascio utilizzando le impostazioni di sistema. I tre canali esistenti sono stable, rc (release candidate) e devel (nightly build). Per maggiori informazioni, vedere:doc: `pianificazione rilasci </about/process/release-schedule>`.

source: Android apps
fr: Applications Android
gl: Aplicativos de Android
it: App Android

source: `Anbox <https://anbox.io>`_ is a minimal Android container and compatibility layer that allows you to run Android apps on GNU/Linux operating systems such as UBports.
fr: `Anbox <https://anbox.io>`_ est un conteneur Android minimal et une couche de compatibilité qui permet de faire tourner des applications Android sur des systèmes d'exploitation GNU/Linux tels que UBports.
gl: `Anbox <https://anbox.io>` _ é un contedor mínimo de Android e unha capa de compatibilidade que lle permite executar aplicativos de Android en sistemas operativos GNU / Linux como UBports.
it: `Anbox <https://anbox.io>`_ è un minimalistico contenitore Android e livello di compatibilità che consente di eseguire app Android su sistemi operativi GNU/Linux come UBports.

source: When "host" is used in this document, it refers to another device which you can connect your Ubuntu Touch device to. Your host device must have ``adb`` and ``fastboot`` installed.
fr: Lorsque le terme « hôte » est utilisé dans ce document, il se réfère à un autre appareil auquel vous pouvez connecter votre appareil sous Ubuntu Touch. ``adb`` et ``fastboot`` doivent être installés sur votre appareil hôte.
gl: Cando se usa "host" neste documento, refírese a outro dispositivo ao que pode conectar o dispositivo Ubuntu Touch. O dispositivo anfitrión debe ter instalado "adb" e "fastboot".
it: Quando “host” è usato in questo documento, si riferisce ad un altro dispositivo al quale è possibile connettere il tuo dispositivo Ubuntu touch. Il tuo dispositivo host deve avere installato ``adb`` e ``fastboot``.

source: You will need to execute commands on your Ubuntu Touch device to install Anbox and APKs. You can do that by using the terminal application, but it is easier to use ``adb shell`` or :doc:`set up ssh </userguide/advanceduse/ssh>` to access your phone from your host.
fr: Vous devrez exécuter des commandes sur votre appareil Ubuntu Touch pour installer Anbox et les APK. Vous pouvez le faire en utilisant l'application Terminal, mais il est plus facile d'utiliser « adb shell » ou la :doc:`configuration de SSH </userguide/advanceduse/ssh>` pour accéder à votre téléphone depuis votre hôte.
gl: Deberá executar comandos no seu dispositivo Ubuntu Touch para instalar Anbox e APK. Podes facelo usando o aplicativo terminal, pero é máis doado usar "adb shell" ou: doc: `set up ssh </ userguide / advanceduse / ssh>` para acceder ao teu teléfono desde o teu servidor.
it: Per installare Andbox e le APK dovrai eseguire dei comandi sul tuo dispositivo Ubuntu Touch. Puoi farlo usando l'applicazione terminale, ma è più facile usare ``adb shell`` o :doc:`set up ssh </userguide/advanceduse/ssh>` per accedere al tuo telefono dal tuo host.

source: Supported devices
fr: Appareils pris en charge
gl: Dispositivos soportados
it: Dispositivi supportati

source: Make sure your device is supported:
fr: Assurez-vous que votre appareil est pris en charge :
gl: Asegúrese de que o seu dispositivo ten soporte:
it: Assicurati che il tuo dispositivo sia supportato:

source: Meizu Pro 5 (codename: ``turbo``, name of the boot partition: ``bootimg``)
fr: Meizu Pro 5 (nom de code : ``turbo``, nom de la partition de démarrage : ``bootimg``)
gl: Meizu Pro 5 (nome do código: ``turbo``, nome da partición de arranque: ``bootimg``)
it: Meizu Pro 5 (nome in codice: ``turbo``, nome della partizione di boot: ``bootimg``)

source: Fairphone 2 (codename: ``FP2``, name of the boot partition: ``boot``)
fr: Fairphone 2 (nom de code : ``FP2``, nom de la partition de démarrage : ``boot``)
gl: Fairphone 2 (nome do código: ``FP2``, nome da partición do arraque: ``boot``)
it: Fairphone 2 (nome in codice: ``FP2``, nome della partizione di boot: ``boot``)

source: OnePlus One (codename: ``bacon``, name of the boot partition: ``boot``)
fr: OnePlus One (nom de code : ``bacon``, nom de la partition de démarrage : ``boot``)
gl: OnePlus One (nome do código: ``bacon``, nome da partición de arranque: ``boot``)
it: OnePlus One (nome in codice: ``bacon``, nome della partizione di boot: ``boot``)

source: Nexus 5 (codename: ``hammerhead``, name of the boot partition: ``boot``)
fr: Nexus 5 (nom de code : ``hammerhead``, nom de la partition de démarrage : ``boot``)
gl: Nexus 5 (nome do código: ``hammerhead``, nome da partición de arranque: ``boot``)
it: Nexus 5 (nome in codice: ``hammerhead``, nome della partizione di boot: ``boot``)

source: BQ M10 HD (codename: ``cooler``, name of the boot partition: ``boot``)
fr: BQ M10 HD (nom de code : ``cooler``, nom de la partition de démarrage : ``boot``)
gl: BQ M10 HD (nome do código: ``cooler``, nome da partición de arranque: ``boot``)
it: BQ M10 HD (nome in codice: ``cooler``, nome della partizione di boot: ``boot``)

source: BQ M10 FHD (codename: ``frieza``, name of the boot partition: ``boot``)
fr: BQ M10 FHD (nom de code : ``frieza``, nom de la partition de démarrage : ``boot``)
gl: BQ M10 FHD (nome do código: ``frieza``, nome da partición de arranque: ``boot``)
it: BQ M10 FHD (nome in codice: ``frieza``, nome della partizione di boot: ``boot``)

source: You will need the device codename and the name of your boot partition for the installation.
fr: Le nom de code de votre appareil ainsi que le nom de la partition de démarrage sont nécessaires.
gl: Necesitará o nome de código do dispositivo e o nome da partición de arranque para a instalación.
it: Avrai bisogno del nome in codice del dispositivo e del della tua partizione di boot per l'installazione.

source: How to install
fr: Comment l'installer
gl: Como instalalo
it: Come installare

source: Installing Anbox is only recommended for experienced users.
fr: L'installation d'Anbox est uniquement recommandé aux utilisateurs et utilisatrices expérimenté(e)s.
gl: Instalar Anbox é só recomendado para usuarios expertos.
it: L'installazione di Anbox è consigliata solo agli utenti esperti.

source: If you own a Meizu Pro 5, a BQ M10 HD or a BQ M10 FHD you need to flash a specific boot image. **You will need to re-flash that image after each Ubuntu Touch update** so when you update from OTA-10 to OTA-11 for example. Not doing so can put your phone into an unstable state. Only update your Ubuntu Touch device when you have a computer with you to re-flash that boot image.
fr: Si vous possédez un Meizu Pro 5, un BQ M10 HD ou un BQ M10 FHD, vous devez installer une image de démarrage spécifique. **Vous devrez refaire une installation de cette image après chaque mise à jour d'Ubuntu Touch**, par exemple lorsque vous passerez de l'OTA-10 à l'OTA-11. Ne pas le faire peut mettre votre téléphone dans un état instable. Ne mettez à jour votre appareil sous Ubuntu Touch que lorsque vous avez un ordinateur avec vous pour refaire une installation de cette image de démarrage.
gl: Se tes un Meizu Pro 5, un BQ M10 HD ou un BQ M10 FHD necesitas facer flash unha imaxe de arranque específica. ** Deberá volver a flashear esa imaxe despois de cada actualización de Ubuntu Touch **, por exemplo, cando actualice de OTA-10 a OTA-11 por exemplo. Non facelo pode pór o teléfono nun estado inestable. Actualice o dispositivo Ubuntu Touch só cando teña un ordenador contigo para volver a flashear esa imaxe de inicio.
it: Se possiedi un Meizu Pro 5, un BQ M10 HD o un BQ M10 FHD devi flashare un'immagine di boot specifica. **Dovrai riflashare quell'immagine dopo ogni aggiornamento di Ubuntu Touch** per esempio quindi quando esegui l'aggiornamento da OTA-10 a OTA-11. Il non farlo può porre il tuo telefono in uno stato instabile. Aggiorna il tuo dispositivo Ubuntu Touch solo quando hai un computer con te per riflashare quell'immagine di boot.

source: Make sure your supported device runs on 16.04 (Anbox doesn't work on 15.04).
fr: Assurez-vous que votre appareil pris en charge tourne sous la version 16.04 (Anbox ne fonctionne pas sous la 15.04).
gl: Asegúrese de que o dispositivo compatible funciona o 16.04 (Anbox non funciona o 15.04).
it: Assicurati che il tuo dispositivo supportato operi sulla 16.04 (Anbox non funziona sulla 15.04).

source: Be sure to have a `backup <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ of the device.
fr: Assurez-vous d'avoir fait une `sauvegarde <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ de l'appareil.
gl: Asegúrese de ter unha "copia de seguridade <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>" _ do dispositivo.
it: Assicurati di avere un `backup <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ del dispositivo.

source: Open a terminal on your host and set some device specific variables by running ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, but replace the part between the quotes respectively with the codename and name of the boot partition for your device. See the above list.
fr: Ouvrez un terminal sur votre appareil hôte et définissez quelques variables spécifiques à l'appareil en exécutant ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, mais remplacez la partie entre guillemets avec respectivement le nom de code et le nom de la partition de démarrage de votre appareil. Regardez dans la liste pré-citée.
gl: Abre un terminal no teu servidor e establece algunhas variables específicas do dispositivo executando `` export CODENAME = "turbo" && export PARTITIONNAME = "bootimg" ``, pero substitúe a parte entre as comiñas respectivamente co nome de código e o nome da partición de arranque para o seu dispositivo. Vexa a lista anterior.
it: Aprire un terminale (su host) e impostare alcune variabile specifiche per il dispositivo eseguendo ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, sostituendo le parti tra virgolette, rispettivamente, con il “codename“ e il nome della partizione di boot del tuo dispositivo. Vedere la lista precedente.

source: Activate developer mode on your device.
fr: Activer le mode développeur sur votre périphérique.
gl: Activar o modo de desenvolvemento ao seu dispositivo.
it: Attivare la modalità sviluppatore sul tuo dispositivo.

source: Connect the device to your host and run the following commands from your host (same terminal you ran the ``export`` command in)::
fr: Connectez l'appareil à votre hôte et exécutez les commandes suivantes à partir de ce dernier (dans le même terminal que celui dans lequel vous avez exécuté la commande ``export``) ::
gl: Conecte o dispositivo ao seu servidor e execute os seguintes comandos desde o seu servidor (o mesmo terminal no que executou o comando "exportar"):
it: Collega il dispositivo al tuo host e da questo host esegui il seguente comando (lo stesso terminale dal quale hai eseguito il comando ``export``)::

source: Wait for the device to reboot, then run this from your host::
fr: Attendez que l'appareil redémarre, exécutez ensuite à partir de votre appareil hôte ::
gl: Agarde a que o dispositivo se reinicie e logo execúteo desde o seu servidor ::
it: Attendi il riavvio del dispositivo, quindi dal tuo host esegui questo::

source: Done! You might have to refresh the apps scope (pull down from the center of the screen and release) for the new Android apps to show up.
fr: C'est fait ! Il vous faudra sans doute actualiser le moteur de recherche des applications (faites glisser votre doigt vers le bas de l'écran et relâchez) afin que les nouvelles applications Android s'affichent.
gl: Feito! É posible que teña que actualizar o alcance dos aplicativos (tirar cara abaixo desde o centro da pantalla e soltar) para que aparezan os novos aplicativos de Android.
it: Fatto! Può darsi che sia da ricaricare lo scope delle app (premere al centro dello schermo, trascinare verso il basso e poi rilasciare) affinché siano visualizzate le nuove app Android.

source: You now have an adb server running inside your phone. This guide asks you to run some ``adb`` commands, sometime on your computer, sometime on your phone. Carefully check on which device you are!
fr: Vous avez maintenant un serveur ADB qui tourne à l'intérieur de votre téléphone. Ce guide vous demande d'exécuter des commandes « adb », parfois sur votre ordinateur, parfois sur votre téléphone. Vérifiez soigneusement sur quel appareil vous êtes !
gl: Agora tes un servidor adb funcionando dentro do teu teléfono. Esta guía pídelle que execute algúns comandos "adb" nalgún momento no seu computador ou no seu teléfono. Comproba coidadosamente en que dispositivo es!
it: Hai ora un servente adb in esecuzione nel tuo telefono. Questa guida ti chiede di eseguire alcuni comandi `` adb '', a volte sul tuo computer, a volte sul tuo telefono. Controlla attentamente su quale dispositivo ti trovi!

source: You can check that adb server is correctly running locally on your phone by opening the terminal app and enter ``adb devices``. You should see something like::
fr: Vous pouvez vérifier que le serveur ABD fonctionne correctement en local sur votre téléphone en ouvrant l'application Terminal et en saisissant « adb devices ». Vous devriez voir quelque chose comme ::
gl: Podes comprobar que o servidor adb está funcionando correctamente no seu teléfono abrindo o aplicativo terminal e escriba "dispositivos adb". Debería ver algo como:
it: Puoi verificare che il servente adb sia correttamente in esecuzione localmente sul tuo telefono, aprendo l'app terminale e inviandoo ``adb devices``. Dovresti vedere qualcosa come::

source: How to install new APKs
fr: Comment installer de nouveaux APK
gl: Como instalar APKs novos
it: Come installare nuove APK

source: Copy the APK to ``/home/phablet/Downloads``, then run the following from your host::
fr: Copiez l'APK dans ``/home/phablet/Downloads``, puis exécutez la commande suivante à partir de votre appareil hôte ::
gl: Copia o APK en "/ home / phablet / Downloads" e, a continuación, executa o seguinte desde o teu servidor:
it: Copiare la APK in ``/home/phablet/Downloads``, quindi eseguire il seguente comando dal tuo host::

source: Keep your apps up to date
fr: Gardez vos applications à jour
gl: Actualización constante dos aplicativos
it: Mantenere le tue app aggiornate

source: To keep your apps up to date you can use of F-Droid or ApkTrack. If you want to install any of the above apps you can find them here:
fr: Pour maintenir vos applications à jour, vous pouvez utiliser F-Droid ou ApkTrack. Si vous souhaitez installer l'une des applications ci-dessus, vous pouvez les trouver ici :
gl: Para manter os teus aplicativos actualizados, podes usar F-Droid ou ApkTrack. Se queres instalar algún dos aplicativos anteriores podes atopalos aquí:
it: Per mantenere aggiornate le tue app puoi utilizzare F-Droid o ApkTrack. Se vuoi installare una di queste app, le puoi trovare qui:

source: How to uninstall apps
fr: Comment désinstaller des applications
gl: Como desinstalar aplicativos
it: Come disinstallare le app

source: To uninstall apps, run ``adb uninstall [APP_ID]`` from your Ubuntu Touch device::
fr: Pour désinstaller des applications, exécutez ``adb uninstall [APP_ID]`` à partir de votre appareil sous Ubuntu Touch::
gl: Para desinstalar aplicativos, execute "adb uninstall [APP_ID]" desde o dispositivo Ubuntu Touch ::
it: Per disinstallare le applicazioni, eseguire ``adb uninstall [APP_ID]`` dal tuo dispositivo Ubuntu Touch::

source: Access Android storage
fr: Accéder à l'espace de stockage d'Android
gl: Acceder ao almacenamento de Android
it: Spazio di archiviazione Android

source: Android storage is located at ``/home/phablet/anbox-data/data/media/0``.
fr: L'espace de stockage d'Android est situé à l'adresse ``/home/phablet/anbox-data/data/media/0``.
gl: O almacenamento de Android atópase en "/ home / phablet / anbox-data / data / media / 0".
it: Lo spazio di archiviazione Android si trova in ``/home/phablet/anbox-data/data/media/0``.

source: Links to android libraries can be made in their respective XDG counterparts::
fr: Les liens vers les bibliothèques d'Android peuvent être faits dans leurs équivalents XDG respectifs ::
gl: As ligazóns a bibliotecas de Android pódense facer nos seus homólogos XDG respectivos:
it: È possibile creare collegamenti alle librerie Android nelle rispettive controparti XDG::

source: Troubleshooting
fr: Résolution de problèmes
gl: Solución de problemas
it: Risoluzione dei problemi

source: If installing ``anbox-ubuntu-touch`` or ``android-tools-adb`` on the device fails with an error about unsufficient space, try this::
fr: Si l'installation sur l'appareil de ``anbox-ubuntu-touch`` ou de ``android-tools-adb`` échoue en raison d'une erreur d'espace insuffisant, essayez ceci::
gl: Se a instalación de "anbox-ubuntu-touch" ou "android-tools-adb" no dispositivo falla cun erro de espazo insuficiente, proba isto ::
it: Se l'installazione sul dispositivo di ``anbox-ubuntu-touch`` o ``android-tools-adb`` fallisce con un errore di spazio insufficiente, provare così::

source: When you want to install an apk but get the error ``Invalid APK file`` that error could also mean "file not found"
fr: Lorsque vous souhaitez installer un APK mais que vous obtenez l'erreur ``Fichier APK invalide``, cette erreur peut aussi signifier « fichier non trouvé »
gl: Cando desexa instalar un apk pero recibe o erro "Arquivo APK non válido", ese erro tamén pode significar "ficheiro non atopado"
it: Se durante l'installazione di un apk si ottiene l'errore ``Invalid APK file``, ciò può anche significare "file non trovato"
