Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Just run the command for your selected device if it's below. Then, run ``adb kill-server`` followed by the command you were initially trying to run.
fr: Lancez la commande seulement pour l'appareil sélectionné s'il est dessous. Ensuite, lancez ``adb kill-server`` suivi par la commande que vous aviez initialement essayé de lancer.
gl: Só tes que executar o comando do dispositivo seleccionado se está debaixo. A continuación, execute "adb kill-server" seguido do comando que inicialmente intentaba executar.
it: Esegui semplicemente il comando per il tuo dispositivo selezionato, se mostrato qui sotto. Quindi, esegui ``adb kill-server`` seguito dal comando che inizialmente stavi cercando di eseguire.

source: CalDAV and CardDAV synchronization
fr: Synchronisation CalDAV et CardDAV
gl: Sincronización de CalDAV e CardDAV
it: Sincronizzazione CalDAV e CardDAV

source: CalDAV and CardDAV are protocols to synchronize calendars and contacts with a remote server. Many email-hosters provide a CalDAV and CardDAV interface.
fr: CalDAV et Card DAV sont des protocoles permettant de synchroniser les calendriers et les contacts avec un serveur distant. De nombreux hébergeurs de courriels fournissent une interface CalDAV et CardDAV.
gl: CalDAV e CardDAV son protocolos para sincronizar calendarios e contactos cun servidor remoto. Moitos servidores de correo electrónico fornecen unha interface CalDAV e CardDAV.
it: CalDAV e CardDAV sono protocolli per sincronizzare calendari e contatti con un server remoto. Molti host di posta elettronica forniscono un'interfaccia CalDAV e CardDAV.

source: **Note:** CalDAV Sync can also be set up in using the calendar app. Open the app, click on the little calendar icon in the top right corner and select "Add internet calendar > Generic CalDAV". Enter your calendar URL as well as your username and password to complete the process.
fr: **Note:** La synchronisation CalDAV peut être configurée en utilisant l'application Agenda. Ouvrez l'application, cliquez sur la petite icône de calendrier située dans le coin en haut à droite et sélectionnez « Ajouter un agenda en ligne » puis « CalDAV générique ». Saisissez le lien de votre agenda ainsi que votre identifiant et votre mot de passe pour finir la configuration.
gl: ** Nota: ** CalDAV Sync tamén se pode configurar usando o aplicativo de calendario. Abre o aplicativo, prema na pequena icona do calendario na esquina superior dereita e selecciona "Engadir calendario de internet> CalDAV xenérico". Insira o URL do seu calendario, así como o seu nome de usuario e contrasinal para completar o proceso.
it: **Nota:** La sincronizzazione CalDAV puo essere impostata anche dall'applicazione Calendario. Aprire l'app, cliccare sopra la piccola icona del calendario in alto a destra e selezionare "Aggiungi calendario online > Generic CalDAV". Inserire l'URL del tuo calendario, nome utente e la password per completare il processo.

source: At the moment, there is no carddav implementation directly accessible from the Ubuntu Touch graphical user-interface, so the only way to sync carddav is by using syncevolution + cron. However, there is a simple way to do that with a script that you can run in the terminal or via phablet SSH connection. These instructions work for caldav as well.
fr: Pour le moment, il n'y a pas d’implémentation CardDAV directement accessible à partir de l'interface graphique d'Ubuntu Touch. Pour synchroniser CardDAV, il faut donc utiliser syncevolution et cron. Cependant, il y a une façon simple de le faire avec un script que vous pouvez lancer dans le terminal ou via la connexion SSH. Ces instructions fonctionnent aussi avec CalDAV.
gl: Polo momento, non hai ningunha implementación de carddav directamente accesible desde a interface gráfica de usuario de Ubuntu Touch, polo que o único xeito de sincronizar carddav é usando syncevolution + cron. Non obstante, hai un xeito sinxelo de facelo cun script que pode executar no terminal ou a través da conexión SSH phablet. Estas instrucións tamén funcionan para caldav.
it: Per il momento non c'è un'implementazione di CardDAV direttamente accessibile dall'interfaccia utente di Ubuntu Touch, quindi l'unico modo per sincronizzare CardDAV è usando syncevolution + cron. Comunque c'è un modo semplice per farlo usando uno script che puoi avviare da terminale o via connessione phablet SSH. Queste istruzioni funzionano anche per CalDav.

source: Follow this `guide <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>`_ to activate Developer Mode and ADB (or SSH) connection.
fr: Suivez ce `guide <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>`_ pour activer le mode Développeur et la connexion ADB (ou SSH).
gl: Siga esta `guía <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>` _ para activar o modo de programador e a conexión ADB (ou SSH).
it: Segiu questa `guida <https://docs.ubports.com/it/latest/userguide/advanceduse/adb.html>`_ per attivare la Modalità Sviluppatore e la connessione ADB(o SSH).

source: Download this `script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (let's call it dav.sh) and edit the following variables:
fr: Téléchargez ce `script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (appelons le dav.sh) et modifiez les variables suivantes :
gl: Descargar este `script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (chamémolo dav.sh) e editar as seguintes variables:
it: Scarica questo `script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (chiamiamolo dav.sh) e modifica le seguenti variabili:

source: server side : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (of your ownCloud/nextCloud/baikal/SOGO/... server)
fr: server side : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (de votre serveur ownCloud/nextCloud/baikal/SOGO/... )
gl: lado do servidor: CAL_URL, ** CONTACTS_URL **, USERNAME, PASSWORD (do seu propio servidor Cloud / nextCloud / baikal / SOGO / ...)
it: lato server : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (del tuo server ownCloud/nextCloud/baikal/SOGO/...)

source: CONTACT and CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (it's more cosmetic)
fr: CONTACT et CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (c'est plus cohérent)
gl: CONTACT e CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (é máis cósmetico)
it: CONTACT e CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (sono piu estetici)

source: CRON_FREQUENCY (for the frequency of synchronization)
fr: CRON_FREQUENCY (pour la fréquence de synchronisation)
gl: CRON_FREQUENCY (pola frecuencia da sincronización)
it: CRON_FREQUENCY (per la frequenza di sicronizzazione)

source: Line 61: write ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , instead of ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, to avoid permission denied error
fr: Ligne 61 : écrire ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , à la place de ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, pour éviter l'erreur de permission refusée
gl: Liña 61: escriba `sudo sh -c" echo '$ COMMAND_LINE'> / sbin / sogosync "` `, no canto de` sudo echo "$ COMMAND_LINE"> / sbin / sogosync`, para evitar o erro denegado do permiso
it: Linea 61: scrivi ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , al posto di ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, per evitare un errore di permesso negato

source: Move the file to your Ubuntu Touch device, either by file manager or with adb::
fr: Déplacez le fichier sur votre appareil Ubuntu Touch, avec le gestionnaire de fichiers ou avec adb::
gl: Move o ficheiro ao teu dispositivo Ubuntu Touch, ben mediante xestor de ficheiros ou con adb ::
it: Sposta il file sul tuo dispositivo UbuntuTouch usando il file manager o con adb::

source: Connect with the phablet shell (``adb shell``) or directly on the phone Terminal app and type the following::
fr: Connectez vous avec la shell phablet (``adb shell``) ou directement avec l'application Terminal du téléphone et tapez ce qui suit :
gl: Conéctate co shell de phablet ("shell adb") ou directamente no aplicativo Terminal do teléfono e escribe o seguinte:
it: Connetti con la shell fablet (``adb shell``) o direttamente sull'applicazione del Terminale e scrivi questi comandi::

source: Sources:
gl: Fontes:
it: Risorse:

source: Advanced use
fr: Utilisation avancée
gl: Uso avanzado
it: Uso avanzato

source: This section of the documentation details advanced tasks that power users may want to perform on their Ubuntu Touch device.
fr: Cette rubrique de la documentation détaille les tâches avancées que les utilisateurs confirmés sont susceptibles d'effectuer sur leur appareil Ubuntu Touch.
gl: Esta sección da documentación detalla as tarefas avanzadas que os usuarios avanzados poden querer realizar no seu dispositivo Ubuntu Touch.
it: Questa sezione della documentazione descrive le attività avanzate che gli utenti possono eseguire sul proprio dispositivo Ubuntu Touch.

source: Some of these guides involve making your system image writable, which may break OTA updates. The guides may also reduce the overall security of your Ubuntu Touch device. Please consider these ramifications before hacking on your device too much!
fr: Certains de ces guides impliquent de rendre l'image de votre système modifiable, ce qui peut éventuellement casser les mises à jour OTA. Ils peuvent aussi mener à la réduction du niveau de sécurité de votre appareil Ubuntu Touch. Veuillez considérer ces éventualités avant de trop vous avancer dans la personnalisation de votre appareil !
gl: Algunhas destas guías implican que a imaxe do sistema poida escribirse, o que pode romper as actualizacións de OTA. As guías tamén poden reducir a seguridade xeral do dispositivo Ubuntu Touch. Ten en conta estas ramificacións antes de cortar demasiado no teu dispositivo!
it: Alcune di queste guide prevedono la possibilità di rendere scrivibile l'immagine del sistema, questo potrebbe compromettere gli aggiornamenti OTA. Le guide possono anche ridurre la sicurezza generale del tuo dispositivo Ubuntu Touch. Si consiglia di prendere in considerazione queste implicazioni prima di hackerare troppo il tuo dispositivo!

source: Reverse tethering
fr: Modem inversé
gl: Punto de acceso inverso á rede
it: Tethering inverso

source: Some users may not have an available wifi connection for their phone nor a data subscription from their mobile provider. This short tutorial will help you to connect your Ubuntu Touch to your computer to access internet.
fr: Certains utilisateurs peuvent ne pas disposer d'une connexion wifi sur leur téléphone ni d'un abonnement de données chez leur opérateur mobile. Ce petit tutoriel va vous aider à connecter votre appareil Ubuntu Touch à votre ordinateur pour bénéficier de l’accès à Internet.
gl: É posible que algúns usuarios non teñan unha conexión wifi dispoñible para o seu teléfono nin unha subscrición de datos do seu provedor de telefonía móbil. Este pequeno tutorial axudarache a conectar o teu Ubuntu Touch ao ordenador para acceder a internet.
it: Alcuni utenti potrebbero non disporre di una connessione wifi disponibile per il proprio telefono né di un abbonamento dati dal proprio gestore di telefonia mobile. Questo breve tutorial ti aiuterà a connettere il tuo Ubuntu Touch al computer per accedere a Internet.

source: Prerequisite: Phone is connected to the computer with usb and developer mode enabled.
fr: Prérequis : le téléphone est connecté à l'ordinateur via usb et le mode développeur est activé.
gl: Requisito previo: o teléfono está conectado ao ordenador co modo USB e desenvolvedor habilitado.
it: Prerequisito: il telefono è collegato al computer con la modalità usb e sviluppatore abilitate.

source: Steps
fr: Étapes
gl: Pasos
it: Passi

source: On phone: ``android-gadget-service enable rndis``
fr: Sur le téléphone : ``android-gadget-service enable rndis``
gl: No teléfono: ``android-gadget-service enable rndis``
it: Sul telefono: ``android-gadget-service enable rndis``

source: On computer: get your rndis ip address e.g:``hostname -I``
fr: Sur l'ordinateur : récupérez votre adresse ip rndis p. ex. :``hostname -I``
gl: No computador: obter a dirección rndis ip, por exemplo:``hostname -I``
it: Sul PC: get your rndis ip address e.g:``hostname -I``

source: On phone:
fr: Sur le téléphone :
gl: No teléfono:
it: Sul telefono:

source: add gateway: ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
fr: ajoutez la passerelle : ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
gl: engada a vía: ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
it: aggiungere un gateway: ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``

source: add nameservers: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
fr: ajoutez les serveurs de nom : ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
gl: engada os servidores de nomes: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
it: aggiungere nameservers: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``

source: refresh dns table: ``resolvconf -u``
fr: rafraîchissez la table dns : ``resolvconf -u``
gl: actualice o taboleiro do dns: ``resolvconf -u``
it: aggiornare la tabella dns: ``resolvconf -u``

source: On computer:
fr: Sur l'ordinateur :
gl: No computador:
it: Sul PC:

source: enable ip forwarding: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
fr: activez le transfert d'ip : ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
gl: habilitar o reenvío: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
it: abilitare l' ip forwarding: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``

source: apply NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
fr: appliquez le NAT : ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
gl: aplicar o NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
it: applica il NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``

source: References
fr: Références
gl: Referencias

source: Screen Casting your UT device to your computer
fr: Faire une diffusion en temps réel de l'écran de votre appareil UT sur votre ordinateur
gl: Exportación da pantalla do seu dispositivo UT ao computador
it: Effettua lo screen cast verso il PC del tuo dispositivo UT

source: Ubuntu Touch comes with a command line utility called ``mirscreencast`` which dumps screen frames to a file. The idea here is to stream UT display to a listening computer over the network or directly trough adb so that we can either watch it live or record it to a file.
fr: Ubuntu Touch possède un utilitaire en ligne de commande appelé ``mirscreencast`` qui récupère les trames vidéo dans un fichier. L'idée est d'afficher dynamiquement l'écran de l'appareil sous Ubuntu Touch sur un ordinateur client à travers le réseau ou directement via adb. On peut alors le regarder en temps réel ou l'enregistrer dans un fichier.
gl: Ubuntu Touch vén cunha utilidade de liña de comandos chamada "mirscreencast" que descarga os marcos de pantalla nun ficheiro. A idea aquí é transmitir a pantalla UT a un ordenador que escoita a través da rede ou directamente a través dun adb para que poidamos vela en directo ou gravala nun ficheiro.
it: Ubuntu Touch viene fornito con un'utilità a riga di comando chiamata ``mirscreencast`` che salva i frame dello schermo in un file. L'idea è quella di trasmettere lo schermo UT su un computer in ascolto sulla rete o indirizzarlo tramite adb in modo da poterlo guardare dal vivo o registrarlo su un file.

source: Using adb
fr: En utilisant adb
gl: Uso do adb
it: Usare adb

source: You can catch output directly from ``adb exec-out`` command and forward it to mplayer::
fr: Vous pouvez capturer directement la sortie de la commande ``adb exec-out`` et la rediriger vers mplayer::
gl: Pode capturar a saída directamente desde o comando "adb exec-out" e reenviala a mplayer ::
it: Puoi catturare l'output direttamente dal comando `` adb exec-out`` e inoltrarlo a mplayer ::

source: NB: ``timeout`` here is used in order to kill process properly on device ( here 120 seconds ). Otherwise process still continuing even if killed on computer. You can reduce or increase frame per second with``--cap-interval`` (1 = 60fps, 2=30fps, ...) and size of frames ``384 640`` means width=384 height=640
fr: NB : ``timeout`` est ici utilisé pour tuer le processus correctement sur l'appareil (ici 120 secondes). Dans le cas contraire, le processus restera actif même si il est tué sur l'ordinateur. Vous pouvez réduire ou augmenter le nombre de trames par secondes avec``--cap-interval`` (1 = 60fps, 2=30fps, ...) et la taille des trames ``384 640`` correspond à largeur=384 hauteur=640
gl: NB: o "tempo de espera" úsase para matar o proceso correctamente no dispositivo (aquí 120 segundos). En caso contrario, o proceso continúa aínda que se mata no ordenador. Podes reducir ou aumentar o fotograma por segundo con "- intervalo de límite" (1 = 60 fps, 2 = 30 fps, ...) e o tamaño dos fotogramas "384 640" significa ancho = 384 altura = 640
it: NB: qui `` timeout`` viene utilizzato per terminare correttamente il processo sul dispositivo (qui 120 secondi). In caso contrario, il processo continuerà a girare anche se sul computer viene ucciso. Puoi ridurre o aumentare il frame al secondo con `` - cap-interval`` (1 = 60fps, 2 = 30fps, ...) e la dimensione dei frame `` 384 640`` significa larghezza = 384 altezza = 640

source: Via network
fr: À travers le réseau
gl: Vía rede
it: Via rete locale

source: On receiver
fr: Sur le récepteur
gl: No receptor
it: Sul ricevitore

source: For real time casting:
fr: Pour l’affichage en temps réel :
gl: Para emisión en tempo real:
it: Per il casting in tempo reale:

source: Prepare your computer to listen to a tcp port(here 1234) and forward raw stream to a video player (here mplayer) with a frame size of 384x640::
fr: Préparer votre ordinateur à écouter sur un port tcp (ici 1234) et rediriger le flux vidéo brut vers un programme de lecture vidéo (ici mplayer) avec une taille de trame de 384x640::
gl: Prepare o seu ordenador para escoitar un porto tcp (aquí 1234) e reenviar un fluxo bruto a un reprodutor de vídeo (aquí mplayer) cun tamaño de fotograma de 384x640:
it: Prepara il computer a restare in ascolto su una porta TCP (qui 1234) e inoltrare il flusso non elaborato a un riproduttore video (qui mplayer) con una dimensione del fotogramma di 384x640 ::

source: For stream recording:
fr: Pour l'enregistrement du flux :
gl: Para a gravación da transmisión:
it: Per la registrazione in streaming:

source: Prepare your computer to listen to a tcp port(here 1234), ungzip and forward raw stream to a video encoder (here mencoder)::
fr: Préparer votre ordinateur à écouter sur un port tcp (ici 1234) et rediriger le flux vidéo brut vers un programme d'encodage vidéo (ici mpencoder)::
gl: Prepare o ordenador para escoitar un porto tcp (aquí 1234), descomprimir e reenviar o fluxo bruto a un codificador de vídeo (aquí mencoder) ::
it: Prepara il tuo computer a restare in ascolto su una porta TCP (qui 1234), eseguire l'ungzip e inoltrare il flusso raw a un codificatore video (qui mencoder) ::

source: On device
fr: Sur l'appareil
gl: No dispositivo
it: Sul dispositivo

source: Forward and gzip stream with 60fps (--cap-interval 1) and frame size of 384x640 to computer 10.42.0.209 on port 1234 ::
fr: Rediriger et compresser (gzip) le flux à 60 fps (--cap-interval 1) et une avec une taille de trame de 384x640 vers l'ordinateur 10.42.0.209 sur le port 1234::
gl: Reenvío e transmisión gzip con 60 fps (--cap-interval 1) e tamaño de trama de 384x640 ao ordenador 10.42.0.209 no porto 1234 ::
it: Inoltra ed esegui lo gzip streaming con 60fps (--cap-interval 1) e dimensione del frame di 384x640 al computer 10.42.0.209 sulla porta 1234 ::

source: Example script
fr: Exemple de script
gl: Script do exemplo
it: Script di esempio

source: This script allows you to screen cast remote UT device to your local PC (must have ssh access to UT and mplayer installed on PC), run it on your computer::
fr: Ce script vous permet de diffuser l'affichage de l'écran d'un appareil UT distant sur votre PC local (vous devez avoir un accès ssh sur votre appareil UT et mplayer installé sur le PC), lancez le sur votre PC::
gl: Este script permítelle proxectar un dispositivo UT remoto no seu PC local (debe ter acceso ssh a UT e mplayer instalados no PC), executalo no seu computador:
it: Questo script ti consente di proiettare il dispositivo UT remoto sul PC locale (deve avere accesso con ssh a UT e mplayer, installato su PC), eseguirlo sul tuo computer ::

source: You can download it here: :download:`files/mircast.sh`
fr: Vous pouvez le télécharger ici : :télécharger:`files/mircast.sh`
gl: Pode descargalo aquí: :download:`files/mircast.sh`
it: Puoi scaricarlo qui:: download: `files / mircast.sh`

source: initial source: https://wiki.ubuntu.com/Touch/ScreenRecording
fr: source initiale : https://wiki.ubuntu.com/Touch/ScreenRecording
gl: fonte inicial: https://wiki.ubuntu.com/Touch/ScreenRecording
it: sorgente iniziale: https://wiki.ubuntu.com/Touch/ScreenRecording

source: demo: https://www.youtube.com/watch?v=HYm4RUwwo5Q
fr: démonstration : https://www.youtube.com/watch?v=HYm4RUwwo5Q
gl: demostración: https://www.youtube.com/watch?v=HYm4RUwwo5Q

source: Shell access via ssh
fr: Accès au shell par ssh
gl: Acceso á consola a través de ssh
it: Accesso dalla shell via ssh

source: You can use ssh to access a shell from your PC. This is useful for debugging or more advanced shell usage.
fr: Vous pouvez utiliser ssh pour accéder au shell depuis votre PC. Ceci est utile pour déboguer ou pour un usage plus avancé du shell.
gl: Podes usar ssh para acceder a un shell desde o teu PC. Isto é útil para depurar ou usar un shell máis avanzado.
it: Puoi usare ssh per accedere a una shell dal tuo PC. Questo è utile per il debug o l'utilizzo più avanzato della shell.

source: You need a ssh key pair for this. Logging in via password is disabled by default.
fr: Vous avez besoin d'une paire de clés ssh pour cela. L'ouverture d'une session par mot de passe est désactivée par défaut.
gl: Necesitas un par de claves ssh para iso. O inicio de sesión mediante contrasinal está desactivado de xeito predeterminado.
it: Per questo hai bisogno di una coppia di chiavi ssh. L'accesso tramite password è disabilitato per impostazione predefinita.

source: Create your public key
fr: Créer votre clé publique
gl: Crear a súa clave pública
it: Crea la tua chiave pubblica

source: If not already created, create your public key, default choices should be fine for LAN, you can leave empty password if you don't want to deal with it each time::
fr: Si cela n'est pas déjà fait, créez votre clé publique, les options par défaut devraient suffire pour une utilisation sur le LAN, vous pouvez laisser le mot de passe vide si vous n'avez pas envie de gérer cela à chaque fois::
gl: Se aínda non está creado, cree a súa clave pública; as opcións predeterminadas deberían estar ben para LAN, pode deixar o contrasinal baleiro se non quere tratar con el cada vez:
it: Se non è già stato creato, crea la tua chiave pubblica, le scelte di default dovrebbero andare bene per la LAN, se non vuoi occupartene ogni volta puoi lasciare la password vuota ::

source: Copy the public key to your device
fr: Copier la clé publique sur votre appareil
gl: Copiar a clave pública ao seu dispositivo
it: Copia la chiave pubblica sul tuo dispositivo

source: You need then to transfer your public key to your device. There are multiple ways to do this. These are a few options:
gl: Necesitas entón transferir a túa clave pública ao teu dispositivo. Hai varias formas de facelo. Estas son algunhas opcións:
