Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Find the path to the shared object files. For libraries built via clickable, they are located somewhere in the library's install dir, which is located inside the library's build dir by default (e.g. ``build/arm-linux-gnueabihf/opencv/install``). For pre-built libraries run ``clickable run "find / -name 'libSomething.so'"`` (replacing ``libSomething.so`` by the file your are looking for). This should print the path to the file (along with some error messages you can ignore). In general, ``/usr/lib`` is a good bet when looking for the shared object files.
fr: Trouvez le chemin vers les fichiers des objets partagés. Pour les bibliothèques compilées via clickable, ils sont situés quelque part dans le répertoire d'installation de la bibliothèque, qui se trouve dans le répertoire des sources de la bibliothèque par défaut (par exemple, ``build/arm-linux-gnueabihf/opencv/install``). Pour les bibliothèques précompilées, lancez ``clickable run "find / -name 'libSomething.so'"`` (en remplaçant ``libSomething.so`` par le fichier que vous recherchez). Cela devrait afficher le chemin d'accès au fichier (ainsi que quelques messages d'erreur que vous pouvez ignorer). En général, ``/usr/lib`` est un bon endroit pour chercher les fichiers d'objets partagés.
gl: Busque o camiño cara aos ficheiros de obxectos compartidos. Para as bibliotecas construídas mediante pinchables, localízanse nalgún lugar do directorio de instalación da biblioteca, que se atopa dentro do directorio de compilación da biblioteca por defecto (por exemplo, "build / arm-linux-gnueabihf / opencv / install"). Para bibliotecas pre-construídas, execute "execución clicable" find / -name 'libSomething.so' "" (substituíndo `` libSomething.so` polo ficheiro que está a procurar). Isto debería imprimir a ruta ao ficheiro (xunto con algunhas mensaxes de erro que podes ignorar). En xeral, "/ usr / lib" é unha boa aposta ao buscar ficheiros de obxectos compartidos.
it: Trova il percorso dei file degli oggetti condivisi. Per le librerie costruite tramite clickable, si trovano da qualche parte nella directory di installazione della libreria, che si trova per impostazione predefinita all'interno della directory di compilazione della libreria (ad esempio ``build/arm-linux-gnueabihf/opencv/install``). Per le librerie precostituite, eseguire ``clickable run "find / -name 'libSomething.so'"`` (sostituendo ``libSomething.so`` con il file che si sta cercando). Questo dovrebbe stampare il percorso del file (insieme ad alcuni messaggi di errore che si possono ignorare). In generale, ``/usr/lib`` è una buona scelta quando si cercano i file degli oggetti condivisi.

source: To get the files into the click package, add the `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>`_ key to your clickable.json:
fr: Pour inclure ces fichiers dans le package click, ajoutez la clé `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>`_ à votre clickable.json :
gl: Para obter os ficheiros no paquete de clic, engada a tecla `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>` _ ao seu clicable.json:
it: Per inserire i file nel pacchetto click, aggiungere la chiave `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>`_ al file clickable.json:

source: The lines above contain two examples. The first one installing a library built with Clickable. The asterisk in ``.so*`` helps to catch symbolic links along with the actual library which are used to point to the current version.
fr: Les lignes ci-dessus contiennent deux exemples. Le premier est l'installation d'une bibliothèque compilée avec Clickable. L'astérisque dans ``.so*`` permet de pouvoir utiliser les liens symboliques qui pointent vers la version courante.
gl: As liñas anteriores conteñen dous exemplos. A primeira que instala unha biblioteca construída con Clickable. O asterisco en ".so *" axuda a capturar ligazóns simbólicas xunto coa biblioteca real que se usan para apuntar á versión actual.
it: Le righe precedenti contengono due esempi. Il primo installa una libreria costruita con Clickable. L'asterisco in ``.so*`` aiuta a catturare i collegamenti simbolici insieme alla libreria vera e propria, usati per puntare alla versione corrente.

source: Depending on the library, you might need to ship some additional data. In that case consult the library's readme or install instructions.
fr: Selon la bibliothèque concernée, vous devrez peut être intégrer des données supplémentaires. Dans ce cas, il faut consulter le fichier lisez-moi ou les instructions d'installation.
gl: Dependendo da biblioteca, é posible que deba enviar algúns datos adicionais. Nese caso consulte o readme da biblioteca ou as instrucións de instalación.
it: A seconda della libreria, potrebbe essere necessario inviare alcuni dati aggiuntivi. In questo caso, consultare il readme della libreria o le istruzioni di installazione.

source: You should be set up to build and install your click package on a device connected to your computer now by running ``clickable``.
fr: Vous devriez maintenant être en mesure de compiler et d'installer votre paquet Click sur un appareil connecté à votre ordinateur en lançant ``clickable``.
gl: Debería estar configurado para construír e instalar o paquete de clic nun dispositivo conectado ao seu ordenador agora executando "clicable".
it: Si dovrebbe essere pronti a costruire e installare il pacchetto click su un dispositivo collegato al computer eseguendo ``clickable``.

source: Importing from Content Hub and URLdispatcher
fr: Import à partir du centre de contenus et de l'expéditeur de liens
gl: Importando desde Content Hub e URLdispatcher
it: Importare da Content Hub e URLdispatcher

source: In the previous guide we have seen a little bit about how Content Hub works. In this guide we will see how ``URLdispatcher`` works and how to handle imported data from the Content Hub.
fr: Dans le guide précédent, nous avons eu un aperçu du fonctionnement du centre de contenus. Dans ce guide, nous allons voir comment l'expéditeur de liens (``URLdispatcher``) fonctionne et comment gérer les données importées à partir du centre de contenus.
gl: Na guía anterior vimos un pouco sobre como funciona Content Hub. Nesta guía veremos como funciona "URLdispatcher" e como xestionar os datos importados desde o Hub de contido.
it: Nella guida precedente abbiamo visto un po come funziona Content Hub. In questa guida vedremo come funziona ``URLdispatcher`` e come maneggiare dati importati da Content Hub.

source: Handle data from the Content Hub
fr: Gérer les données provenant du centre de contenus
gl: Manexar datos do Content Hub
it: Gestire i dati dall'Hub dei contenuti

source: OpenStore app from open-store.io
fr: Application OpenStore de open-store.io
gl: Aplicativo OpenStore desde open-store.io
it: Applicazione OpenStore da open-store.io

source: One of the easiest ways of testing an app, is to send a test click to yourself on Telegram, and opening that click file with the OpenStore through the Content Hub:
fr: Une des manières les plus simples de tester une application est de vous envoyer un paquet Click de test sur Telegram et d'ouvrir ce fichier avec l'OpenStore à partir du centre de contenus :
gl: Unha das formas máis sinxelas de probar un aplicativo é enviarche un clic de proba a ti mesmo en Telegram e abrir ese ficheiro de clic co OpenStore a través do Content Hub:
it: Uno dei modi più semplici per testare un'applicazione è inviare un clic di prova a se stessi su Telegram e aprire il file del clic con OpenStore attraverso Content Hub:

source: If we tap on the OpenStore app, it will be opened and it will ask if we want to install the click file. Let’s take a look into `the Main.qml code of the app <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>`_ to see how it is done:
fr: Si vous appuyez sur l’application OpenStore, celle-ci s'ouvrira et vous demandera si vous voulez installer le paquet Click. Jetons un œil au `code principal de l'application dans le fichier Main.qml <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>`_ pour voir de quoi il est constitué :
gl: Se tocamos o aplicativo OpenStore, abrirase e preguntará se queremos instalar o ficheiro de clic. Vexamos "o código Main.qml da aplicación <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>" _ para ver como se fai:
it: Se si tocca l'applicazione OpenStore, questa verrà aperta e chiederà se si vuole installare il file click. Diamo un'occhiata al codice Main.qml dell'applicazione <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>`_ per vedere come avviene:

source: Do you see that Connections element that targets the ContentHub? When it receives the signal onImportRequested, it will take the url of the data sent from the Content Hub (``transfer.items[0].url`` is the url of the first data sent) and open a ``PopUp`` element to let the user install the click.
fr: Vous voyez cet élément « Connections » qui vise le centre de contenus ? Lorsqu'il reçoit le signal « onImportRequested », il prend le lien de la donnée envoyée par le centre de contenus (``transfer.items[0].url`` est le lien de la première donnée envoyée) et ouvre une boîte de dialogue (``PopUp``) pour permettre à l'utilisateur/trice d'installer le paquet Click.
gl: Ves ese elemento Conexións dirixido a ContentHub? Cando reciba o sinal enImportRequested, tomará a url dos datos enviados desde o Hub de contido ("transfer.items [0] .url" é a url dos primeiros datos enviados) e abrirá un "PopUp" elemento para que o usuario instale o clic.
it: Si vede l'elemento Connections che punta al ContentHub? Quando riceve il segnale onImportRequested, prenderà l'url dei dati inviati dal Content Hub (``transfer.items[0].url`` è l'url dei primi dati inviati) e aprirà un elemento ``PopUp`` per consentire all'utente di installare il clic.

source: What about the URLdispatcher?
fr: Qu'est-ce donc que 'URLdispatcher' ?
gl: Que pasa co URLdispatcher?
it: Che dire dell'URLdispatcher?

source: The URL dispatcher is a piece of software, similar to the Content Hub, that makes our life easier trying to choose the correct app for a certain protocol. For example: We probably want to open the web browser when tapping on an http protocol. If we tap on a map link it is handy to open it with uNav or to open a twitter link in the Twitter app! How does that work?
fr: 'URL dispatcher' est un composant logiciel, similaire au 'Content Hub', qui vous facilite la vie en choisissant pour un protocole, l'application qui lui est le mieux adaptée. Par exemple : il est préférable d'ouvrir le navigateur Internet quand on sélectionne une adresse utilisant le protocole http. Si on sélectionne un lien cartographique, il est pratique de l'ouvrir avec l'application uNav ou un lien Twitter dans l'application Twitter ! Comment cela fonctionne-t-il ?
gl: O despachador de URL é un software similar ao Content Hub que nos facilita a vida intentando escoller o aplicativo correcto para un protocolo determinado. Por exemplo: é probable que queiramos abrir o navegador web ao tocar un protocolo http. Se prememos nunha ligazón de mapa, é útil abrilo con uNav ou abrir unha ligazón de twitter no aplicativo de Twitter. Como funciona iso?
it: L'URL dispatcher è un software, simile al Content Hub, che ci semplifica la vita cercando di scegliere l'applicazione corretta per un determinato protocollo. Ad esempio: Probabilmente vogliamo aprire il browser web quando tocchiamo un protocollo http. Se tocchiamo un link a una mappa è comodo aprirlo con uNav o aprire un link a Twitter nell'app Twitter! Come funziona?

source: The ``URLdispatcher`` selects which app (according to their ``manifest.json``) will open a certain link.
fr: ``URLdispatcher`` sélectionne quelle application (en fonction du fichier ``manifest.json``) ouvrira un lien donné.
gl: O "URLdispatcher" selecciona que aplicación (segundo o seu "manifest.json") abrirá unha ligazón determinada.
it: L'``URLdispatcher`` seleziona quale applicazione (in base al suo ``manifest.json``) aprirà un determinato collegamento.

source: Let’s see how our navigation app looks inside. uNav’s manifest shows special hooks for the ``URLdispatcher`` in its `manifest.json code <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:
fr: Voyons à quoi notre application de navigation ressemble de l'intérieur. Le manifeste de uNav présente des accroches pour ``URLdispatcher`` dans le code de `manifest.json <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:
gl: Vexamos como se ve o noso aplicativo de navegación. O manifesto de uNav mostra ganchos especiais para o "URLdispatcher" no seu código "manifest.json <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9> `_:
it: Vediamo come appare la nostra applicazione di navigazione all'interno. Il manifest di uNav mostra ganci speciali per l'``URLdispatcher'' nel suo codice `manifest.json <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:

source: This means that a link that looks like http://map.unav.me/xxxxx,xxxxx will be opened in uNav. And that’s defined in lines 2 and 3, where it looks for protocol http followed by map.unav.me.
fr: Cela signifie qu'un lien qui ressemble à http://map.unav.me/xxxxx,xxxxx sera ouvert dans uNav. Et cela est défini dans les lignes 2 et 3, où le protocole http suivi de map.unav.me est recherché.
gl: Isto significa que se abrirá en uNav unha ligazón que se pareza a http://map.unav.me/xxxxx,xxxxx. E iso defínese nas liñas 2 e 3, onde busca o protocolo http seguido de map.unav.me.
it: Ciò significa che un link che assomiglia a http://map.unav.me/xxxxx,xxxxx verrà aperto in uNav. Questo è definito nelle righe 2 e 3, dove si cerca il protocollo http seguito da map.unav.me.

source: Also, a URI formatted geo:xxx,xxx should open in uNav, as it’s defined in line 11.
fr: De plus, un lien formatté geo:xxx,xxx devrait s'ouvrir dans uNav, comme cela est défini en ligne 11.
gl: Ademais, un URI con formato geo: xxx, xxx debería abrirse en uNav, tal e como se define na liña 11.
it: Inoltre, un URI formattato geo:xxx,xxx dovrebbe aprirsi in uNav, come è stato definito nella riga 11.

source: And how do we manage the received URL?
fr: Et comment gérons-nous le lien reçu ?
gl: E como administramos o URL recibido?
it: E come gestiamo l'URL ricevuto?

source: After the ``URLdispatcher`` sends the link to the correspondent app, we need to handle that URL or URI in the targeted app. Let’s see how to do that:
fr: Après que ``URLdispatcher`` a envoyé le lien à l'application correspondante, nous devons gérer ce lien dans l'application ciblée. Voyons comment faire cela :
gl: Despois de que "URLdispatcher" envíe a ligazón ao aplicativo correspondente, necesitamos tratar ese URL ou URI no aplicativo de destino. Vexamos como facelo:
it: Dopo che l'``URLdispatcher'' invia il link all'applicazione corrispondente, dobbiamo gestire l'URL o l'URI nell'applicazione mirata. Vediamo come fare:

source: In the main qml file, we need to add some code to know what to do with the dispatched URL. Let's check how Linphone app manages this adding a `connection to the URI Handler <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>`_ with a Connections element setting ``UriHandler`` as a target.
fr: Dans le fichier QML principal, nous devons ajouter du code pour savoir quoi faire avec le lien expédié. Commencez par ajouter un `élément d'argument <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L189>`_ qui gère le lien , tel que cela est fait par exemple dans `l'application Linphone <https://open-store.io/app/linphone.cibersheep>`_. Nous ajoutons également une `connexion au gestionnaire de liens <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>`_ avec un élément de connexion ayant comme cible ``UriHandler``.
gl: No ficheiro qml principal, necesitamos engadir algún código para saber que facer co URL enviado. Comprobemos como o aplicativo Linphone xestiona isto engadindo unha `conexión ao URI Handler <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>` _ cun elemento Connections configurando "UriHandler" como obxectivo.
it: Nel file qml principale, dobbiamo aggiungere del codice per sapere cosa fare con l'URL inviato. Verifichiamo come l'applicazione Linphone gestisce questo aspetto, aggiungendo una `connessione al gestore di URI <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>`_ con un elemento Connections che imposta ``UriHandler`` come target.

source: This code will manage an URI in the form ``linphone://sip:xxx@xxx.xx`` when the app is opened. But what do we need to do to handle this link when the app is closed?
fr: Ce code gérera un lien de la forme ``linphone://sip:xxx@xxx.xx``lorsque l'application sera ouverte. Mais que devons-nous faire pour gérer ce lien lorsque l'application est fermée ?
gl: Este código xestionará un URI en forma "linphone: // sip: xxx @ xxx.xx" cando se abra o aplicativo. Pero que debemos facer para xestionar esta ligazón cando o aplicativo está pechado?
it: Questo codice gestirà un URI nella forma ``linphone://sip:xxx@xxx.xx`` quando l'applicazione viene aperta. Ma cosa dobbiamo fare per gestire questo link quando l'applicazione viene chiusa?

source: We need to add a little bit `extra code <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L76>`_ that will cover two cases: 1) We receive one URL 2) We receive more than one URL
fr: Nous devons ajouter un petit `code supplémentaire <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L69>`_ qui couvrira deux cas de figure : 1) Nous recevons un lien 2) Nous recevons plus d'un lien
gl: Necesitamos engadir un pouco de `código extra <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L76>` _ que cubrirá dous casos: 1) Nós recibir un URL 2) Recibimos máis dun URL
it: Dobbiamo aggiungere un po' di codice `extra <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L76>`_ che coprirà due casi: 1) Riceviamo un URL 2) Riceviamo più di un URL

source: Let's check if ``Qt.application.arguments`` is not empty and if not, if any argument matches our URI format.
fr: Vérifions si ``Qt.application.arguments`` n'est pas vide et dans ce cas, si un argument correspond à notre format URI.
gl: Comprobe se "Qt.application.arguments" non está baleiro e se non, se algún argumento coincide co noso formato URI.
it: Controlliamo se ``Qt.application.arguments`` non è vuoto e, in caso contrario, se qualche argomento corrisponde al nostro formato URI.

source: Remember to check that %u (to receive 1 URL) or %U (to receive 1 or more URLs) is present under the ``Exec`` line in the `.desktop <https://gitlab.com/ubports-linphone/linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ file of the app.
fr: N'oublions pas de vérifier que %u (pour recevoir 1 URL) ou %U (pour recevoir 1 ou plusieurs URL) est présent sous la ligne ``Exec`` dans le fichier `.desktop <https://gitlab.com/ubports-linphone/linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ de l'application.
gl: Lembre comprobar que %u (para recibir 1 URL) ou% U (para recibir 1 ou máis URL) está presente baixo a liña "Exec" no `.desktop <https://gitlab.com/ubports-linphone /linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ ficheiro da aplicación.
it: Ricordarsi di controllare che %u (per ricevere 1 URL) o %U (per ricevere 1 o più URL) sia presente sotto la riga ``Exec`` nel file `.desktop <https://gitlab.com/ubports-linphone/linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ dell'applicazione.

source: What happens if more than one app has the same URL type defined?
fr: Que se passe-t-il si le même type de lien est défini dans plus d'une application ?
gl: Que ocorre se hai máis dun aplicativo que ten o mesmo tipo de URL definido?
it: Cosa succede se più di un'applicazione ha lo stesso tipo di URL definito?

source: A very good question. What happens if we tap on a Twitter link? How is such a URL handled by the ``URLdispatcher`` as protocol ``http`` or the protocol ``http://twitter``?
fr: C'est une très bonne question. Que se passe-t-il si nous appuyons sur un lien Twitter ? Un tel lien est-il géré par ``URLdispatcher`` comme un protocole ``http`` ou le protocole ``http://twitter`` ?
gl: Unha moi boa pregunta. Que pasa se tocamos unha ligazón de Twitter? Como se trata dun URL como "URLdispatcher" como o protocolo "http" ou o protocolo "http: // twitter"?
it: Un'ottima domanda. Cosa succede se si tocca un link di Twitter? Come viene gestito un URL di questo tipo dall'``URLdispatcher`` come protocollo ``http`` o come protocollo ``http://twitter``?

source: What happens if two apps have the same defined protocol?
fr: Que se passe-t-il si le même protocole est défini pour deux applications ?
gl: Que pasa se dous aplicativoss teñen o mesmo protocolo definido?
it: Cosa succede se due applicazioni hanno lo stesso protocollo definito?

source: Now it’s time to do some tests and share the results in the next guide.
fr: Il est temps maintenant d'effectuer quelques tests et de partager les résultats dans le guide suivant.
gl: Agora toca facer algunhas probas e compartir os resultados na seguinte guía.
it: Ora è il momento di effettuare alcuni test e di condividere i risultati nella prossima guida.

source: Developer guides
fr: Guides du développeur
gl: Guías para desenvolvedores
it: Guide per sviluppatori

source: We are currently working on expanding our list of developer guides. In the mean time we recommend the `Ubuntu Touch Programming Course <https://mimecar.gitbook.io/qt-course/>`__.
fr: Nous travaillons actuellement à l'extension de la liste de nos guides du développeur. En attendant, nous recommandons le `cours de programmation d'Ubuntu Touch <https://mimecar.gitbook.io/qt-course/>`__.
gl: Actualmente estamos a traballar na ampliación da nosa lista de guías para desenvolvedores. Mentres tanto recomendamos o `Curso de programación Ubuntu Touch <https://mimecar.gitbook.io/qt-course/>` __.
it: Attualmente stiamo lavorando per ampliare il nostro elenco di guide per sviluppatori. Nel frattempo consigliamo il `Corso di programmazione di Ubuntu Touch <https://mimecar.gitbook.io/qt-course/>`__.

source: If you are interested in helping create developer guides check out our `GitLab Project <https://gitlab.com/ubports/apps/development-resources>`__.
fr: Si vous êtes intéressé(e) pour aider à la création de guides du développeur, consultez notre `projet GitLab <https://gitlab.com/ubports/ux/development-resources>`__.
gl: Se estás interesado en axudar a crear guías para desenvolvedores, consulta o noso `Proxecto GitLab <https://gitlab.com/ubports/apps/development-resources>` __.
it: Se siete interessati a contribuire alla creazione di guide per sviluppatori, visitate il nostro progetto `GitLab <https://gitlab.com/ubports/apps/development-resources>`__.

source: Push notifications
fr: Notifications poussées
gl: Notificacións push
it: Notifiche push
