Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: This section is a *Work in progress*
fr: Cette section est un *travail en cours*
gl: Esta sección é un * Traballo en curso *

source: Configuring Ubuntu Touch
fr: Configuration d'Ubuntu Touch
gl: Configurando Ubuntu Touch

source: In the previous section you adjusted a configuration file directly in the UBports rootfs. The rootfs contains a number of other configuration files with some standard settings that do not necessarily conform to your device. These must be modified to fit your device. The rootfs itself is read only and identical for all devices. You cannot modify the rootfs itself. Instead, the correct way to adjust the configuration is with overlay files, as described below.
fr: Dans la section précédente, vous avez ajusté un fichier de configuration directement dans le fichier rootfs d'UBports. Le fichier rootfs contient un certain nombre d'autres fichiers de configuration avec des paramètres standards qui ne sont pas nécessairement compatibles avec votre appareil. Ceux-ci doivent être modifiés pour s'adapter à votre appareil. Le fichier rootfs lui-même est en lecture seule et identique pour tous les appareils. Vous ne pouvez pas modifier le fichier rootfs lui-même. À la place, la bonne façon d'ajuster la configuration consiste à utiliser des fichiers de recouvrement, comme décrit ci-dessous.
gl: Na sección anterior axustou un ficheiro de configuración directamente nos rootfs de UBports. O rootfs contén outros ficheiros de configuración con algunhas configuracións estándar que non necesariamente se axustan ao seu dispositivo. Estes deben modificarse para que se axusten ao teu dispositivo. O rootfs en si só é de lectura e é idéntico para todos os dispositivos. Non pode modificar o rootfs en si. Pola contra, o xeito correcto de axustar a configuración é con ficheiros de superposición, como se describe a continuación.

source: Overlay files
fr: Fichiers de superposition
gl: Ficheiros de superposición

source: Note that as a rule of thumb, the method described below applies if the file you need to edit can be found in the /etc directory (or a subdirectory of this) on your device. You should not attempt to overwrite files located elsewhere using this method. Note also that it is not possible to transfer executable files using this method, and that you cannot insert new files either. The only thing this method does is to overwrite a file that is already present in the build. Thus, by following the steps described here you can replace existing configuration files with ones that are tailored specifically to your device.
gl: Teña en conta que, como regra xeral, o método descrito a continuación aplícase se o ficheiro que precisa editar se atopa no directorio / etc (ou nun subdirectorio deste) no seu dispositivo. Non debe intentar sobrescribir ficheiros situados noutros lugares usando este método. Teña en conta tamén que non é posible transferir ficheiros executables usando este método e que tampouco pode inserir ficheiros novos. O único que fai este método é sobreescribir un ficheiro que xa está presente na compilación. Así, seguindo os pasos aquí descritos, pode substituír os ficheiros de configuración existentes por outros que están adaptados especificamente ao seu dispositivo.

source: It is also worth noting that, as of writing, there are a number of legacy files in the mentioned directories that serve no purpose but exist there simply pending removal. Therefore, make sure you are overwriting files that are actually used by the system as your changes otherwise will have no effect.
gl: Tamén cómpre ter en conta que, ao escribir, hai unha serie de ficheiros herdados nos directorios mencionados que non serven para nada, pero existen simplemente pendentes de eliminación. Polo tanto, asegúrese de sobrescribir ficheiros que realmente utilice o sistema, xa que os seus cambios non terán efecto.

source: In your device directory, create a subdirectory named 'ubuntu'. Collect the files you wish to inject into your build in this directory.
fr: Dans le répertoire de votre appareil, créez un sous-répertoire nommé « ubuntu ». Rassemblez dans ce répertoire les fichiers que vous souhaitez injecter dans votre version.
gl: No directorio do dispositivo, cree un subdirectorio chamado 'ubuntu'. Recolla os ficheiros que desexa inxectar na súa compilación neste directorio.

source: Relevant files are for example (but this list is incomplete):
fr: Les dossiers pertinents sont par exemple (mais cette liste est incomplète) :
gl: Por exemplo, hai ficheiros relevantes (pero esta lista está incompleta):

source: 70-android.rules (the udev rules for your device, see previous section)
fr: 70-android.rules (les règles udev pour votre appareil, voir la section précédente)
gl: 70-android.rules (as regras udev para o teu dispositivo, consulta a sección anterior)

source: android.conf (for display scaling, see below)
fr: android.conf (pour la mise à l'échelle de l'affichage, voir ci-dessous)
gl: android.conf (para a escala de visualización, ver máis abaixo)

source: touch.pa (for pulseaudio sound configuration/initialization, see below)
fr: touch.pa (pour la configuration/initialisation du son via Pulseaudio, voir ci-dessous)
gl: touch.pa (para a configuración / inicialización do son pulseaudio, vexa a continuación)

source: These files are then injected by adding a code block to the file ``device.mk`` in your device directory. For the three files above add the following code::
fr: Ces fichiers sont ensuite injectés en ajoutant un bloc de code au fichier ``device.mk`` dans le répertoire de votre appareil. Pour les trois fichiers ci-dessus, ajoutez le code suivant ::
gl: Estes ficheiros inxéctanse engadindo un bloque de código ao ficheiro "device.mk" no directorio do dispositivo. Para os tres ficheiros anteriores engade o seguinte código:

source: Explanation:
fr: Explication :
gl: Explicación:

source: The string before the colon '$(LOCAL_PATH)/ubuntu/70-android.rules' specifies the path to the source file to be injected. The string after the colon 'system/halium/lib/udev/rules.d/70-android.rules' specifies where you want it placed on the device.
fr: La chaîne précédant les deux points '$(LOCAL_PATH)/ubuntu/70-android.rules' indique le chemin d'accès au fichier source à injecter. La chaîne qui suit les deux points 'system/halium/lib/udev/rules.d/70-android.rules' indique l'endroit où vous souhaitez le placer sur l'appareil.
gl: A cadea antes dos dous puntos '$ (LOCAL_PATH) /ubuntu/70-android.rules' especifica a ruta ao ficheiro fonte que se vai inxectar. A cadea despois dos dous puntos 'system / halium / lib / udev / rules.d / 70-android.rules' especifica onde quere que se coloque no dispositivo.

source: The general steps to follow are thus:
fr: Les étapes générales à suivre sont donc les suivantes :
gl: Os pasos xerais a seguir son estes:

source: Copy the file you wish to modify to the 'ubuntu' directory you have created in your device source tree.
fr: Copiez le fichier que vous souhaitez modifier dans le répertoire 'ubuntu' que vous avez créé dans l'arborescence des sources de votre appareil.
gl: Copie o ficheiro que desexa modificar no directorio 'ubuntu' que creou na árbore de orixe do dispositivo.

source: Edit the file as needed.
fr: Modifiez le fichier selon vos besoins.
gl: Editar o ficheiro como o necesite.

source: Add a line to the PRODUCT_COPY_FILES section of your device.mk file as shown above.
fr: Ajoutez une ligne à la section PRODUCT_COPY_FILES de votre fichier device.mk comme indiqué ci-dessus.
gl: Engade unha liña á sección PRODUCT_COPY_FILES do ficheiro device.mk como se mostra arriba.

source: Rebuild your system.img and reflash together with the ubports rootfs.
fr: Reconstruisez votre fichier system.img et installez-le avec le fichier rootfs d'UBports.
gl: Reconstrúe o seu system.img e grava xunto cos rootfs de ubports.

source: The target paths for the files mentioned above are *not* randomly chosen. You must use the specified paths.
fr: Les chemins cibles des fichiers mentionnés ci-dessus ne sont *pas* choisis au hasard. Vous devez utiliser les chemins spécifiés.
gl: As rutas de destino para os ficheiros mencionados anteriormente *non* son escollidos aleatoriamente. Debe usar as rutas especificadas.

source: When you specify target path 'system/halium/etc/myfilename' your file 'myfilename' will end up in the '/etc' directory of your device (i.e. without the leading 'system/halium')
fr: Lorsque vous indiquez le chemin d'accès cible 'system/halium/etc/myfilename', votre fichier 'myfilename' se retrouvera dans le répertoire '/etc' de votre appareil (c'est-à-dire sans le préfixe 'system/halium')
gl: Cando especifica a ruta de destino 'system / halium / etc / myfilename' o seu ficheiro 'myfilename' rematará no directorio '/ etc' do dispositivo (é dicir, sen o 'system / halium' principal)

source: Rebuild system.img
fr: Reconstruction de system.img
gl: Reconstruír system.img

source: When you have made the adjustments you need and prepared your source as described above, you have to rebuild your system.img: ``mka systemimage``. When rebuilding the system image after small changes like these, you need not ``mka clean`` first. However, changes to PRODUCT_PROPERTY_OVERRIDES might not get detected by the build system. Go to your output folder, enter the system folder and delete ``build.prop`` in order to get it regenerated.
fr: Lorsque vous aurez fait les ajustements nécessaires et préparé votre source comme décrit ci-dessus, vous devrez reconstruire votre fochier system.img : ``mka systemimage``. Lorsque vous reconstruisez l'image système après de petits changements comme ceux-ci, vous n'avez pas besoin de faire ``mka clean`` en premier. Cependant, les changements dans PRODUCT_PROPERTY_OVERRIDES peuvent ne pas être détectés par le système de compilation. Allez dans votre dossier de sortie, entrez dans le dossier système et supprimez ``build.prop`` afin de le régénérer.
gl: Cando fixeches a configuración que necesitas e preparaches a túa fonte como se describiu anteriormente, tes que reconstruír o teu system.img: "mka systemimage". Ao reconstruír a imaxe do sistema despois de pequenos cambios coma estes, non é preciso "mka clean" primeiro. Non obstante, os cambios en PRODUCT_PROPERTY_OVERRIDES poden non ser detectados polo sistema de compilación. Vaia ao cartafol de saída, introduza o cartafol do sistema e elimine "build.prop" para que se rexenere.

source: Udev rules
fr: Les règles udev
gl: Engadir as regras udev

source: Extract the file 70-android.rules which you created in the previous section using ``adb pull`` or ``scp`` and copy it to the 'ubuntu' directory of your device source tree. Complete steps 3 and 4 above.
fr: Extrayez le fichier 70-android.rules que vous avez créé dans la section précédente en utilisant ``adb pull`` ou ``scp`` et copiez-le dans le répertoire 'ubuntu' de l'arborescence des sources de votre appareil. Effectuez les étapes 3 et 4 ci-dessus.
gl: Extrae o ficheiro 70-android.rules que creou na sección anterior usando "adb pull" ou "scp" e cópiao no directorio "ubuntu" da árbore de orixe do dispositivo. Complete os pasos 3 e 4 anteriores.

source: Display scaling
fr: Mise à l'échelle de l'affichage
gl: Escalada da pantalla
it: Ridimensionamento del display

source: There are two variables that set the content scaling for Unity 8 and Ubuntu Touch applications: ``GRID_UNIT_PX`` and ``QTWEBKIT_DPR``.
fr: Il existe deux variables qui définissent la mise à l'échelle du contenu pour Unity 8 et les applications sur Ubuntu Touch : ``GRID_UNIT_PX`` et ``QTWEBKIT_DPR``.
gl: Hai dúas variables que configuran a escala de contido para os aplicativos Unity 8 e Ubuntu Touch: "GRID_UNIT_PX" e "QTWEBKIT_DPR".

source: There are also other options available that may be useful for you depending on your device's form factor. These are mentioned below and all of these settings are explained in depth in the reference section on :ref:`Display-settings`.
fr: Il existe également d'autres options disponibles qui pourraient vous être utiles en fonction du facteur de forme de votre appareil. Celles-ci sont traitées ci-dessous et tous ces réglages sont expliqués en détail dans la section de référence sur les :ref:`Paramètres d'affichage`.
gl: Tamén hai outras opcións dispoñibles que poden resultarche útiles segundo o factor de forma do dispositivo. Estes son mencionados a continuación e todos esta configuración explícanse en profundidade na sección de referencia en: ref: `Display-settings`.

source: All of these settings are guessed by Unity 8 if none are set. There are many cases, however, where the guess is wrong (for example, very high resolution phone displays will be identified as desktop computers). To manually set a value for these variables, simply edit the file at ``etc/ubuntu-touch-session.d/android.conf`` specifying them. For example, this is the file for the Nexus 7 tablet::
fr: Tous ces paramètres sont devinés par Unity 8 si aucun d'entre eux n'est défini. Il existe de nombreux cas, cependant, pour lesquels la déduction est fausse (par exemple, les écrans de téléphone à très haute résolution seront identifiés comme des ordinateurs). Pour définir manuellement une valeur pour ces variables, modifiez tout simplement le fichier sous ``etc/ubuntu-touch-session.d/android.conf`` en les spécifiant. Par exemple, voici le fichier pour la tablette Nexus 7 ::
gl: Todas estas opcións son adiviñadas por Unity 8 se ningunha está definida. Non obstante, hai moitos casos nos que a suposición é incorrecta (por exemplo, as pantallas de teléfono de moi alta resolución identificaranse como computadoras de escritorio). Para establecer manualmente un valor para estas variables, simplemente edite o ficheiro en "etc / ubuntu-touch-session.d / android.conf" especificándoas. Por exemplo, este é o ficheiro da tableta Nexus 7:

source: The :ref:`Display-settings` section details methods for deriving values for these variables.
fr: La section :ref:`Paramètres d'affichage` détaille les méthodes de dérivation des valeurs pour ces variables.
gl: A sección: ref: "Configuración de visualización" detalla os métodos para obter valores destas variables.

source: Once you have adjusted the ``android.conf`` file to the display settings needed for your device, this file should be incorporated into your build.
fr: Une fois que vous aurez ajusté le fichier ``android.conf`` aux paramètres d'affichage nécessaires pour votre appareil, ce fichier devrait pouvoir être intégré à votre compilation.
gl: Unha vez axustado o ficheiro "android.conf" á configuración de pantalla necesaria para o seu dispositivo, este ficheiro debería incorporarse á súa compilación.

source: Create the file android.conf in your 'ubuntu' directory and enter the settings you determined and tested in the previous section. Complete steps 3 and 4 above, taking care to remember the note on how to :ref:`Rebuild-system.img`.
fr: Créez le fichier android.conf dans votre répertoire 'ubuntu' et entrez les paramètres que vous avez déterminés et testés dans la section précédente. Complétez les étapes 3 et 4 ci-dessus, en prenant soin de vous rappeler la note sur la façon de :ref:`Recompiler le fichier system.img`.
gl: Crea o ficheiro android.conf no directorio "ubuntu" e introduce a configuración que determinaches e probaches na sección anterior. Complete os pasos 3 e 4 anteriores, coidando de recordar a nota sobre como: ref: `Rebuild-system.img`.

source: Apply apparmor kernel patches
fr: Appliquer les correctifs Apparmor au noyau
gl: Aplique parches do núcleo apparmor

source: `What is apparmor? <https://wiki.ubuntu.com/AppArmor>`_
fr: `Qu'est-ce qu'Apparmor ? <https://wiki.ubuntu.com/AppArmor>`_
gl: `Que é apparmor? <https://wiki.ubuntu.com/AppArmor>`_

source: Start by downloading the backported `apparmor patch <https://github.com/ubports/apparmor-backports-ut>`_ corresponding to your device's kernel version. Your kernel version is specified at the beginning of your kernel defconfig file, i.e. the one you edited in section :ref:`Edit-kernel-config` above.
fr: Commencez par télécharger le `correctif Apparmor rétroporté <https://github.com/ubports/apparmor-backports-ut>`_ correspondant à la version du noyau de votre appareil. Votre version du noyau est spécifiée au début de votre fichier defconfig du noyau, c'est-à-dire celui que vous avez modifié dans la section :ref:`Modifier la configuration du noyau` ci-dessus.
gl: Comeza descargando o parche apparmor <https://github.com/ubports/apparmor-backports-ut> `_ que se corresponde coa versión do núcleo do teu dispositivo. A súa versión do núcleo especifícase ao comezo do ficheiro defconfig do núcleo, é dicir, a que editou na sección: ref: `Edit-kernel-config` anterior.

source: You now need to delete your entire BUILDDIR/kernel/VENDOR/MODEL/security/apparmor subdirectory and replace it with the one you downloaded. Then rebuild halium-boot.
fr: Vous devez maintenant supprimer tout votre sous-répertoire BUILDDIR/kernel/VENDOR/MODEL/security/apparmor et le remplacer par celui que vous avez téléchargé. Puis reconstruire halium-boot.
gl: Agora ten que eliminar todo o seu subdirectorio BUILDDIR / kernel / VENDOR / MODEL / security / apparmor e substituílo polo que descargou. Despois reconstrúe o boot-halium.

source: If you get errors when building, you will need to resolve them one by one, modifying your source code as needed. Note that you should only modify the code in the apparmor subdirectory if at all possible. Modifying code elsewhere will more than likely just compound your problems.
fr: Si vous obtenez des erreurs lors de la construction, vous devrez les résoudre une par une, en modifiant votre code source si nécessaire. Notez que vous ne devez modifier le code dans le sous-répertoire apparmor que si cela est possible. Si vous modifiez le code ailleurs, il est fort probable que cela ne fera qu'aggraver vos problèmes.
gl: Se recibe erros ao construír, terá que resolvelos un por un, modificando o seu código fonte segundo sexa necesario. Ten en conta que só debes modificar o código no subdirectorio apparmor se é posible. Modificar código noutro lugar é máis que probable que só agrave os seus problemas.

source: Seek help as needed from one of the sources mentioned in section :ref:`Getting-community-help`.
fr: Cherchez de l'aide si nécessaire auprès d'une des sources mentionnées dans la section :ref:`Obtenir de l'aide de la communauté`.
gl: Busque axuda segundo sexa necesario nunha das fontes mencionadas na sección: ref: `Getting-community-help`.

source: Sound configuration
fr: Configuration du son
gl: Configuración do son

source: The supplied touch.pa file located in the /etc/pulse directory of your device needs adjustment. Extract the file and copy it to your 'ubuntu' directory.
fr: Le fichier touch.pa fourni, situé dans le répertoire /etc/pulse de votre appareil, doit être ajusté. Extrayez le fichier et copiez-le dans votre répertoire 'ubuntu'.
gl: O ficheiro touch.pa fornecido situado no directorio / etc / pulse do dispositivo precisa axustarse. Extrae o ficheiro e cópiao no directorio "ubuntu".

source: Locate the line::
fr: Localisez la ligne ::
gl: Localizar a liña::

source: and replace it with this::
fr: et remplacez-la avec ceci ::
gl: e reemprazala con isto::

source: At the end of the file, append this::
fr: À la fin du fichier, ajoutez ceci ::
gl: Na fin do ficheiro, engada isto::

source: Now complete steps 3 and 4, taking care to remember the note on how to :ref:`Rebuild-system.img`.
fr: Complétez maintenant les étapes 3 et 4, en prenant soin de vous rappeler la note sur la façon de :ref:`Reconstruire le fichier system.img`.
gl: Agora complete os pasos 3 e 4, coidando de recordar a nota sobre como: ref: `Rebuild-system.img`.

source: Further configuration
fr: Configuration supplémentaire
gl: Máis configuración

source: For the time being, refer to the `porting faq <https://pad.ubports.com/p/porting-faq>`_ and `porting check list <https://pad.ubports.com/p/PortChecklist>`_.
fr: Pour l'instant, reportez-vous à la `foire aux questions sur le portage <https://pad.ubports.com/p/porting-faq>`_ et à la `liste de vérifications du portage <https://pad.ubports.com/p/PortChecklist>`_.
gl: Polo momento, consulte a `faq de portabilidade <https://pad.ubports.com/p/porting-faq>` _ e a lista de comprobación de `porting <https://pad.ubports.com/p/PortChecklist> _.

source: Installing
fr: Installation
gl: Instalando

source: Install and debug initial boot
fr: Installation et déverminage du démarrage initial
gl: Instalar e depurar o arranque inicial

source: These steps will wipe **all** of the data on your device. If there is anything that you would like to keep, ensure it is backed up and copied to a safe location before continuing.
fr: Ces étapes écraseront **toutes** les données sur votre appareil. Si vous souhaitez conserver quelque chose, assurez-vous qu'elles sont sauvegardées sur une copie externe à l'appareil avant de continuer.
gl: Estes pasos borrarán ** todos ** os datos do dispositivo. Se hai algo que desexa conservar, asegúrese de que se fai unha copia de seguridade e se copia nun lugar seguro antes de continuar.

source: Now that you have built halium-boot, you are ready to install Ubuntu Touch on your device.
fr: Maintenant que vous avez construit halium-boot, vous êtes prêt à installer Ubuntu Touch sur votre appareil.
gl: Agora que construíu halium-boot, xa podes instalar Ubuntu Touch no teu dispositivo.

source: In order to install Ubuntu Touch, you will need a recovery with Busybox, such as TWRP, installed on your phone. If you have not done so yet, refer to section :ref:`Install-TWRP-recovery` and install it now.
fr: Afin d'installer Ubuntu Touch, vous aurez besoin d'installer sur votre appareil un mode récupération avec Busybox, tel que TWRP. Si vous ne l'avez pas encore fait, reportez-vous à la section :ref:`Install-TWRP-recovery` et installez-le maintenant.
gl: Para instalar Ubuntu Touch, necesitará unha recuperación con Busybox, como TWRP, instalado no seu teléfono. Se aínda non o fixeches, consulte a sección: ref: `Install-TWRP-recovery` e instálalo agora.

source: You will also need to ensure the ``/data`` partition is formatted with ``ext4`` and does not have any encryption on it. Boot into the recovery image you just installed, check and adjust as necessary.
fr: Vous devrez également vous assurer que la partition ``/data`` est formatée en ``ext4`` et qu'elle ne comporte aucun chiffrement. Démarrez dans l'image de récupération que vous venez d'installer, vérifiez et corrigez si nécessaire.
gl: Tamén necesitará asegurarse de que a partición "/ data" está formatada con "ext4" e non ten ningún cifrado. Arranca na imaxe de recuperación que acabas de instalar, comproba e axusta segundo sexa necesario.

source: Flash halium-boot
fr: Installation d'halium-boot
gl: Instalación do halium-boot

source: To install halium-boot, reboot your phone into fastboot mode. Then do the following from your Halium tree::
fr: Pour installer halium-boot, redémarrez votre appareil en mode « fastboot », puis faites ceci à partir de votre arborescence d'Halium ::
gl: Para instalar halium-boot, reinicie o teléfono no modo de arranque rápido. Entón faga o seguinte desde a súa árbore de Halium:
