Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: On this website you find guides to :doc:`install Ubuntu Touch on your mobile phone <userguide/install>`, :doc:`use Ubuntu Touch <userguide/dailyuse/index>`, :doc:`develop Ubuntu Touch apps <appdev/index>`, :doc:`port Ubuntu Touch to an Android handset <porting/introduction/index>` and :doc:`learn more about system components <systemdev/index>`. If this is your first time here, please consider reading our :doc:`introduction <about/introduction>`.
fr: Sur ce site, vous trouverez des guides pour :doc:`installer Ubuntu Touch sur votre téléphone mobile <userguide/install>`, :doc:`utiliser Ubuntu Touch <userguide/dailyuse/index>`, :doc:`développer des applications pour Ubuntu Touch <appdev/index>`, :doc:`porter Ubuntu Touch sur un appareil sous Android <porting/introduction/index>` et :doc:`en savoir plus sur les composants du système <systemdev/index>`. Si c'est la première fois que vous venez ici, pensez à lire notre :doc:`introduction <about/introduction>`.
it: In questo sito web si trovano guide per :doc:`installare Ubuntu Touch sul telefono cellulare <userguide/install>`, :doc:`utilizzare Ubuntu Touch <userguide/dailyuse/index>`, :doc:`sviluppare applicazioni Ubuntu Touch <appdev/index>`, :doc:`portare Ubuntu Touch su un telefono Android <porting/introduction/index>` e :doc:`apprendere di più sui componenti del sistema <systemdev/index>`. Se è la prima volta che venite qui, vi invitiamo a leggere la nostra :doc:`introduzione <about/introduzione>`.

source: `Español <https://docs.ubports.com/es/latest/>`_
fr: `Espagnol <https://docs.ubports.com/es/latest/>`_
it: `Spagnolo <https://docs.ubports.com/es/latest/>`_

source: Working on the Calendar feature
it: Lavorare sulla funzione Calendario

source: The Calendar feature is provided by several components:
it: La funzione Calendario è fornita da diversi componenti:

source: The `Calendar App <https://gitlab.com/ubports/apps/calendar-app>`_, providing the user interface
it: La `Calendar App <https://gitlab.com/ubports/apps/calendar-app>`_, che fornisce l'interfaccia utente

source: `Evolution Data Server <https://github.com/ubports/evolution-data-server-packaging>`_ (often shortened as "EDS"), which is the backend where your calendars are stored
it: `Evolution Data Server <https://github.com/ubports/evolution-data-server-packaging>`_ (spesso abbreviato in "EDS"), che è il backend in cui sono memorizzati i calendari

source: `sync-monitor <https://github.com/ubports/sync-monitor>`_, the service responsible for managing the synchronisation with remote calendars
it: `sync-monitor <https://github.com/ubports/sync-monitor>`_, il servizio responsabile della gestione della sincronizzazione con i calendari remoti

source: `SyncEvolution <https://github.com/ubports/syncevolution-packaging>`_, the service responsible for performing the synchronisation to a WebDAV/CalDAV remote calendar
it: `SyncEvolution <https://github.com/ubports/syncevolution-packaging>`_, il servizio responsabile dell'esecuzione della sincronizzazione con un calendario remoto WebDAV/CalDAV

source: The most convenient way to run commands on the device and collect logs is by opening a remote shell. This can be done by using :doc:`/userguide/advanceduse/adb` or :doc:`/userguide/advanceduse/ssh`. In the following sections, it's assumed that you've got access to a terminal console to the device.
it: Il modo più comodo per eseguire comandi sul dispositivo e raccogliere i log è aprire una shell remota. Questo può essere fatto usando :doc:`/userguide/advanceduse/adb` o :doc:`/userguide/advanceduse/ssh`. Nelle sezioni seguenti si presuppone che si abbia accesso a una console terminale del dispositivo.

source: Scheduling and account issues
it: Problemi di programmazione e di account

source: If you are not sure whether the calendar is being synchronised, or whether the operation is successful, ``sync-monitor`` is the component that needs to be examined. This service should always be running in the background, and its logs can be found in ``~/.cache/upstart/sync-monitor.log``. In order to see them printed in real-time as you operate on the device, you can run this command:
it: Se non siete sicuri se il calendario è sincronizzato, o se l'operazione ha successo, ``sync-monitor`` è il componente che deve essere esaminato. Questo servizio dovrebbe sempre essere in esecuzione in background, e i suoi registri possono essere trovati in ``~/.cache/upstart/sync-monitor.log``. Per visualizzarli stampati in tempo reale mentre si opera sul dispositivo, è possibile eseguire questo comando:

source: These logs should be enough to give you an idea on whether your calendar accounts are recognised, and whether a synchronisation is scheduled, happening, and completing successfully.
it: Questi registri dovrebbero essere sufficienti per darvi un'idea se i vostri conti del calendario sono riconosciuti, e se una sincronizzazione è programmata, accade, e completa con successo.

source: Calendar data synchronisation issues
it: Problemi di sincronizzazione dei dati del calendario

source: Follow these steps one you are confident that a synchronisation of your account is at least attempted, and want to investigate a synchronisation failure or issues with missing or duplicate items. On the device, it's possible to run ``syncevolution`` in debug mode. To do so, kill any existing processes:
it: Segui questi passaggi una volta che sei sicuro che una sincronizzazione del tuo account è almeno tentata, e vuoi indagare su un guasto di sincronizzazione o problemi con elementi mancanti o duplicati. Sul dispositivo, è possibile eseguire ``syncevolution` in modalità debug. Per farlo, terminare qualsiasi processo esistente:

source: Then, start the ``syncevolution`` process with the proper environment variable:
it: Quindi, avviare il processo ``syncevolution`` con la variabile ambiente corretta:

source: At this point, open the Calendar App (if it was not open already) and manually trigger a synchronisation (note that the Synchronisation action is only available if your device is connected to the internet): all the logs will appear in the terminal.
it: A questo punto, aprire l'App Calendar (se non era già aperta) e attivare manualmente una sincronizzazione (nota che l'azione Synchronisation è disponibile solo se il dispositivo è collegato a Internet): tutti i registri appariranno nel terminale.

source: In some cases, the output from ``syncevolution`` might not be enough: for example, the raw HTTP data is usually not printed. Should you need to see that as well, then you'll have to modify a configuration file as well. ``syncevolution``'s configuration files are located under ``~/.config/syncevolution/``, in a subdirectory whose name takes the form ``<provider-name>-<account-id>``. There might be stale directories as well, referring to old accounts which have been since deleted. To find out what accounts are still valid, you can invoke the ``account-console`` tool like this:
it: In alcuni casi, l'output da ``syncevolution`` potrebbe non essere sufficiente: ad esempio, i dati HTTP grezzi di solito non sono stampati. Se avrai bisogno di vederli, allora dovrai modificare anche un file di configurazione. I file di configurazione di ``syncevolution`` si trovano sotto ``~/.config/syncevolution/``, in una sottodirectory il cui nome prende il modulo ``<provider-name>- No.<account-id>``. Ci potrebbero essere anche directory stanti, riferendosi a conti vecchi che sono stati cancellati da allora. Per scoprire quali account sono ancora validi, è possibile invocare il ``account-console``strumento come questo:

source: This will print the list of the current valid accounts. Once you've figured out what is the account you are interested in, open the file ``~/.config/syncevolution/<account>/peers/target-config/config.ini`` and set the ``loglevel`` variable to a higher value (``11`` seems enough to print all the HTTP traffic):
it: Questo stamperà l'elenco dei conti validi correnti. Una volta capito qual è l'account che ti interessa, apri il file ``~/.config/syncevolution/<account>/peers/target-config/config.ini`` e imposta la variabile ``loglevel`` a un valore superiore (``11`` sembra sufficiente per stampare tutto il traffico HTTP):

source: Note that in order for these changes to take effect, you'll need to restart the ``syncevolution`` process again, as explained above.
it: Si noti che in modo che queste modifiche abbiano effetto, dovrai riavviare nuovamente il processo ``syncevolution``, come spiegato sopra.

source: System Software guides
it: Guide software di sistema

source: These guides will give you general instructions on building and testing your own changes to Ubuntu Touch system software. They are not not an exhaustive reference on everything you will come across during development, but they are a great starting point.
it: Queste guide vi daranno istruzioni generali sulla costruzione e testare le proprie modifiche al software di sistema Ubuntu Touch. Non sono un riferimento esaustivo su tutto quello che incontrerete durante lo sviluppo, ma sono un ottimo punto di partenza.

source: If you get stuck at any point while going through this documentation, please contact us for help via `the UBports Forum <https://forums.ubports.com>`_ or your preferred communication medium.
it: Se si rimane bloccati in qualsiasi momento durante l'esecuzione di questa documentazione, si prega di contattarci per l'aiuto tramite `il forum UBports <https: forums.ubports.com="">`_ o il mezzo di comunicazione preferito.

source: System software development
it: Sviluppo del software di sistema

source: This section has various documents which will teach you how to work with the system level of Ubuntu Touch. This includes the Kernel, Android HAL, Ubuntu UI Toolkit, Unity8, and all of the other software that makes Ubuntu Touch what it is.
it: Questa sezione contiene vari documenti che ti insegneranno come lavorare con il livello di sistema di Ubuntu Touch. Ciò include il kernel, Android HAL, Ubuntu UI Toolkit, Unity8 e tutti gli altri software che rendono Ubuntu Touch ciò che è.

source: This section does not cover most of the *applications* preinstalled on Ubuntu Touch. See :doc:`/contribute/preinstalled-apps` for more information on those.
it: Questa sezione non copre la maggior parte delle *applicazioni* preinstallate su Ubuntu Touch. Per maggiori informazioni vedere :doc:`/contribute/preinstalled-apps`.

source: Kernel and hardware abstraction
it: Astrazione del kernel e dell'hardware

source: This page documents the resources and processes to build the kernel and hardware abstraction for UT devices. This document is useful if you would like to work on:
it: Questa pagina documenta le risorse e i processi per costruire il kernel e l'astrazione hardware per i dispositivi UT. Questo documento è utile se si desidera lavorare su:

source: A hardware related issue (camera, sensors, radios)
it: Un problema relativo all'hardware (camera, sensori, radio)

source: A Linux kernel related issue
it: Un problema relativo al kernel Linux

source: An issue related to the system-image upgrade process
it: Un problema relativo al processo di aggiornamento dell'immagine del sistema

source: This document is not useful if you would like to modify :doc:`../contribute/preinstalled-apps` or :doc:`System software <../systemdev/index>`. See the respective documentation for each.
it: Questo documento non è utile se si desidera modificare :doc: `../contribute/preinstalled-apps` oppure :doc: `System software <../systemdev/index>`. Vedere la relativa documentazione per ciascuno.

source: There are a few different groups of Ubuntu Touch devices with respect to how the kernel and hardware abstraction is implemented:
it: Ci sono alcuni diversi gruppi di dispositivi Ubuntu Touch rispetto a come viene implementata l'astrazione del kernel e dell'hardware:

source: Android 5.1 based ports
it: Trasporto basato su Android 5.1

source: Halium based ports
it: Trasporto basato su Halium

source: Android 5.1 based ports of Ubuntu Touch consist of the Linux kernel for this device plus a minimal Android system that is used to enable all the hardware. Every device has it's own fork of the Linux kernel. They are all heavily modified for the specific hardware used in that device. These forks are also based off quite old Linux kernel versions.
it: I trasporti basati su Android 5.1 di Ubuntu Touch consistono dal kernel Linux per questo dispositivo più un sistema Android minimale che viene utilizzato per abilitare tutto l'hardware. Ogni dispositivo ha la sua forchetta (fork) del kernel Linux. Sono tutti fortemente modificati per l'hardware specifico utilizzato in quel dispositivo. Queste forchette si basano anche sulle vecchie versioni del kernel Linux.

source: For some devices continuous integration (CI) has been set up to build both the Kernel as well as the Android system. Other devices have to be built manually from their repositories. For a third group of devices, we do not unfortunately, have the full source code available. The Bq and Meizu devices have kernel sources, but the "Android device tree" is not publicly available. The manufacturers of these devices provided binary builds instead.
it: Per alcuni dispositivi l'integrazione continua (CI) è stata creata per costruire sia il Kernel che il sistema Android. Altri dispositivi devono essere costruiti manualmente dai loro repository. Per un terzo gruppo di dispositivi, purtroppo, non abbiamo il codice sorgente completo disponibile. I dispositivi Bq e Meizu hanno sorgenti del kernel, ma l' "albero dispositivo Android" non è pubblicamente disponibile. I produttori di questi dispositivi fornivano invece delle costruzioni binarie.

source: With CI
it: Con CI

source: Manual builds
it: Costruzioni manuali

source: (Partial) Binary builds
it: (Parziali) Costruzioni binarie

source: Detailed steps for the three CI enabled devices can be found under :doc:`HAL for Nexus 5, OnePlus One, and Fairphone 2 <ubp-5.1>`.
it: I passaggi dettagliati per i tre dispositivi abilitati CI possono essere trovati sotto:doc: `HAL per Nexus 5, OnePlus One e Fairphone 2 <ubp-5.1>`.

source: For the Nexus 7 2013 Wifi (flo) head over to the `Community Ports repository for flo <https://gitlab.com/ubports/community-ports/flo>`_.
it: Per il Nexus 7 2013 Wifi (flo) dirigersi verso la `Comunità Ports repository per flo <https://gitlab.com/ubports/community-ports/flo>`_.

source: The port for the Nexus 7 2013 GSM (deb) was created by a community member. Unfortunately those repositories have disappeared over time. So this build also falls into the group of prebuilt binaries.
it: Il trasporto per il Nexus 7 2013 GSM (deb) è stato creato da un membro della comunità. Purtroppo quei depositi (repositories) sono scomparsi nel tempo. Quindi questa build rientra anche nel gruppo dei binari precostruiti.

source: Todo
it: Dafare

source: Document the process for Nexus 4 (mako)
it: Documentare il processo per Nexus 4 (mako)

source: Newer ports to Android devices are based on `Halium <https://docs.halium.org>`_. In some aspects Halium is similar to the 5.1 based ports:
it: I trasporti più recenti ai dispositivi Android si basano su `Halium <https://docs.halium.org`_. In alcuni aspetti Halium è simile ai trasporti basati 5.1:

source: It also uses the device specific fork of the Linux kernel provided by the manufacturer.
it: Utilizza anche la fork specifica del dispositivo del kernel Linux fornita dal produttore.

source: It also uses a minimal Android system to enable some hardware.
it: Utilizza anche un sistema Android minimo per abilitare alcuni hardware.

source: However, Halium permits a more generic way of porting to Android devices. This allows the work to be shared between multiple projects that bring different flavours of Linux systems to Android devices. Halium ports are also based on newer Android versions 7.1 and above.
it: Tuttavia, Halium permette un modo più generico il trasporto a dispositivi Android. Questo consente di condividere il lavoro tra più progetti che portano diversi sapori di sistemi Linux a dispositivi Android. I trasporti Halium si basano anche sulle versioni Android più recenti 7.1 e superiori.

source: Some examples of Halium ports are those for Sony Xperia X and Oneplus 3. Basically all devices that are listed on `devices.ubuntu-touch.io <https://devices.ubuntu-touch.io>`_, expect those explicitly mentioned above as 5.1, or below as Linux based ports.
it: Alcuni esempi di trasporti Halium sono quelli per Sony Xperia X e Oneplus 3. Fondamentalmente tutti i dispositivi che sono elencati su `devices.ubuntu-touch.io <https://devices.ubuntu-touch.io>`_, aspettatevi che quelli esplicitamente menzionati sopra come 5.1, o sotto come trasporti basati su Linux.

source: All new ports of UT to Android devices should follow the Halium process. Further details can be found under :doc:`Halium porting <../porting/introduction/index>`
it: Tutti i nuovi trasporti di UT a dispositivi Android dovrebbero seguire il processo Halium. Ulteriori dettagli possono essere trovati sotto:doc: `Halium porting <../porting/introduction/index>`

source: Linux based ports
it: Trasporti basati su Linux

source: Linux based port refers to devices where a Linux kernel is used without any Android parts. The following devices are in this group:
it: Il trasporto basato su Linux si riferisce ai dispositivi in cui viene utilizzato un kernel Linux senza parti Android. I seguenti dispositivi sono in questo gruppo:

source: `Raspberry Pi (rpi) <https://gitlab.com/ubports/community-ports/raspberrypi>`_ (see also this `blog post <https://ubports.com/blog/ubports-blog-1/post/raspberry-pi-266>`_)
it: `Raspberry Pi (rpi) <https://gitlab.com/ubports/community-ports/raspberrypi>`_ (vedi anche questo `blog post <https://ubports.com/blog/ubports-blog-1/post/raspberry-pi-266>`_)

source: PinePhone and PineTab kernel
it: PinePhone e PineTab kernel

source: This document describes how to build and install the PinePhone or PineTab kernel. First the recovery system is explained. Then the actual building and installation. At the bottom there are some references.
it: Questo documento descrive come costruire e installare il kernel PinePhone o PineTab. Prima si spiega il sistema di recupero. Poi l'attuale costruzione e l'installazione. In fondo ci sono alcuni riferimenti.

source: Recovery
it: Recupero (recovery)

source: The Ubuntu Touch image contains a `recovery <https://github.com/ubports/jumpdrive>`_ boot mode based on "jumpdrive". To get into the recovery press and hold the power and volume-up buttons until the led turns on.
it: L'immagine Ubuntu Touch contiene un `recupero <https:// github.com/ubports/jumpdrive >`_ modalità di avvio basato su "jumpdrive". Per entrare nella stampa di recupero e tenere i pulsanti di potenza e volume-up fino a quando il led si accende.

source: The recovery presents the PinePhone as a network device over USB and runs a telnet server. When you connect the PinePhone to your desktop via USB, you will see the rndis device show up in your desktop's ``dmesg``::
it: Il recupero presenta il PinePhone come dispositivo di rete su USB ed esegue un server telnet. Quando si collega il PinePhone al desktop tramite USB, si vedrà il dispositivo rndis apparire nel ``dmesg`` del desktop::

source: You can log in to the recovery system with ``telnet 172.16.42.1``.
it: È possibile accedere al sistema di recupero con ``telnet 172.16.42.1``.

source: The recovery also exposes the eMMC and the microSD card over USB. Assuming you have already installed Ubuntu Touch on your microSD card you will see something like this in your desktop's ``dmesg``::
it: Il recupero espone anche l'eMMC e la scheda microSD su USB. Supponendo di aver già installato Ubuntu Touch sulla vostra scheda microSD vedrete qualcosa come questo nel desktop ``dmesg``::

source: The eMMC with jumpdrive contains two partitions: pmOS_boot and pmOS_root.
it: L'eMMC con jumpdrive contiene due partizioni: pmOS_boot e pmOS_root.

source: The microSD card with Ubuntu Touch contains 10 partitions: loader, scr, persist, boot_a, boot_b, recovery_a, recovery_b, cache, system and userdata. To update the kernel you want to mount boot_a. Check which device is the SDcard in your OS and mount boot_a. In the example above this is sdc4. Inside that partition you'll see the kernel vmlinuz and related files: ``config-5.6.0-pine64`` ``dtb`` ``initrd.img`` ``modules/`` ``System.map-5.6.0-pine64`` ``vmlinuz``.
it: La scheda microSD con Ubuntu Touch contiene 10 partizioni: loader, scr, persist, boot_a, boot_b, recovery_a, recovery_b, cache, sistema e userdata. Per aggiornare il kernel si desidera montare boot_a. Controllare quale dispositivo è la scheda SD nel sistema operativo e montare boot_a. Nell'esempio sopra questo è sdc4. All'interno di quella partizione vedrai il kernel vmlinuz e i relativi file:``config-5.6.0-pine64`` ``dtb`` ``initrd.img`` ``modules/`` ``System.map-5.6.0-pine64`` ``vmlinuz``.

source: Building the kernel
it: Costruire il kernel

source: To install dependencies, get the `source code <https://gitlab.com/pine64-org/linux/-/tree/pine64-kernel-ubports>`_, configure and build the kernel, run the following::
it: Per installare dipendenze, ottenere il `codice sorgente <https://gitlab.com/pine64-org/linux/-/tree/pine64-kernel-ubports>`_,configurare e costruire il kernel, eseguire le seguenti operazioni::

source: Install the kernel
it: Installare il kernel

source: Boot into recovery and mount boot_a. Make a backup if needed. Then copy over your newly built kernel and if needed modules::
it: Riavviare in recupero e montare boot_a. Fai un backup se necessario. Quindi copiare sul vostro kernel di nuova costruzione e se necessario moduli::

source: Afterwards be sure to unmount the partition so it is cleanly written. Now you can reboot the PinePhone. Once booted, you can verify that the kernel has been successfully updated by checking the build date with ``uname -a`` on the device.
it: Successivamente essere sicuri di smontare la partizione così è scritta in modo pulito. Ora puoi riavviare il PinePhone. Una volta avviato, è possibile verificare che il kernel sia stato aggiornato correttamente controllando la data di compilazione con ``uname -a`` sul dispositivo.

source: `Pine64 wiki <https://wiki.pine64.org/index.php/PinePhone>`_ has general HW info, pointers to other PinePhone OS projects, HW revisions, serial UART over headphone jack (also in their store), spec sheets, known HW issues, etc
it: `Pine64 wiki<https://wiki.pine64.org/index.php/PinePhone>`_ ha informazioni generali HW, puntatori ad altri progetti di PinePhone OS, revisioni HW, UART seriale su jack per cuffie (anche nel loro negozio), fogli spec, problemi HW conosciuti, ecc

source: `Main UBports repository <https://gitlab.com/ubports/community-ports/pinephone>`_ has instructions for how to install UT images on the PinePhone
it: `Main UBports repository <https://gitlab.com/ubports/community-ports/pinephone>`_ ha istruzioni per come installare immagini UT sul PinePhone

source: `UBPorts issue tracker <https://gitlab.com/ubports/community-ports/pinephone/-/issues>`_
it: `UBPorts tracciatore problemi(issue tracker) <https://gitlab.com/ubports/community-ports/pinephone/-/issues>`_

source: `PinePhone forum from Pine64 <https://forum.pine64.org/forumdisplay.php?fid=120>`_ is where many other communities gather that work with the PinePhone
it: `PinePhone forum da Pine64 <https://forum.pine64.org/forumdisplay.php?fid=120>`_ è dove molte altre comunità si riuniscono che lavorano con il PinePhone
