Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: If you don't see the log that you've been asked to send in Logviewer, it may be in a different folder or the application may not have created any logs yet. Tell this to the person who asked you for the logs. They should be able to get you the information you need to get back on track.
fr: Si vous ne voyez pas le journal qu'on vous a demandé d'envoyer dans Visionneuse de journaux, il se peut qu'il se trouve dans un autre dossier ou que l'application n'ait pas encore créé de journal. Dites-le à la personne qui vous a demandé les journaux. Elle devrait être en mesure de vous fournir les informations dont vous avez besoin pour vous remettre sur la bonne voie.
gl: Se non ve o rexistro que se lle pediu que envíe a Logviewer, é posible que estea noutro cartafol ou que o aplicativo aínda non creou ningún rexistro. Dillo isto á persoa que che pediu os rexistros. Deberían poder obter a información que necesitas para volver á pista.
it: Se non vedete il registro che vi è stato chiesto di inviare in Logviewer, è possibile che si trovi in una cartella diversa o che l'applicazione non abbia ancora creato alcun registro. Informate la persona che vi ha chiesto i registri. Dovrebbe essere in grado di fornirvi le informazioni necessarie per rimettervi in carreggiata.

source: Documentation on this site is written in ReStructuredText, or RST for short. Please check the `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>`_ if you are not familiar with RST.
fr: La documentation sur ce site est écrite en ReStructuredText, ou RST en version courte. Veuillez consulter l'`introduction à RST <http://www.sphinx-doc.org/en/stable/rest.html>`_ si vous n'êtes pas familier avec celui-ci.
gl: A documentación neste sitio está escrita en ReStructuredText, ou RST en breve. Comprobe o `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>` _ se non está familiarizado con RST.
it: La documentazione su questo sito è scritta in ReStructuredText o RST in breve. Si prega di controllare il `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>` _ se non si ha familiarità con RST.

source: This page will guide you through writing great documentation for the UBports project that can be featured on this site.
fr: Cette page vous guidera dans l'écriture d'une bonne documentation pour le projet UBports pouvant être mise en avant sur ce site.
gl: Esta páxina guiarate ao escribir unha gran documentación para o proxecto UBports que se pode presentar neste sitio.
it: Questa pagina ti guiderà attraverso la corposa documentazione del progetto UBports che può essere descritto su questo sito.

source: Documentation guidelines
fr: Recommandations pour l'écriture de la documentation
gl: Directrices da documentación
it: Linee guida per la documentazione

source: These rules govern how you should write your documentation to avoid problems with style, format, or linking.
fr: Ces règles précisent comment vous devez écrire votre documentation pour éviter des problèmes de style, de format ou de liens.
gl: Estas regras rexen como debes escribir a túa documentación para evitar problemas de estilo, formato ou ligazón.
it: Queste regole governano come dovresti scrivere la tua documentare per evitare problemi di stile, formato e di collegamenti.

source: Title
fr: Titre
gl: Título
it: Titolo

source: All pages must have a document title that will be shown in the table of contents (left sidebar) and at the top of the page.
fr: Toutes les pages doivent avoir un titre de document qui sera affiché dans le sommaire (volet de gauche) et en haut de la page.
gl: Todas as páxinas deben ter un título de documento que se mostrará no índice (barra lateral esquerda) e na parte superior da páxina.
it: Tutte le pagine devono aver un titolo di documento, che sarà mostrato nell'indice (a sinistra) in cima alla pagina.

source: Titles should be "sentence cased" rather than "Title Cased". For example::
fr: Les mots dans les titres doivent commencer par une minuscule plutôt que par une majuscule. Par exemple ::
gl: Os títulos deben estar "con maiúsculas de frases" en lugar de "con maiúsculas con frases". Por exemplo:
it: I titoli devono essere "a frase" piuttosto che "a titolo". Ad esempio::

source: There isn't a single definition of title casing that everyone follows, but sentence casing is easy. This helps keep capitalization in the table of contents consistent.
fr: Il n'existe pas de règle unique que tout le monde puisse suivre pour l'écriture des titres, mais mettre des minuscules est simple. Cela aide à conserver les majuscules de manière cohérente dans le sommaire.
gl: Non hai unha única definición de título de maiúsculas que todo o mundo siga, pero a de frase é doada. Isto axuda a manter a maiúscula na táboa de contido consistente.
it: Non c'è una sola definizione di formattazione titolo che tutti seguano, ma la formattazione della affermazioni è facile. Questo rende la formattazione dell'indice consistente.

source: Page titles are underlined with equals signs. For example, the markup for :doc:`./bugreporting` includes the following title:
fr: Les titres des pages sont soulignés avec des signes égal. Par exemple, le balisage pour :doc:`./bugreporting` comprend le titre suivant :
gl: Os títulos das páxinas están subliñados con signos iguais. Por exemplo, a marca para: doc: `. / Bugreporting` inclúe o seguinte título:
it: I titoli delle pagine sono sottolineati con i segni di uguale. Per esempio, il markup di :doc:`./bugreporting` include il seguente titolo:

source: Note that:
fr: Notez que :
gl: Teña en conta que:
it: Si noti che:

source: The title is sentence cased
fr: La casse du titre est celle d'une phrase
gl: O título iníciase con maiúscula
it: Il titolo è incassato a frase

source: The title is underlined with equals signs
fr: Le titre est souligné avec des signes égal
gl: O título sublíñase con signos de igual
it: Il titolo è sottolineato con i segni di uguale

source: The underline spans the title completely without going over
fr: Le soulignement couvre complètement le titre sans le dépasser
gl: O subliñado abrangue o título completamente sen sobresaír
it: La sottolineatura attraversa completamente il titolo senza oltrepassarlo

source: Incorrect examples of titles include:
fr: Voici quelques exemples incorrects de titres :
gl: Algúns exemplos incorrectos de títulos:
it: Esempi di titoli non corretti sono:

source: Incorrect casing
fr: Casse incorrecte
gl: Maiúsculas incorrectas
it: Involucro errato

source: Underline too short
fr: Soulignement trop court
gl: Subliñado demasiado curto
it: Sottolineare troppo breve

source: Underline too long
fr: Soulignement trop long
gl: Subliñado demasiado longo
it: Sottolineare troppo

source: Headings
fr: Rubriques
gl: Cabeceiras
it: Denominazioni

source: There are several levels of headings that you may place on your page. These levels are shown here in order:
fr: Il existe plusieurs niveaux de chapitres que vous pouvez utiliser dans votre page. Ces niveaux sont présentés ci-dessous dans l'ordre :
gl: Hai varios niveis de títulos que podes colocar na túa páxina. Estes niveis móstranse aquí en orde:
it: Ci sono diversi livelli di intestazioni che potete inserire nella vostra pagina. Questi livelli sono mostrati qui in ordine:

source: Each heading level creates a sub-section in the global table of contents tree available when the documentation is built. In the primary (web) version of the documentation, this only shows four levels deep from the top level of the documentation. Please refrain from using more heading levels than will show in this tree as it makes navigating your document difficult. If you must use this many heading levels, it is a good sign that your document should be split up into multiple pages.
fr: Chaque niveau de chapitre créé une sous-section dans l'arborescence du sommaire général disponible lorsque la documentation est construite. Dans la version principale de la documentation (Web), seuls quatre niveaux de profondeur sont affichés à partir du niveau supérieur de la documentation. Veuillez éviter d'utiliser plus de niveaux de chapitres que ce qui ne peut apparaître dans l'arborescence car cela rend plus difficile la navigation au sein de votre document. Si vous devez utiliser autant de niveaux de chapitres, c'est le signe que votre documentation devrait être séparée en plusieurs pages.
gl: Cada nivel de cabeceira crea unha subsección na árbore de táboa de contidos global dispoñible cando se constrúe a documentación. Na versión principal (web) da documentación, isto só mostra catro niveis de profundidade desde o nivel superior da documentación. Abstéñase de usar máis niveis de cabeceira que os que se amosarán nesta árbore xa que dificulta a navegación polo documento. Se debes empregar estes moitos niveis de título, é un bo sinal de que o teu documento debería dividirse en varias páxinas.
it: Ogni livello di intestazione crea una sottosezione nella tabella globale dell'albero dei contenuti disponibile quando la documentazione è costruita. Nella versione(web) primaria della documentazione, questo mostra solo quattro livelli profondi dal livello superiore della documentazione. Si prega di astenersi dall'utilizzo di più livelli di intestazione di mostrare in questo albero in quanto rende difficile la navigazione del documento. Se è necessario utilizzare molti livelli di intestazione, è un buon segno che il documento deve essere diviso in più pagine.

source: Table of contents
fr: Sommaire
gl: Táboa de contidos
it: Indice

source: People can't navigate to your new page if they can't find it. Neither can Sphinx. That's why you need to add new pages to Sphinx's table of contents.
fr: Les visiteurs ne peuvent pas accéder à votre nouvelle page s'ils ne peuvent pas la trouver. Sphinx non plus. C'est pour quoi vous devez ajouter de nouvelles pages au sommaire de Sphinx.
gl: A xente non pode navegar á súa nova páxina se non a pode atopar. Tampouco pode a Sphinx. É por iso que cómpre engadir novas páxinas ao índice de Sphinx.
it: Gli utenti non possono navigare nella tua pagina nuova se non riescono a trovarla. Tanto meno Sphinx. Ecco perchè hai bisogno di aggiungere pagine nuove all'indice di Sphinx.

source: You can do this by adding the page to the ``index.rst`` file in the same directory that you created it. For example, if you create a file called "newpage.rst", you would add the line marked with a chevron (>) in the nearest index:
fr: Vous pouvez faire cela en ajoutant la page dans le fichier ``index.rst`` dans le même répertoire de création. Par exemple, si vous créez un fichier appelé « newpage.rst », vous ajouterez la ligne précédée d'un chevron (>) dans l'index le plus proche :
gl: Pode facelo engadindo a páxina ao ficheiro "index.rst" no mesmo directorio que o creou. Por exemplo, créase un ficheiro chamado "newpage.rst", engadiría a liña marcada cun chevron (>) no índice máis próximo:
it: Lo puoi fare aggiungendo la pagina nel file ``index.rst`` nella stessa directory che hai creato. Ad esempio, se crei un file chiamato "newpage.rst", aggiungerai una linea marcata con un simbolo di maggiore (chevron o >) nell'indice più prossimo:

source: The order matters. If you would like your page to appear in a certain place in the table of contents, place it there. In the previous example, newpage would be added to the end of this table of contents.
fr: L'ordre est important. Si vous souhaitez que votre page apparaisse à une certaine place dans le sommaire, placez-la là. Dans l'exemple précédent, la nouvelle page serait ajoutée à la fin de ce sommaire.
gl: A orde importa. Se desexa que a súa páxina apareza nun determinado lugar da táboa de contidos, colóquea alí. No exemplo anterior, engadiríase unha nova páxina ao final desta táboa de contidos.
it: L'ordine è importante. Se vuoi che la tua pagina appaia in un certo punto dell'indice, mettilo lì. Nell'esempio precedente, newpage sarebbe stata aggiunta alla fine dell'indice.

source: Moving pages
fr: Déplacement des pages
gl: Movendo páxinas
it: Pagine mobili

source: Sometimes it becomes necessary to move a page from one place in the documentation to another. Generally this is to improve document flow: For example, it makes more sense for the page to come after a page you've just added in a different section.
fr: Il est parfois nécessaire de déplacer une page d'un endroit à l'autre de la documentation. En général, cela permet d'améliorer la fluidité de la documentation. Par exemple, il est plus logique que la page vienne après une page que vous venez d'ajouter dans une autre section.
gl: Ás veces faise necesario mover unha páxina dun lugar da documentación a outro. Xeralmente trátase de mellorar o fluxo de documentos: por exemplo, ten máis sentido que a páxina veña despois dunha páxina que acaba de engadir nunha sección diferente.
it: A volte diventa necessario spostare una pagina da un posto nella documentazione ad un altro. Generalmente questo è per migliorare il flusso dei documenti: Ad esempio, ha più senso per la pagina venire dopo una pagina che hai appena aggiunto in una sezione diversa.

source: However, people link to our documentation from many sources that we do not control. Blogs, websites, and other documentation sites can direct people here using links that they may never update. It is a terrible experience to follow a link from a different site and land on a 404 page, left to your own devices to find your way in restructured documentation.
fr: Cependant, les gens se relient à notre documentation à partir de nombreuses sources que nous ne contrôlons pas. Les blogs, sites internet et autres sites de documentation peuvent orienter les gens vers notre site en utilisant des liens qu'ils ne mettront jamais à jour. C'est une expérience terrible que de suivre un lien depuis un autre site, d'atterrir sur une page 404 et d'être laissé à soi-même pour trouver son chemin dans une documentation restructurée.
gl: Non obstante, a xente liga coa nosa documentación de moitas fontes que non controlamos. Os blogs, sitios web e outros sitios de documentación poden dirixir ás persoas aquí usando ligazóns que quizais nunca actualicen. É unha experiencia terrible seguir unha ligazón desde un sitio diferente e aterrar nunha páxina 404, deixada aos teus propios dispositivos para atopar o teu camiño na documentación reestruturada.
it: Tuttavia, le persone collegano alla nostra documentazione da molte fonti che non controlliamo. Blog, siti web e altri siti di documentazione possono indirizzare le persone qui utilizzando link che potrebbero non aggiornare mai. È un'esperienza terribile seguire un link da un sito e un terreno diverso su una pagina 404, lasciato ai propri dispositivi per trovare la vostra strada nella documentazione ristrutturata.

source: We use a tool called Rediraffe to avoid this bad experience. Rediraffe creates redirect pages which can send a user from an old, invalid link to a new, useful link. Please create a redirect link when changing a page's name or moving a page within the documentation's directory structure. Redirect links are created by placing the filename of the old document and the filename of the new document, relative to the documentation's root, in the `redirects.txt file <https://github.com/ubports/docs.ubports.com/blob/master/redirects.txt>`_.
fr: Nous utilisons un outil appelé Rediraffe pour éviter cette mauvaise expérience. Rediraffe crée des pages de redirection qui peuvent envoyer un/e utilisateur/trice d'un ancien lien non valide vers un nouveau lien utile. Veuillez créer un lien de redirection lorsque vous changez le nom d'une page ou lorsque vous déplacez une page dans la structure du répertoire de la documentation. Les liens de redirection sont créés en plaçant le nom de fichier de l'ancien document et le nom de fichier du nouveau document, par rapport à la racine de la documentation, dans le fichier `redirects.txt <https://github.com/ubports/docs.ubports.com/blob/master/redirects.txt>`_.
gl: Usamos unha ferramenta chamada Rediraffe para evitar esta mala experiencia. Rediraffe crea páxinas de redirección que poden enviar a un usuario desde unha vella e válida ligazón a unha nova e útil. Cre unha ligazón de redirección cando cambie o nome dunha páxina ou mova unha páxina dentro da estrutura de directorios da documentación. As ligazóns de redirección créanse colocando o nome do ficheiro do documento antigo e o nome do novo documento, en relación á raíz da documentación, no ficheiro `redirects.txt <https://github.com/ubports/docs.ubports.com/ blob / master / redirects.txt> `_.
it: Usiamo uno strumento chiamato Rediraffe per evitare questa brutta esperienza. Rediraffe crea pagine redirect che possono inviare un utente da un vecchio link non valido a un nuovo link utile. Si prega di creare un link redirect quando si modifica il nome di una pagina o si sposta una pagina all'interno della struttura della directory della documentazione. I link redirect vengono creati mettendo il nome del file del vecchio documento e il nome del file del nuovo documento, relativo alla radice della documentazione, nei `redirects.txt file <https://github.com/ubports/docs.ubports.com/blob/master/redirects.txt>`_.

source: We use Rediraffe's ``checkdiff`` builder to ensure that pages are not deleted from the documentation without a redirect in place. This builder is run as part of the ``build.sh`` script in the repository and as part of our automated build once you submit a Pull Request.
fr: Nous utilisons le générateur « checkdiff » de Rediraffe pour nous assurer que les pages ne sont pas supprimées de la documentation sans qu'une redirection ne soit mise en place. Ce générateur est exécuté dans le cadre du script ``build.sh`` du dépôt et dans le cadre de notre génération automatique lorsque vous soumettez une demande d'extraction.
gl: Usamos o creador de "checkdiff" de Rediraffe para asegurarnos de que as páxinas non se eliminan da documentación sen unha redirección ao lugar. Este creador execútase como parte do script "build.sh" no repositorio e como parte da nosa compilación automática unha vez que envíe unha solicitude de extracción.
it: Utilizziamo il costruttore ``checkdiff`` di Rediraffe per garantire che le pagine non vengano eliminate dalla documentazione senza un reindirizzamento di posizione. Questo costruttore è eseguito come parte dello script ``build.sh``nel repository e come parte della nostra build automatizzata una volta che si invia una Richiesta di Pull.

source: What follows are some examples of situations where you should create redirects.
fr: Voici quelques exemples de situations dans lesquelles vous devez créer des redirections.
gl: A continuación móstranse algúns exemplos de situacións nas que debería crear redireccións.
it: Ciò che segue sono alcuni esempi di situazioni in cui si dovrebbe creare redirect.

source: You are moving ``systemdev/calendars.rst`` to ``appdev/calendars.rst``. Add the following to the ``redirects.txt`` file::
fr: Vous déplacez « systemdev/calendars.rst » vers « appdev/calendars.rst ». Ajoutez ce qui suit au fichier ``redirects.txt``: :
gl: Estás a mover "systemdev / calendars.rst" a "appdev / calendars.rst". Engada o seguinte ao ficheiro "redirects.txt" ::
it: Si sta muovendo ``systemdev/calendars.rst` a ``appdev/calendars.rst``. Aggiungi quanto segue al file ``redirects.txt``::

source: You are moving ``appdev/clickable.rst`` into several pages in ``appdev/clickable/`` to give significantly more information about the tool than there was previously. You have created an introduction page, ``appdev/clickable/introduction.rst``. In this case, it would be a good idea to redirect the old page to the new introduction page. This can be done by adding the following to ``redirects.txt``::
fr: Vous déplacez « appdev/clickable.rst » sur plusieurs pages dans « appdev/clickable/ » pour donner beaucoup plus d'informations sur l'outil qu'il n'y en avait auparavant. Vous avez créé une page d'introduction, ``appdev/clickable/introduction.rst``. Dans ce cas, ce serait une bonne idée de rediriger l'ancienne page vers la nouvelle page d'introduction. Cela peut être fait en ajoutant ce qui suit au fichier « redirects.txt »: :
gl: Estás a mover "appdev / clickable.rst" a varias páxinas en "appdev / clickable /" para dar significativamente máis información sobre a ferramenta que a anterior. Creaches unha páxina de introdución, "appdev / clickable / introduction.rst". Neste caso, sería unha boa idea redirixir a páxina antiga á nova páxina de introdución. Isto pódese facer engadindo o seguinte a "redirects.txt" ::
it: Stai muovendo ``appdev/clickable.rst`` in diverse pagine in ``appdev/clickable/`` per dare significativamente più informazioni sullo strumento di quanto non ci fosse in precedenza. Hai creato una pagina di introduzione, ``appdev/clickable/introduction.rst``. In questo caso, sarebbe una buona idea reindirizzare la vecchia pagina alla nuova pagina di introduzione. Questo può essere fatto aggiungendo il seguente a ``redirects.txt``::

source: Warnings
fr: Avertissements
gl: Avisos
it: Avvertimenti

source: Your edits must not introduce any warnings into the documentation build. If any warnings occur, the build will fail and your pull request will be marked with a red 'X'. Please ensure that your RST is valid and correct before you create a pull request. This is done automatically (via sphinx-build crashing with your error) if you follow :ref:`our build instructions <doc-contribution-workflow>` below.
fr: Vos modifications ne doivent pas introduire d'avertissements dans la documentation construite. Si un avertissement se produit, la compilation échouera et votre proposition sera marquée d'un « X » rouge. Assurez-vous que votre fichier RST est valide et correct avant de soumettre une proposition. Ceci est fait automatiquement (via le plantage de sphinx-build avec votre erreur) si vous suivez :ref:`nos instructions de compilation <doc-contribution-workflow>` ci-dessous.
gl: As súas edicións non deben introducir avisos na compilación de documentación. Se son producidos avisos, a compilación fallará e a súa solicitude de extracción marcarase cun "X" vermello. Asegúrese de que o seu RST é válido e correcto antes de crear unha solicitude de extracción. Isto faise automaticamente (a través dun erro de esfinge-build co erro) se segue: ref: `as nosas instrucións de construción <doc-contribution-workflow>` a continuación.
it: Le tue modifiche non devono introdurre alcun avviso nella creazione della documentazione. Se si verificano avvertimenti, la build fallirà e la tua richiesta pull sarà contrassegnata con una 'X' rossa. Assicurati che il tuo RST sia valido e corretto prima di creare una richiesta pull. Questo viene fatto automaticamente (tramite sphinx-build crash con il vostro errore) se si segue :ref: `le nostre istruzioni di costruzione <doc-contribution-workflow>`di seguito.

source: Line length
fr: Longueur de ligne
gl: Lonxitude de liña
it: Lunghezza della linea

source: There is no restriction on line length in this repository. Please do not break lines at an arbitrary line length. Instead, turn on word wrap in your text editor.
fr: Il n'y a pas de restriction de longueur de ligne dans ce dépôt. Veuillez ne pas faire de renvoi à la ligne pour une longueur arbitraire de longueur de ligne. À la place, activez le retour à la ligne automatique dans votre éditeur de texte.
gl: Non hai ningunha restrición na lonxitude da liña neste repositorio. Por favor, non rompa as liñas cunha lonxitude arbitraria. En lugar diso, activa a configuración de palabras no editor de texto.
it: In questo repository non ci sono restrizioni sulla lunghezza delle righe. Si prega di non interrompere le righe a una lunghezza arbitraria. Attivare invece il word wrap nel proprio editor di testo.
