Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: For quick actions. See `Quick actions`_.
it: Per le azioni veloci. Vedi `Quick actions`_.

source: Dialogs
it: Dialoghi

source: A dialog is a way of informing the user about important notices or letting them complete a single action.
it: Una finestra di dialogo è un modo per informare l'utente su avvisi importanti o lasciargli completare una singola azione.

source: Dialogs should be unambiguous and concise in their wording. Only the most common, or main, action should be highlighted with color. The main action should be placed topmost in vertical dialogs or rightmost in horizontal dialogs.
it: I dialogi dovrebbero essere inequivocabili e concisi nella loro formulazione. Solo la più comune, o principale, azione dovrebbe essere evidenziata con il colore. L'azione principale deve essere posizionata più in alto nelle finestre di dialogo verticali o più in basso nelle finestre di dialogo orizzontali.

source: Main actions may be positive, negative, or neutral. Positive actions add something to their subjects. Negative actions remove, delete, or otherwise make changes that can't be easily undone. Neutral actions do not add or remove from the subject, but still make a change.
it: Le azioni principali possono essere positive, negative o neutrali. Le azioni positive aggiungono qualcosa ai loro soggetti. Azioni negative rimuovere, eliminare o altrimenti apportare modifiche che non possono essere facilmente annullate. Le azioni neutre non aggiungono o tolgono dal soggetto, ma fanno comunque un cambiamento.

source: The main action should be highlighted using ``theme.palette.normal.negative`` if it is destructive, ``theme.palette.normal.positive`` if it is positive, or ``theme.palette.normal.focus`` if it is neutral. The remaining options should be gray, without defining a color theme property.
it: L'azione principale deve essere evidenziata utilizzando ``theme.palette.normal.negative``` se è distruttivo, ``theme.palette.normal.positive`` se è positivo, o ``theme.palette.normal.focus`` se è neutro. Le opzioni rimanenti dovrebbero essere grigi, senza definire una proprietà a tema di colore.

source: Dialogs should resume actions, not ask a yes or no question. For example, the user has selected an option to delete a contact. Your dialog should ask, "Are you sure you would like to delete this contact?" The options should then be "Delete", a negative action colored in red, and "Cancel", colored in gray.
it: I dialoghi dovrebbero riprendere le azioni, non chiedere un sì o nessuna domanda. Ad esempio, l'utente ha selezionato un'opzione per eliminare un contatto. La finestra di dialogo dovrebbe chiedere: "Sei sicuro di voler eliminare questo contatto?" Le opzioni dovrebbero quindi essere "Delete", un'azione negativa colorata in rosso, e "Cancel", colorata in grigio.

source: Examples of designs to avoid
it: Esempi di design da evitare

source: Left: Download button uses old focus color, Cancel button (secondary action) uses old grey color.
it: Sinistra: bottone di download usa il vecchio colore di focus, il bottone di cancellazione (azione secondaria) usa il vecchio colore grigio.

source: Right: Dialog uses generic answers, both buttons colored as main actions with confusing color meaning: "Will 'No' cause an irreversible action, and 'Yes' cause an additive action?"
it: Giusto: Dialog utilizza risposte generiche, entrambi i pulsanti colorati come azioni principali con il significato di colore confuso: " il'No' causerà un'azione irreversibile, e 'Sì' causerà un'azione additiva?"

source: Header uses
it: Usi dell'intestazione

source: App headers can be used to show app name, app section or page, search box, or other globally accessible functions.
it: Le intestazioni dell'app possono essere utilizzate per mostrare il nome dell'app, la sezione o la pagina dell'app, la casella di ricerca o altre funzioni accessibili a livello globale.

source: Some special apps doesn't show any header, like the Camera app or some games.
it: Alcune app speciali non mostrano alcuna intestazione, come l'app Fotocamera o alcuni giochi.

source: The header takes care of showing the back button when a `page stack <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/PageStack.html>`__ is used.
it: L'intestazione si prende cura di mostrare il pulsante posteriore quando una `pagina stack <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/PageStack.html>`__ viene utilizzato.

source: Importing Data
it: Importazione di dati

source: Interchange of data between apps is done through Content Hub. This improves isolation between apps.
it: Lo scambio di dati tra app avviene tramite il Content Hub. Questo migliora l'isolamento tra le app.

source: Apps with the appropriate apparmor permissions can import, export or share data between them.
it: Le app con appropriati permessi apparmor possono importare, esportare o scambiare dati tra loro.

source: For more information see `Importing from Content Hub and URLdispatcher`_.
it: Per ulteriori informazioni vedere `Importing from Content Hub and URLdispatcher`_.

source: App layout
it: Disposizione(layout) della app

source: Main actions
it: Azioni principali

source: Main actions are displayed in the corresponding header of the Page. The header should show only relevant actions to the current page.
it: Le azioni principali sono mostrate nell'intestazione corrispondente della pagina. L'intestazione dovrebbe mostrare solo le azioni rilevanti per la pagina corrente.

source: Main page of Contacts app shows:
it: La pagina principale dell'app Contacts mostra:

source: When viewing a single contact, only relevant actions are shown:
it: Mentre si visualizza un singolo contatto, sono mostrate solo le azioni rilevanti:

source: The header contains a number of slots that can hold actions or navigational options. Depending on the surface or window size, additional slots can be added to show the actions otherwise hidden in drawers.
it: L'intestazione contiene un numero di slot che possono ospitare azioni o opzioni di navigazione. In base allo schermo o alla dimensione della finestra, possono essere aggiunti slot per mostrare le azioni che altrimenti sarebbero nascoste.

source: Action Drawer
it: Cassetto d'azione

source: Actions will be placed into an action drawer when there are no available slots to house them. However, when your app is on a larger surface, like on a desktop, then actions will appear in the slots.
it: Le azioni saranno poste in un cassetto azione quando non ci sono slot disponibili per ospitarli. Tuttavia, quando l'applicazione è su una superficie più grande, come su un desktop, allora le azioni apparirà nelle slot.

source: Responsive layout
it: Layout reattivo

source: As the header gains width across screen sizes, additional slots become visible and actions in the drawer will appear automatically.
it: Poiché l'intestazione guadagna la larghezza tra le dimensioni dello schermo, le fessure aggiuntive diventano visibili e le azioni nel cassetto appariranno automaticamente.

source: 3 slot layout
it: 3 impostazione slot

source: 4 slot layout
it: 4 impostazione slot

source: 5 slot layout
it: 5 impostazione slot

source: 6 slot layout
it: 6 impostazione slot

source: Medium to large screens
it: Schermi medio-grandi

source: The maximum number of visible action slots in a convergent environment is 6. If this is exceeded then additional actions will migrate to the action drawer.
it: Il numero massimo di slot di azione visibili in un ambiente convergente è 6. Se questo viene superato allora ulteriori azioni migrano al cassetto azione.

source: Simple
it: Semplice

source: Keep in mind to keep a clean design. The simpler, the better.
it: Ricorda di mantenere un design pulito. Più è semplice, meglio è.

source: Presenting data
it: Presentare i dati

source: List Items
it: Lista di oggetti

source: List items can be used to make up a list of ordered scrollable items that are related to each other.
it: La lista di oggetti può essere usata per fare una lista ordinata e scorrevole di oggetti che sono in relazione tra loro.

source: When images or icons are presented without text or actions, it would make more sense to show them inside a grid rather than a list; like in a photo gallery.
it: Quando le immagini o le icone sono presentate senza testo o azioni, avrebbe più senso mostrarle all'interno di una griglia piuttosto che di una lista; come in una galleria fotografica.

source: Items in a list can have actions that can be placed in a context menu. The context menu can be accessed in two ways: by swiping or right-clicking the list item.
it: Gli elementi in un elenco possono avere azioni che possono essere posizionate in un menu contestuale. Il menu contestuale può essere accessibile in due modi: scorrendo o facendo clic con il pulsante destro del mouse sulla voce dell'elenco.

source: The actions are placed within two categories: leading for negative actions and trailing for positive actions.
it: Le azioni sono poste all'interno di due categorie: che portano ad azioni negative e alle azioni positive.

source: Touch swiping
it: Scorrimento del tocco

source: Mouse right click
it: Click destro del mouse

source: Keyboard navigation
it: Navigazione da tastiera

source: Lists in edit mode
it: Liste in modalità editing

source: Edit mode allows users to modify a particular item or multiple items at once.
it: La modalità di editing permette all'utente di modificare un particolare oggetto o oggetti multipli.

source: You can use edit mode to allow users to multi-select, rearrange or delete items inside a list. When edit mode is entered the whole screen becomes an edit state and the header will show associated editing actions for the content. Alternatively, if the user long presses an item a context menu will show the associated editing actions too.
it: È possibile utilizzare la modalità edit per consentire agli utenti di multi-selezionare, riordinare o eliminare elementi all'interno di un elenco. Quando la modalità di modifica viene inserita nell'intera schermata diventa uno stato di modifica e l'intestazione mostrerà le azioni di editing associate per il contenuto. In alternativa, se l'utente preme a lungo un elemento un menu di contesto mostrerà le azioni di editing associate troppo.

source: Layout of detailed list items
it: Disposizione di una lista dettagliata di oggetti

source: 1 line – Title
it: 1 linea - Titolo

source: 1 line – Subtitle
it: 1 linea - Sottotitolo

source: 2 lines – Summary
it: 2 linee - Sommario

source: Quick actions
it: Azioni rapide

source: The most common action for an app, the one that needs to be accessed quickly might be added as a `bottom edge <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/BottomEdge.html>`__ action, accessed with a swipe from outside of the screen upwards.
it: L'azione più comune per un'applicazione, quella a cui si deve accedere rapidamente, potrebbe essere aggiunta come azione `bottom edge <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/BottomEdge.html>`__, a cui si accede con uno scorrimento dall'esterno dello schermo verso l'alto.

source: You can add a new contact in the Contacts app swiping up:
it: È possibile aggiungere un nuovo contatto nell'app Contatti scorrendo verso l'alto:

source: Hint
it: Suggerimento

source: The hint is used to let the user know that there is something worth trying at the bottom of the screen.
it: Il suggerimento è usato per permettere all'utente di sapere che c'è qualcosa che vale la pena provare nella parte inferiore dello schermo.

source: After opening an app, a hint with a text and/or an icon is shown:
it: Dopo aver aperto un'app, viene visualizzato un suggerimento con un testo e/o un'icona:

source: After after a few seconds it hides and a floating icon is shown
it: Dopo pochi secondo si nasconde e viene mostrata una icona mobile

source: App icon design
it: Design dell'icona dell'App

source: The whole system and apps follow the `Suru design principles <http://web.archive.org/web/20191223082720/https://docs.ubuntu.com/phone/en/apps/design/get-started/design-philosophy>`__ started by Canonical and `Samuel Hewitt <https://samuelhewitt.com>`__.
it: L'intero sistema e le applicazioni seguono i principi di progettazione `Suru <http://web.archive.org/web/20191223082720/https://docs.ubuntu.com/phone/en/apps/design/get-started/design-philosophy>`__ avviati da Canonical e `Samuel Hewitt <https://samuelhewitt.com>`__.

source: Design Philosophy and Suru Meaning
it: Filosofia del design e significato di Suru

source: Suru alludes to Japanese culture.
it: Suru allude alla cultura giapponese.

source: The design of Suru is inspired by origami.
it: Il disegno di Suru è ispirato dagli origami.

source: Paper can be used in two and three dimensional forms, because it is transferable and diverse.
it: La carta può essere utilizzata in due e tre forme dimensionali, perché è trasferibile e diversificata.

source: Suru brings a precise yet organic structure to the Ubuntu Touch interface. The sharp lines and varying levels of transparency evoke the edges and texture of paper.
it: Suru porta una struttura precisa ma organica all'interfaccia Ubuntu Touch. Le linee taglienti e i diversi livelli di trasparenza evocano i bordi e la consistenza della carta.

source: Design Tips for an App Icon
it: Suggerimenti per il designo dell'Icona dell'App

source: Descriptive design
it: Disegno descrittivo

source: The icon you choose for your app should describe what your app is about, what it does, or what service it is there for in a recognizable way.
it: L'icona che si sceglie per la vostra app dovrebbe descrivere ciò che la vostra applicazione è circa, che cosa fa, o che servizio è lì per in modo riconoscibile.

source: Distinctive shapes
it: Forme distintive

source: Depending on the object you choose to show in the icon, on the perspective, lighting and other factors, it might be hard to recognize what you are trying to depict. A TV might look like a box, or a computer screen, a remote control like a phone, etc.
it: A seconda dell'oggetto che si sceglie di mostrare nell'icona, sulla prospettiva, l'illuminazione e altri fattori, potrebbe essere difficile riconoscere quello che si sta cercando di descrivere. Una TV potrebbe sembrare una scatola, o uno schermo del computer, un telecomando come un telefono, ecc.

source: Details
it: Dettagli

source: A detailed icon is very nice to look at as it shows quality and your eye for the small things. It might add confusion though, especially in smaller sizes or for people who have impaired eyesight. Show what's necessary, pay attention to detail, but don't overload the icon.
it: Un'icona dettagliata è molto bella da guardare da come mostra la qualità e l'occhio per le piccole cose. Potrebbe aggiungere confusione però, soprattutto nelle dimensioni più piccole o per le persone che hanno la vista compromessa. Mostra ciò che è necessario, fai attenzione ai dettagli, ma non sovraccaricare l'icona.

source: Colours
it: Colori

source: Use distinctive colours, make your icon stand out a bit and give the shapes enough contrast to be visible.
it: Usa colori distintivi, rendi la tua icona un po' in risalto e dalle la forma in sufficiente contrasto per essere visibile.

source: Gradients
it: Gradienti

source: If you were to add a gradient to your icon, only use colours that are slightly different from each other so that the change is not too dramatic. For example:
it: Se dovessi aggiungere un gradiente alla tua icona, usa solo colori leggermente diversi l'uno dall'altro in modo che il cambiamento non sia troppo drammatico. Per esempio:

source: Composition
it: Composizione

source: Suru icons are composed of simple geometric shapes. The background is usually a coloured surface with the pictogram, also composed of flat shapes, “floating” above it.
it: Le icone Suru sono composte da semplici forme geometriche. Lo sfondo è di solito una superficie colorata con il pittogramma, composto anche da forme piatte, “floating” sopra di esso.

source: The Fold Effect
it: L'effetto pieghevole

source: In keeping with the origami motif, some Suru icons have an implied fold. In many icons this is a single horizontal or vertical line but sometimes the fold line(s) correspond or align with elements of the pictogram.
it: In linea con il motivo origami, alcune icone Suru hanno una piega implicita. In molte icone questa è una singola linea orizzontale o verticale, ma a volte la linea di piega corrisponde o allinea con elementi del pittogramma.

source: The fold is drawn by creating an overlay of a white or black polygon of very low opacity (usually between 1%~10%).
it: La piega è disegnata creando un sovrapposizione di un poligono bianco o nero di opacità molto bassa (di solito tra 1% ~ 10%).

source: Grids
it: Griglie

source: Using a grid layout ensures consistency across all icons and will force you to reserve area for the icon background for even padding around the pictogram.
it: L'uso di un layout a griglia garantisce la coerenza tra tutte le icone e obbliga a riservare un'area per lo sfondo dell'icona per un padding uniforme intorno al pittogramma.

source: Note that the circular elements are slightly larger than rectangular elements of the grid, this overshoot is needed to compensate for the optical illusion where circular objects appear smaller than rectangular objects of the same dimensions.
it: Si noti che gli elementi circolari sono leggermente più grandi degli elementi rettangolari della griglia; questo superamento è necessario per compensare l'illusione ottica per cui gli oggetti circolari appaiono più piccoli degli oggetti rettangolari delle stesse dimensioni.

source: Unit Grid
it: Griglia di unità

source: Designing with an overall pixel grid in mind is crucial to having crisp, clean icons. Since most desktop icons have dimensions that are a factor of four (16x16, 24x24, 32x32, 48x48, 256x256) using a pixel grid with lines every 4 pixels and drawing to that grid is the best practice.
it: Progettare tenendo conto di una griglia di pixel è fondamentale per avere icone nitide e pulite. Poiché la maggior parte delle icone del desktop ha dimensioni pari a un fattore quattro (16x16, 24x24, 32x32, 48x48, 256x256), la pratica migliore è quella di utilizzare una griglia di pixel con linee ogni 4 pixel e di disegnare su quella griglia.

source: Shadows
it: Ombre

source: Often a Suru icon is drawn with two distinct sets of shadows, one for the pictogram to create a drop shadow effect, and a second below the overall icon shape.
it: Spesso un'icona Suru viene disegnata con due serie distinte di ombre, una per il pittogramma per creare un effetto di ombra a goccia e una seconda sotto la forma complessiva dell'icona.

source: The drop shadow effect on the central pictogram is a combination of two shadow that are identical in shape to the pictogram:
it: L'effetto ombra sul pittogramma centrale è una combinazione di due ombre di forma identica al pittogramma:

source: a shape that is rgba(0,0,0,0.1) with vertical offset of 2 pixels and a blur of 1%
it: una forma che è rgba(0,0,0,0,0.1) con uno spostamento verticale di 2 pixel e una sfocatura dell'1%

source: a shape that is rgba(0,0,0,0.4) with vertical offset of 4 pixels and a blur of 10%
it: una forma che è rgba(0,0,0,0,0.4) con uno spostamento verticale di 4 pixel e una sfocatura del 10%

source: If the fold effect is present, the second shadow is drawn using a linear gradient with three stops whose positions correspond to the location of the background fold.
it: Se è presente l'effetto piega, la seconda ombra viene disegnata utilizzando un gradiente lineare con tre stop le cui posizioni corrispondono alla posizione della piega dello sfondo.

source: Highlights
it: Evidenziazioni

source: Pictograms have an ever~so~slight (1 pixel) white highlight along the top edge of them. To do this, make 2 solid white copies of the main pictogram shape and move one copy 1 pixel down and 'difference' the two so what's left is an 'edge' that you can align to the top of the pictogram. Repeat as needed.
it: I pittogrammi hanno un'evidenziazione bianca sempre più leggera (1 pixel) lungo il bordo superiore. Per fare ciò, creare 2 copie bianche solide della forma principale del pittogramma e spostare una copia di 1 pixel verso il basso e 'differenziare' le due in modo che ciò che rimane sia un 'bordo' da allineare alla parte superiore del pittogramma. Ripetere se necessario.

source: Depending on the colour of your pictogram element, you can vary the opacity of your highlight. For instance, if it is using bright, primary colours, there isn't any need for a highlight.
it: A seconda del colore dell'elemento del pittogramma, è possibile variare l'opacità dell'evidenziazione. Ad esempio, se il pittogramma utilizza colori primari e brillanti, non c'è bisogno di un'evidenziazione.

source: Grids and other resources can be found in this `gitlab repository <https://gitlab.com/cibersheep/ubuntu-icon-resource-kit>`__.
it: Le griglie e altre risorse si trovano in questo repository `gitlab <https://gitlab.com/cibersheep/ubuntu-icon-resource-kit>`__.

source: In-app icons design
it: Disegno delle icone in-app

source: Interface Icons
it: Icone dell'interfaccia

source: Interface icons communicate either status or action displays, such as battery level or an alarm, whilst also enabling the user to perform actions like opening a menu, sharing content or print a document. The interface icons are located in the top bar or in-app icons, such as in the Header or the menus.
it: Le icone dell'interfaccia comunicano lo stato o le azioni visualizzate, come il livello della batteria o un allarme, e consentono all'utente di eseguire azioni come l'apertura di un menu, la condivisione di contenuti o la stampa di un documento. Le icone dell'interfaccia si trovano nella barra superiore o nelle icone dell'applicazione, ad esempio nell'intestazione o nei menu.

source: |stock_message.svg| |share.svg| |stock_alarm-clock.svg| |security-alert.svg| |settings.svg|
it: |messaggio-scorta.svg| |quota.svg| |orologio-sveglia_scorta.svg| |allarme-sicurezza.svg| |impostazioni.svg|

source: stock_message.svg
it: messaggio_scorta.svg

source: share.svg
it: quota.svg

source: stock_alarm-clock.svg
it: orologio-sveglia_scorta.svg

source: security-alert.svg
it: allarme-sicurezza.svg

source: settings.svg
it: impostazioni.svg

source: See a `list of the icons <http://docs.ubports.com/projects/icons/>`__. available in the system.
it: Vedere un `elenco delle icone <http://docs.ubports.com/projects/icons/>`__. disponibili nel sistema.

source: Color
it: colore

source: Interface icons can be colourized in qml therefore are designed in #808080 color.
it: Le icone dell'interfaccia possono essere colorate in qml, pertanto sono state progettate con il colore #808080.

source: Font
it: Carattere

source: To provide a consistent look to the UI and to make the Suru icons distinctive, the design is based on the same patterns as the Ubuntu font. The font patterns can applied to the symbol to define its contours.
it: Per dare un aspetto coerente all'interfaccia utente e per rendere distintive le icone di Suru, il disegno si basa sugli stessi motivi del carattere Ubuntu. I motivi del carattere possono essere applicati al simbolo per definirne i contorni.

source: Strokes
it: Estremità

source: Stroke ends are squared but the upper end of vertical strokes is slightly oblique with a +10º angle.
it: Le estremità dei tratti sono squadrate, ma l'estremità superiore dei tratti verticali è leggermente obliqua con un angolo di +10º.

source: Rotation
it: Rotazione

source: When they are not horizontal or vertical, objects are oriented along a +45º axis.
it: Quando non sono orizzontali o verticali, gli oggetti sono orientati lungo un asse di +45º.
