Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: The audio policy is needed for your app to play audio via pulseaudio or media-hub. The permission also gives it the ability to send album art to the thumbnailer service, which is then shown on the sound indicator.
fr: La politique audio est nécessaire pour que votre application puisse lire du son via pulseaudio ou media-hub. Cette permission lui donne également la possibilité d'envoyer la miniature d'un album au service correspondant, qui l'affiche alors dans l'indicateur de son.
gl: A política de audio é necesaria para que o teu aplicativo reproduza audio a través de pulseaudio ou media-hub. O permiso tamén lle dá a posibilidade de enviar imaxes de álbum ao servizo de miniaturas, que logo se mostra no indicador de son.

source: Description: Use bluetooth (bluez5) as an administrator.
fr: Description : utiliser le Bluetooth (bluez5) en tant qu'administrateur.
gl: Descrición: usa o bluetooth (bluez5) como administrador.

source: Usage: reserved
fr: Utilisation : réservée
gl: Uso: reservado

source: This policy grants unrestricted access to Bluetooth devices. It is provided for administration of bluetooth and as a stepping stone towards developing a safe bluetooth API all apps can access.
fr: Cette politique donne des accès non restreints aux appareils en Bluetooth. Elle est fournie pour l'administration du Bluetooth comme tremplin vers le développement d'une API Bluetooth sécurisée, à laquelle toutes les applications peuvent accéder.
gl: Esta política concede acceso sen restricións aos dispositivos Bluetooth. Ofrécese para a administración de bluetooth e como paso para o desenvolvemento dunha API Bluetooth segura a que todos os aplicativos poden acceder.

source: calendar
gl: calendario

source: Description: Can access the calendar.
fr: Description : peut accéder à l'agenda.
gl: Descrición: pode acceder ao calendario.

source: Calendar grants access to the Evolution dataserver's calendar and alarms APIs. It also grants access to sync-monitor.
fr: La politique relative à l'agenda donne accès aux calendriers et aux alarmes du serveur de données Evolution. Elle donne également accès à sync-monitor.
gl: O calendario concede acceso ao calendario e ás API de alarmas do servidor de datos Evolution. Tamén concede acceso ao monitor de sincronización.

source: This policy is reserved since it grants free access to all calendars on the device at any time. The legacy bug about this situation is `LP #1227824`_ .
fr: Cette politique est réservée car elle donne libre accès à tous les agendas de l'appareil à n'importe quel moment. L'anomalie historique liée à cette situation est la `LP #1227824`_ .
gl: Esta política está reservada xa que concede acceso gratuíto a todos os calendarios do dispositivo en calquera momento. O erro herdado desta situación é `LP # 1227824`_.

source: camera
gl: cámara

source: Description: Can access the camera(s)
fr: Description : peut accéder à la caméra (ou aux caméras)
gl: Descrición: pode acceder ás cámaras

source: The camera policy grants access to device cameras.
fr: La politique liée aux caméras donne accès aux caméras de l'appareil.
gl: A política da cámara permite acceder ás cámaras do dispositivo.

source: connectivity
gl: conectividade

source: Description: Can access coarse network connectivity information
fr: Description : peut accéder à des informations brutes de connectivité au réseau
gl: Descrición: pode acceder á información de conectividade de rede

source: The connectivity policy allows apps to determine rough information about the device's connectivity. This includes whether the device is connected to the Internet and whether it is connected via a Wi-Fi or mobile data connection.
fr: La politique liée à la connectivité permet aux applications de déterminer des informations brutes au sujet de la connectivité de l'appareil. Cela inclut le fait de savoir si l'appareil est connecté à Internet et si la connexion se fait par Wi-Fi ou par données mobiles.
gl: A política de conectividade permite aos aplicativos determinar información aproximada sobre a conectividade do dispositivo. Isto inclúe se o dispositivo está conectado a Internet e se está conectado a través dunha conexión Wi-Fi ou de datos móbiles.

source: contacts
gl: contactos

source: Description: Can access contacts.
fr: Description : permet d'accéder aux contacts.
gl: Descrición: pode acceder aos contactos.

source: The contacts policy allows apps to access the device user's contacts list. It is marked as reserved because it allows access to sync-monitor and unfettered access to the address book.
fr: La politique liée aux contacts permet aux applications d'accéder à la liste des contacts de l'utilisateur de l'appareil. Elle est marquée comme réservée elle permet d'accéder à sync-monitor, ainsi qu'un accès illimité au carnet d'adresses.
gl: A política de contactos permite áaos aplicativos acceder á lista de contactos do usuario do dispositivo. Está marcado como reservado porque permite o acceso ao monitor de sincronización e o acceso sen restricións á axenda de enderezos.

source: Description: Can request/import data from other applications
fr: Description : peut demander/importer des données provenant d'autres applications
gl: Descrición: pode solicitar ou importar datos doutros aplicativos

source: Using the content_exchange policy allows your app to be a consumer of content on content-hub.
fr: L'utilisation de la politique d'échange de contenus permet à vos applications de recevoir du contenu provenant du centre de contenus.
gl: Usar a política de «content_exchange» (intercambio do contido) permite ao seu aplicativo usar o contido no «content-hub» (centro de contido).

source: Description: Can provide/export data to other applications
fr: Description : peut fournir/exporter des données à d'autres applications
gl: Descrición: pode fornecer/exportar datos aos outros aplicativos

source: The content_exchange_source policy allows your app to provide content on content-hub.
fr: La politique de sources d'échange de contenus permet à votre application de fournir du contenu via le centre de contenus.
gl: A política content_exchange_source permite que o teu aplicación proporcione contido no content-hub.

source: debug
gl: depuración

source: Description: Use special debugging tools. This should only be used in development and not for production packages. Note: use of this policy group provides significantly different confinement than normal and is not considered secure. You should never run untrusted programs using this policy group.
fr: Description : utiliser des outils de dépannage spéciaux. Ceci devrait uniquement être utilisé pour les paquets en développement, pas pour de la production. Note : utiliser ce groupe politique fournit un confinement significativement différent de la normale et n'est pas considéré comme sûr. Vous ne devriez jamais exécuter des programmes non fiables en utilisant ce groupe de politique.
gl: Descrición: usa ferramentas especiais de depuración. Isto só debería usarse no desenvolvemento e non para paquetes de produción. Nota: o uso deste grupo de políticas proporciona un confinamento significativamente diferente do normal e non se considera seguro. Nunca debes executar programas non fiables usando este grupo de políticas.

source: Description: Can read and write to document files. This policy group is reserved for certain applications, such as document viewers. Developers should typically use the content_exchange policy group and API to access document files instead.
fr: Description : peut lire et écrire dans des documents. Ce groupe de politique est réservé pour certaines applications, telles que les visionneuses de document. Les dévoppeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux documents.
gl: Descrición: pode ler e escribir en ficheiros de documentos. Este grupo de políticas está reservado a determinadas aplicativos, como os visores de documentos. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de documentos.

source: This policy allows apps to read and write to the "Documents" folders in the user's home directory and external media.
fr: Cette politique permet aux applications de lire et d'écrire dans le répertoire « Documents » du dossier personnel et des supports externes.
gl: Esta política permite aos aplicativos ler e escribir nos cartafoles "Documentos" do directorio persoal do usuario e medios externos.

source: Description: Can read all document files. This policy group is reserved for certain applications, such as document viewers. Developers should typically use the content_exchange policy group and API to access document files instead.
fr: Description : peut lire tous les documents. Cette politique est réservée à certaines applications, telles que les visionneuses de documents. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux documents.
gl: Descrición: pode ler todos os ficheiros de documentos. Este grupo de políticas está reservado a determinados aplicativos, como os visores de documentos. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de documentos.

source: This policy allows apps to read the "Documents" folders in the user's home directory and external media.
fr: Cette politique permet aux applications de lire les répertoires « Documents » du dossier personnel et des supports externes.
gl: Esta política permite aos aplicativos ler os cartafoles "Documentos" no directorio persoal do usuario e medios externos.

source: history
gl: historial

source: Description: Can access the history-service. This policy group is reserved for vetted applications only in this version of the policy. A future version of the policy may move this out of reserved status.
fr: Description : permet d'accéder à history-service. Ce groupe de politique est réservé aux applications approuvées uniquement dans cette version de la politique. Une version future de la politique pourrait permettre de sortir du statut réservé.
gl: Descrición: pode acceder ao servizo de historia. Este grupo de políticas está reservado só para aplicativos verificados nesta versión da política. Unha futura versión da política pode sacalo do estado de reservado.

source: Description: Can request keeping the screen on
fr: Description : peut demander de garder l'écran allumé
gl: Descrición: pode solicitar manter a pantalla activa

source: location
gl: ubicación

source: Description: Can access Location
fr: Description : permet d'accéder à la position géographique
gl: Descrición: pode acceder á ubicación

source: Allows an app to request access to the device's current location.
fr: Autorise une application à demander accès à la position géographique de l'appareil actuel.
gl: Permite a un aplicativo solicitar acceso á ubicación actual do dispositivo.

source: microphone
gl: micrófono

source: Description: Can access the microphone
fr: Description : peut accéder au microphone
gl: Descrición: pode acceder o micrófono

source: Description: Can read and write to music files. This policy group is reserved for certain applications, such as music players. Developers should typically use the content_exchange policy group and API to access music files instead.
fr: Description : peut lire et écrire dans des fichiers musicaux. Ce groupe de politique est réservé à certaines applications, telles que des lecteurs de musique. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers musicaux.
gl: Descrición: pode ler e escribir en ficheiros de música. Este grupo de políticas está reservado para determinadas aplicativos, como reprodutores de música. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de música.

source: The music_files policy group allows an app to read or write to the Music directories in the user's home folder or on external media.
fr: Le groupe de politique music_files permet à une application de lire ou d'écrire dans les répertoires « Musique » du dossier personnel ou des supports externes.
gl: O grupo de políticas music_files permite que un aplicativo lea ou escriba nos directorios de música no cartafol persoal do usuario ou en soportes externos.

source: Description: Can read all music files. This policy group is reserved for certain applications, such as music players. Developers should typically use the content_exchange policy group and API to access music files instead.
fr: Description : permet de lire tous les fichiers musicaux. Ce groupe de politique est réservé à certaines applications, telles que les lecteurs de musique. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers musicaux.
gl: Descrición: pode ler todos os ficheiros de música. Este grupo de políticas está reservado para determinadas aplicativos, como reprodutores de música. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de música.

source: The music_files_read policy group allows an app to read the Music directories in the user's home folder or on external media.
fr: Le groupe de politique music_files_read permet à une application de lire les répertoires « Musique » du dossier personnel et des supports externes.
gl: O grupo de políticas music_files_read permite a un aplicativo ler os directorios de música no cartafol persoal do usuario ou en soportes externos.

source: networking
gl: redes

source: Description: Can access the network
fr: Description : peut accéder au réseau
gl: Descrición: pode acceder ás redes

source: The networking policy group allows an app to contact network devices and use the `download manager`_.
fr: Le groupe de politique de mise en réseau permet à une application de contacter des appareils sur le réseau et d'utiliser le `gestionnaire de téléchargements`_.
gl: O grupo de políticas de rede permite a un aplicativo contactar con dispositivos de rede e usar o "xestor de descargas "_.

source: Description: Can read and write to picture files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access picture files instead.
fr: Description : peut lire et écrire dans des fichiers image. Ce groupe de politique est réservé à certaines applications, telles que des applications de galerie. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers image.
gl: Descrición: pode ler e escribir en ficheiros de imaxes. Este grupo de políticas está reservado a determinadas aplicativos, como os aplicativos de galería. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de imaxes.

source: The picture_files policy group allows an app to read and write to the Pictures directories in the user's home folder or on external media.
fr: Le groupe de politique picture_files permet à une application de lire et d'écrire dans les répertoires « Images » du dossier personnel et des supports externes.
gl: O grupo de políticas picture_files permite que unha aplicación lea e escriba nos directorios Pictures do cartafol persoal do usuario ou en soportes externos.

source: Description: Can read all picture files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access picture files instead.
fr: Description : pet lire tous les fichiers image. Ce groupe de politique est réservé à certaines applications, telles que les applications de galerie. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers image.
gl: Descrición: pode ler todos os ficheiros de imaxes. Este grupo de políticas está reservado a determinadas aplicativos, como os aplicativos de galería. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de imaxes.

source: The picture_files_read policy group allows an app to read the Pictures directories in the user's home folder or on external media.
fr: Le groupe de politique picture_files_read permet aux applications de lire les répertoires « Images » du dossier personnel et des supports externes.
gl: O grupo de políticas picture_files_read permite a un aplicativo ler os directorios Pictures no cartafol persoal do usuario ou en soportes externos.

source: Description: Can use push notifications as a client
fr: Description : peut utiliser des notifications poussées en tant que client
gl: Descrición: pode usar notificacións de elemento emerxente como un cliente

source: sensors
gl: sensores

source: Description: Can access the sensors
fr: Description : peut accéder aux capteurs
gl: Descrición: pode acceder aos sensores

source: Allows apps to access `device sensors`_
fr: Permet aux applications d'accéder aux `capteurs de l'appareil`_
gl: Permite aos aplicativos acceder aos `sensores do dispositivo`_

source: usermetrics
gl: métricas de usuario

source: Description: Can use UserMetrics to update the InfoGraphic
fr: Description : peut utiliser UserMetrics pour mettre à jour InfoGraphic
gl: Descrición: pode usar UserMetrics para actualizar InfoGraphic

source: Allows an app to write metrics to the UserMetrics service so they can be displayed on the InfoGraphic.
fr: Permet à une application d'écrire des mesures dans le service UserMetrics afin qu'elles soient affichées sur InfoGraphic.
gl: Permite a un aplicativo escribir métricas no servizo UserMetrics para que se poidan amosar no InfoGraphic.

source: video
gl: vídeo

source: Description: Can play video (allows playing remote content via media-hub)
fr: Description : peut lire des vidéos (permet de lire des contenus à distance via media-hub)
gl: Descrición: pode reproducir vídeo (permite reproducir contido remoto a través de media-hub)

source: Description: Can read and write to video files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access video files instead.
fr: Description : peut lire et écrire dans des fichiers vidéo. Ce groupe de politique est réservé à certaines applications, telles que les applications de galerie. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers vidéo.
gl: Descrición: pode ler e escribir en ficheiros de vídeo. Este grupo de políticas está reservado a determinados aplicativos, como os aplicativos de galería. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de vídeo.

source: The video_files policy group allows an app to read and write to the Videos directories in the user's home folder or on external media.
fr: Le groupe de politique video_files permet à une application de lire et d'écrire dans les répertoires « Vidéos » du dossier personnel et des supports externes.
gl: O grupo de políticas video_files permite a un aplicativo ler e escribir nos directorios de vídeos no cartafol persoal do usuario ou en soportes externos.

source: Description: Can read all video files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access video files instead.
fr: Description : peut lire tous les fichiers vidéo. Ce groupe de politique est réservé à certaines applications, telles que les applications de galerie. Les développeurs/euses devraient typiquement utiliser à la place le groupe de politique et l'API content_exchange pour accéder aux fichiers vidéo.
gl: Descrición: pode ler todos os ficheiros de vídeo. Este grupo de políticas está reservado a determinadas aplicativos, como os aplicativos de galería. Os desenvolvedores normalmente deben usar o grupo de políticas content_exchange e a API para acceder aos ficheiros de vídeo.

source: The video_files_read policy group allows an app to read the Videos directories in the user's home folder or on external media.
fr: Le groupe de politique video_files_read permet à une application de lire dans les répertoires « Vidéos » du dossier personnel et des supports externes.
gl: O grupo de políticas video_files_read permite a un aplicativo ler os directorios de vídeos no cartafol persoal do usuario ou en soportes externos.

source: webview
gl: vista web

source: Description: Can use the UbuntuWebview
fr: Description : peut utiliser UbuntuWebview
gl: Descrición: pode usar o «UbuntuWebview»

source: The webview policy group allows apps to embed a `web browser view`_.
fr: Le groupe de politique affichage Web permet aux applications d'embarquer un `affichage de navigateur Web`_.
gl: O grupo de políticas «webview» (vista web) permite aos aplicativos integrar unha `vista de navegador web`_.

source: Click package
fr: Paquet Click
gl: Paquete «click»

source: Every ``click`` application package must embed at least 3 files:
fr: Chaque paquet d'application ``click`` doit contenir au moins 3 fichiers :
gl: Cada paquete de aplicativo "clic" debe incorporar polo menos 3 ficheiros:
it: Ogni pacchetto di applicazione ``click`` deve contenere almeno 3 files:

source: ``manifest.json`` file
fr: Le fichier ``manifest.json``
gl: ficheiro ``manifest.json``
it: il file ``manifest.json``

source: Contains application declarations such as application name, description, author, framework sdk target, and version.
fr: Contient des informations sur l'application, telles que son nom, sa description, son auteur, la cible de kit de développement de logiciel (Software Development Kit ou SKD) et la version.
gl: Contén declaracións de aplicativos como o nome do aplicativo, a descrición, o autor, o marco sdk target e a versión.
it: Contiene dichiarazioni dell'applicazione quali il nome dell'applicazione, la descrizione, l'autore, l'obiettivo sdk del framework e la versione.

source: Example ``manifest.json`` file::
fr: Exemple de fichier ``manifest.json`` ::
gl: Ficheiro de exemplo "manifest.json" ::
it: Esempio di file `manifest.json`` ::

source: AppArmor profile policy file
fr: Le fichier de règles du profil d'AppArmor
gl: Ficheiro de política do perfil AppArmor
it: File della politica (policy) del profilo AppArmor

source: Contains which policy the app needs to work properly. See `Security and app isolation`_ below for more information on this file.
fr: Contient les règles dont l'application a besoin pour fonctionner correctement. Voir `Sécurité et confinement d'applications`_ ci-dessous pour plus d'informations sur ce fichier.
gl: Contén a política que o aplicativo necesita para funcionar correctamente. Vexa a continuación "Seguridade e illamento de aplicativos "_ para obter máis información sobre este ficheiro.
it: Contiene la politica di cui l'app ha bisogno per il suo corretto funzionamento. Vedi "Sicurezza e isolamento dell'app" qui sotto per ulteriori informazioni su questo file.

source: ``.desktop`` file
fr: Le fichier ``.desktop``
gl: ficheiro ``.desktop``
it: il file ``.desktop``
