Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: There are several ways to enable or disable location services in Ubuntu Touch.
fr: Il existe plusieurs façons d'activer ou de désactiver les services de localisation dans Ubuntu Touch.
gl: Hai varias formas de habilitar ou desactivar os servizos de localización en Ubuntu Touch.
it: In Ubuntu Touch esistono diversi modi per abilitare o disabilitare i servizi di localizzazione.

source: `Open location quick settings`_. Select the ``Location detection`` switch to enable or disable location services.
fr: `Ouvrez les paramètres rapides de localisation`_. Sélectionnez le commutateur ``Détection de la position`` pour activer ou désactiver les services de localisation.
gl: `Abrir configuración rápida de localización`_. Selecciona o interruptor "Detección de localización" para activar ou desactivar os servizos de localización.
it: Aprire le impostazioni rapide di localizzazione. Selezionare l'interruttore ``Rilevamento posizione`` per attivare o disattivare i servizi di localizzazione.

source: `Open location settings in the settings app`_. Under ``Let the device detect your location:``, select the appropriate option:
fr: `Ouvrez les paramètres de localisation dans l'application Paramètres du système`_. Sous ``Laissez l'appareil détecter votre position :``, sélectionnez l'option appropriée :
gl: `Abra a configuración de localización no aplicativo de configuración`_. En "Deixe que o dispositivo detecte a súa situación", seleccione a opción axeitada:
it: `Aprire le impostazioni di localizzazione nell'app Impostazioni`_. In ``Lascia che il dispositivo rilevi la tua posizione:``, selezionare l'opzione appropriata:

source: ``Using GPS`` turns on location services.
fr: ``Utiliser le GPS`` active les services de localisation.
gl: "Usar GPS" activa os servizos de localización.
it: ``Usando il GPS`` abilita i servizi di localizzazione.

source: ``Not at all`` turns off location services.
fr: ``Pas du tout`` désactive les services de localisation.
gl: "En absoluto" desactiva os servizos de localización.
it: ``No a tutto`` disabilita i servizi di localizzazione.

source: Allowing apps access to location data
fr: Autoriser les applications à accéder aux données de localisation
gl: Permitindo que os aplicativos accedan aos datos de localización
it: Consentire alle app di accedere ai dati sulla posizione

source: Ubuntu Touch allows you to allow or deny apps access to your location data. This decision is presented the first time the app tries to access your current location. You can change your decision later.
fr: Ubuntu Touch vous permet d'autoriser ou de refuser aux applications l'accès à vos données de localisation. Cette décision est présentée la première fois que l'application tente d'accéder à votre position actuelle. Vous pouvez modifier votre décision par la suite.
gl: Ubuntu Touch permítelle ou denegar o acceso dos aplicativos aos seus datos de localización. Esta decisión preséntase a primeira vez que o aplicativo intenta acceder á túa situación actual. Podes cambiar a túa decisión máis tarde.
it: Ubuntu Touch ti consente di consentire o negare alle app l'accesso ai dati sulla tua posizione. Questa decisione viene presentata la prima volta che l'app tenta di accedere alla tua posizione corrente. In seguito puoi modificare la tua decisione.

source: An app will show the location permission request the first time it tries to access your current location.
fr: Une application affichera la demande de permission de localisation la première fois qu'elle essaiera d'accéder à votre position actuelle.
gl: Un aplicativo mostrará a solicitude de permiso de localización a primeira vez que intenta acceder á súa situación actual.
it: Un'app mostrerà la richiesta di autorizzazione alla posizione la prima volta che tenta di accedere alla tua posizione corrente.

source: Select ``Allow`` to give the app access to your current location. Select ``Don't Allow`` to deny the app access to your current location. Some app features may not work correctly if you select ``Don't Allow``.
fr: Sélectionnez ``Autoriser`` pour donner à l'application l'accès à votre emplacement actuel. Sélectionnez ``Ne pas autoriser`` pour refuser à l'application l'accès à votre emplacement actuel. Certaines fonctionnalités de l'application peuvent ne pas fonctionner correctement dans ce cas de figure.
gl: Selecciona "Permitir" para darlle ao aplicativo acceso á túa situación actual. Selecciona "Non permitir" para denegar o acceso do aplicativo á túa situación actual. É posible que algunhas funcións do aplicativo non funcionen correctamente se selecciona "Non permitir".
it: Selezionare ``Allow`` per consentire all'applicazione di accedere alla posizione corrente. Selezionare ``Non consentire'' per negare all'applicazione l'accesso alla posizione corrente. Alcune funzioni dell'app potrebbero non funzionare correttamente se si seleziona ``Non consentire``.

source: Changing your permissions
fr: Modifier vos permissions
gl: Cambiando os seus permisos
it: Modifica delle tue autorizzazioni

source: You can change your decision to allow an app access to your location data. This is useful when you gave an app access to your location but you'd like to deny access, or if you denied access but would like to give access.
fr: Vous pouvez modifier votre décision pour permettre à une application d'accéder à vos données de localisation. Cela est utile lorsque vous avez donné à une application l'accès à votre localisation mais que vous souhaitez lui refuser l'accès, ou si vous avez refusé l'accès mais que vous souhaitez le donner.
gl: Podes cambiar a túa decisión de permitir que un aplicativo acceda aos teus datos de situación. Isto é útil cando lle deu acceso a un aplicativo á súa situación pero quere denegar o acceso ou se lle denegou o acceso pero quere darlle acceso.
it: Puoi modificare la tua decisione di consentire a un'app di accedere ai dati sulla tua posizione. Ciò è utile quando hai concesso a un'app l'accesso alla tua posizione, ma desideri negarlo o se hai negato l'accesso, ma desideri concederlo.

source: There are several ways to find these controls.
fr: Il y a plusieurs façons de trouver ces contrôles.
gl: Hai varios xeitos de atopar estes controis.
it: Esistono diversi modi per trovare questi controlli.

source: Location settings
fr: Paramètres de localisation
gl: Ubicación
it: Impostazioni di localizzazione

source: `Open location settings in the settings app`_. All of the apps which have requested access to your location are listed under ``Let apps access this location:``. Toggle the switch next to an app "on" to allow it to access your location data. Toggle the switch "off" to deny access.
fr: `Ouvrez les paramètres de localisation dans l'application Paramètres du système`_. Toutes les applications qui ont demandé l'accès à votre position sont listées sous ``Laisser l'application accéder à cette position :``. Faites basculer le commutateur à côté d'une application sur activé pour l'autoriser à accéder à vos données de localisation. Faites basculer le commutateur sur désactivé pour refuser cet accès.
gl: `Abra a configuración de localización no aplicativo de configuración`_. Todos os aplicativos que solicitaron acceso á túa situación aparecen en "Permitir que os aplicativos accedan a esta situación:". Cambia o interruptor xunto a un aplicativo "activada" para permitirlle acceder aos teus datos de situación. Cambia o apagado para denegar o acceso.
it: `Aprire le impostazioni di localizzazione nell'app delle impostazioni`_. Tutte le app che hanno richiesto l'accesso alla tua posizione sono elencate in ``Consentire accesso delle app all'ubicazione:``. Sposta l'interruttore accanto a un'app su "on" per consentirle di accederle ai dati sulla tua posizione. Sposta l'interruttore su "off" per negare l'accesso.

source: App permission settings
fr: Paramètres de permissions des applications
gl: Parámetros de permisos dos aplicativos
it: Impostazioni di autorizzazione dell'app

source: Launch the ``System Settings`` app. Select ``Security & Privacy``, then select ``App permissions``, followed by ``Location``. All of the apps which have requested access to your location are listed. Toggle the switch next to an app "on" to allow it to access your location data. Toggle the switch "off" to deny access.
fr: Lancez l'application ``Paramètres du système``. Sélectionnez ``Sécurité & Vie privée``, puis sélectionnez ``Permissions des applications``, suivi de ``Localisation``. Toutes les applications qui ont demandé l'accès à votre position sont listées. Faites basculer le commutateur à côté d'une application sur activé pour l'autoriser à accéder à vos données de localisation. Faites basculer le commutateur sur désactivé pour refuser l'accès.
gl: Inicia o aplicativo "Configuración do sistema". Selecciona "Seguridade e privacidade" e logo selecciona "Permisos da aplicación", seguido de "Localización". Enuméranse todos os aplicativos que solicitaron acceso á túa situación. Cambia o interruptor xunto a un aplicativo "activada" para permitirlle acceder aos teus datos de situación. Cambia o apagado para denegar o acceso.
it: Avvia l'app ``Impostazioni di sistema``. Seleziona ``Sicurezza e privacy``, quindi seleziona ``Permessi delle app``e poi ``Posizione ``. Vengono elencate tutte le app che hanno richiesto l'accesso alla tua posizione. Sposta l'interruttore accanto a un'app su "on" per consentirle di accedere ai dati sulla tua posizione. Sposta l'interruttore su "off" per negare l'accesso.

source: Using apps with location services
fr: Utilisation d'applications avec des services de localisation
gl: Utilizando os aplicativos cos servizos de localización
it: Utilizzo di app con servizi di localizzazione

source: Apps will be able to access your current location after they are granted access to location data. However, there are some things to note while using apps with location services.
fr: Les applications pourront accéder à votre position actuelle une fois qu'elles auront obtenu l'accès aux données de localisation. Cependant, il y a certaines choses à noter lors de l'utilisation d'applications avec des services de localisation.
gl: Os aplicativos poderán acceder á túa situación actual despois de que lles concedan acceso aos datos de situación. Non obstante, hai algunhas cousas que hai que ter en conta ao usar aplicativos con servizos de localización.
it: Le app potranno accedere alla tua posizione corrente dopo aver ottenuto l'accesso ai dati sulla posizione. Tuttavia, ci sono alcune cose da considerare durante l'utilizzo di app con servizi di localizzazione.

source: Time to first fix
fr: Temps de première acquisition
gl: Tempo para a primeira solución
it: Tempo per la prima correzione

source: A "fix" is a data point generated by GPS hardware that contains its current location and the expected accuracy of that location. GPS hardware is rated by how long it takes to return one of these data points after the device is activated. This rating is called "`Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_," or TTFF.
fr: Une « acquisition » est une donnée générée par le matériel du GPS, qui contient sa position actuelle et la précision attendue de cette localisation. Le matériel du GPS est évalué en fonction du temps nécessaire pour renvoyer l'une de ces données après l'activation du dispositif. Cette note est appelée « `Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_," ou TTFF.
gl: Unha "corrección" é un punto de datos xerado polo hardware GPS que contén a súa situación actual e a precisión esperada desa situación. O hardware GPS clasifícase polo tempo que tarda en devolver un destes puntos de datos despois de activar o dispositivo. Esta clasificación chámase "` Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix> `_" ou TTFF.
it: Un "fix" è un punto di dati generato dall'hardware GPS che contiene la sua posizione attuale e la precisione prevista di tale posizione. L'hardware GPS viene valutato in base al tempo necessario per restituire uno di questi punti di dati dopo l'attivazione del dispositivo. Questa valutazione è chiamata "Tempo per il primo fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_", o TTFF.

source: A device with a mobile data connection should take one to four minutes to receive its first fix. If location services have not been used for a long time *and* the device does not have a mobile data connection, the first fix can take up to an hour. To prevent this from causing problems for you, follow these instructions:
fr: Un appareil doté d'une connexion de données mobile devrait mettre entre une et quatre minutes pour recevoir sa première position. Si les services de localisation n'ont pas été utilisés depuis longtemps *et* que l'appareil ne dispose pas d'une connexion mobile de données, la première localisation peut prendre jusqu'à une heure. Pour éviter que cela ne vous cause des problèmes, suivez ces instructions :
gl: Un dispositivo cunha conexión de datos móbiles debería tardar dun a catro minutos en recibir a súa primeira corrección. Se os servizos de localización non se usan durante moito tempo * e * o dispositivo non ten conexión de datos móbiles, a primeira solución pode levar ata unha hora. Para evitar que isto lle cause problemas, siga estas instrucións:
it: Un dispositivo con una connessione dati mobile dovrebbe impiegare da uno a quattro minuti per ricevere la prima correzione. Se i servizi di localizzazione non sono stati utilizzati per molto tempo *e* il dispositivo non dispone di una connessione dati mobile, la prima correzione può richiedere fino a un'ora. Per evitare che ciò causi problemi, seguite queste istruzioni:

source: Do not leave your device in direct sunlight. The heat can damage the device.
fr: Ne laissez pas votre appareil à la lumière directe du soleil. La chaleur peut endommager l'appareil.
gl: Non deixe o dispositivo á luz solar directa. A calor pode danar o dispositivo.
it: Non esporre il tuo dispositivo alla luce solare diretta. Il calore può danneggiare il dispositivo.

source: Disable ``Lock when idle`` in the Battery settings
fr: Désactivez ``Verrouiller en cas d'inactivité`` dans les paramètres de la batterie
gl: Desactiva "Bloquear cando está inactivo" na configuración da batería
it: Disabilita ``Sospendi quando inattivo`` nelle impostanzioni Batteria

source: Download an app which uses location services and cause it to start accessing your location data.
fr: Téléchargez une application qui utilise des services de localisation et faites en sorte qu'elle commence à accéder à vos données de localisation.
gl: Descarga un aplicativo que utiliza servizos de localización e fai que comece a acceder aos teus datos de situación.
it: Scaricate un'applicazione che utilizza i servizi di localizzazione e fate in modo che inizi ad accedere ai vostri dati di localizzazione.

source: Leave your device near a window but out of direct sunlight. To reduce energy consumption, turn the screen brightness down.
fr: Laissez votre appareil près d'une fenêtre, mais à l'abri de la lumière directe du soleil. Pour réduire la consommation d'énergie, baissez la luminosité de l'écran.
gl: Deixe o dispositivo preto dunha xanela pero fóra da luz solar directa. Para reducir o consumo de enerxía, baixe o brillo da pantalla.
it: Lasciare il dispositivo vicino a una finestra, ma lontano dalla luce diretta del sole. Per ridurre il consumo energetico, abbassare la luminosità dello schermo.

source: After 20 minutes to an hour, your device should display your current location. You can now close the app and enable ``Lock when idle``. Future attempts to aquire your location should now take one to four minutes.
fr: Au bout de 20 minutes à une heure, votre appareil devrait afficher votre position actuelle. Vous pouvez maintenant fermer l'application et activer la fonction ``Verrouiller en cas d'inactivité``. Les futures tentatives d'acquisition de votre position devraient maintenant prendre entre une et quatre minutes.
gl: Despois de 20 minutos a unha hora, o dispositivo debería amosar a súa situación actual. Agora podes pechar o aplicativo e activar "Bloquear cando está inactivo". Os futuros intentos de adquirir a túa situación deberían tardar dun a catro minutos.
it: Dopo 20 minuti o un'ora, il dispositivo dovrebbe visualizzare la posizione corrente. A questo punto è possibile chiudere l'applicazione e attivare il ``blocco in caso di inattività``. I futuri tentativi di acquisizione della posizione dovrebbero durare da uno a quattro minuti.

source: App suspension
fr: Suspension de l'application
gl: Suspensión do aplicativo
it: Sospensione dell'app

source: Apps are suspended whenever they are not in the foreground or the device is locked. When an app is suspended, it cannot receive location data. For this reason, apps will not be able to track your location whenever they are not in use or the device is locked.
fr: Les applications sont suspendues lorsqu'elles ne sont pas au premier plan ou que l'appareil est verrouillé. Lorsqu'une application est suspendue, elle ne peut pas recevoir de données de localisation. Pour cette raison, les applications ne pourront pas suivre votre position lorsqu'elles ne sont pas utilisées ou que l'appareil est verrouillé.
gl: As aplicacións suspéndense sempre que non están en primeiro plano ou o dispositivo está bloqueado. Cando se suspende un aplicativo, non pode recibir datos de localización. Por este motivo, os aplicativos non poderán rastrexar a túa situación sempre que non estean en uso ou o dispositivo estea bloqueado.
it: Le app vengono sospese quando non sono in primo piano o il dispositivo è bloccato. Quando un'app è sospesa, non può ricevere dati sulla posizione. Per questo motivo, le app non saranno in grado di tracciare la posizione dell'utente quando non sono in uso o il dispositivo è bloccato.

source: Install Ubuntu Touch
fr: Installer Ubuntu Touch
gl: Instalar Ubuntu Touch
it: Installare Ubuntu Touch

source: Installing Ubuntu Touch is easy, and a lot of work has gone in to making the installation process less intimidating to the average user. The UBports Installer is a nice graphical tool that you can use to install Ubuntu Touch on a `supported device <https://devices.ubuntu-touch.io/>`_ from your `Linux <https://snapcraft.io/ubports-installer>`_, `Mac <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ or `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_ computer. For more experienced users, we also have manual installation instructions for every device `on the devices page <https://devices.ubuntu-touch.io/>`_.
fr: Installer Ubuntu Touch est facile, de gros efforts ont été faits pour rendre le processus d'installation moins intimidant pour les utilisateurs et les utilisatrices les moins techniques. L'installateur d'UBports est un bel outil graphique qui permet d'installer Ubuntu Touch sur un `appareil compatible <https://devices.ubuntu-touch.io/>`_ à partir de votre ordinateur Linux <https://snapcraft.io/ubports-installer>`_, `Mac <https://devices.ubuntu-touch.io/installer/?package=dmg>` ou `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`. Pour les personnes plus expérimentées, nous avons également des instructions d'installation manuelle pour chaque appareil `sur la page des appareils <https://devices.ubuntu-touch.io/>`_.
gl: Instalar Ubuntu Touch é sinxelo e dedicouse moito traballo a facer o proceso de instalación menos intimidante para o usuario medio. O Instalador de UBports é unha boa ferramenta gráfica que pode empregar para instalar Ubuntu Touch nun `dispositivo compatible <https://devices.ubuntu-touch.io/>` _ desde o seu `Linux <https://snapcraft.io/ ubports-installer> `_,` Mac <https://devices.ubuntu-touch.io/installer/?package=dmg> `_ o` Windows <https://devices.ubuntu-touch.io/installer/? package = exe> `_ ordenador. Para usuarios máis experimentados, tamén temos instrucións de instalación manual para todos os dispositivos `na páxina de dispositivos <https://devices.ubuntu-touch.io/>` _.
it: Installare Ubuntu Touch è facile e molto lavoro è stato fatto per rendere il processo d'installazione meno intimidatorio per l'utente medio. UBports Installer è un gradevole strumento grafico che puoi usare con il tuo computer `Linux <https://snapcraft.io/ubports-installer>`_, `Mac <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ o `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_ per installare Ubuntu Touch su un `dispositivo supportato <devices.ubports.com>` _. Per gli utenti più esperti, abbiamo anche istruzioni d'installazione manuale per ogni dispositivo `nella pagina dei dispositivi <https://devices.ubuntu-touch.io/>`_.

source: If you're switching your device over from Android, you will not be able to keep any data that is currently on the device. Create an external backup if you want to keep it.
fr: Si vous passez d'Android à Ubuntu Touch sur votre appareil, vous perdrez toutes les données qui sont actuellement sur cet appareil. Si vous voulez conserver ces données, créez une sauvegarde sur un support externe.
gl: Se cambias o dispositivo de Android, non poderás gardar ningún dato que estea actualmente no dispositivo. Crea unha copia de seguridade externa se queres conservala.
it: Se stai passando da un dispositivo con Android, non sarai in grado di conservare tutti i dati attualmente su di esso. Crea un backup esterno se desideri mantenerli.

source: You can `Download the UBports Installer from GitHub <https://github.com/ubports/ubports-installer/releases/latest>`_. The following packages are available:
fr: Vous pouvez `télécharger l'installeur d'UBports à partir de GitHub <https://github.com/ubports/ubports-installer/releases/latest>`_. Les paquets suivants sont disponibles :
gl: Podes `descargar o instalador de UBports desde GitHub <https://github.com/ubports/ubports-installer/releases/latest>` _. Os seguintes paquetes están dispoñibles:
it: È possibile `Scaricare UBports Installer da GitHub <https://github.com/ubports/ubports-installer/releases/latest>`_. Sono disponibili i suguenti pacchetti:

source: `Ubuntu or Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<version-number>.deb``
fr: `Ubuntu ou Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_ : ``ubports-installer-<numero-de-version>.deb``
gl: `Ubuntu ou Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<version-number>.deb``
it: `Ubuntu o Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<numero-versione>.deb``

source: `Other Linux distributions (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<version-number>.snap``
fr: `Autres distributions Linux (snap) <https://snapcraft.io/ubports-installer>`_ : ``ubports-installer-<numero-de-version>.snap``
gl: `Outras distribucións de Linux (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<version-number>.snap``
it: `Altre distribuzioni Linux (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<numero-versione>.snap``

source: `Other Linux distributions (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<version-number>.AppImage``
fr: `Autres distributions Linux (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_ : ``ubports-installer-<numero-de-version>.AppImage``
gl: `Outras distribucións de Linux (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<version-number>.AppImage``
it: `Altre distribuzioni Linux (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<numero-versione>.AppImage``
