Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Most web-devs will probably want do most of their coding and debugging in the usual browser environment. The Ubuntu Touch browser is compliant with modern web standards, and most webapps will just work without further changes.
fr: La plupart des développeurs d'applications web voudront probablement faire la plus grande partie de leur codage et débogage dans l'environnement habituel du navigateur. Le navigateur Ubuntu Touch est conforme aux standards modernes du web, et la plupart des applications web fonctionneront sans autre changement.
gl: A maioría dos web-devers probablemente quererán facer a maior parte da súa codificación e depuración no ambiente habitual do navegador. O navegador de Ubuntu Touch cumpre cos estándares web modernos e a maioría das webapps só funcionarán sen máis cambios.
it: La maggior parte degli sviluppatori web sviluppa il codice ed esegue il debug con i browser più utilizzati. Il browser di Ubuntu Touch è conforme con gli standard più moderni, molte webapp funzioneranno senza ulteriori modifiche.

source: For those (hopefully) rare cases where further debugging is needed, there are two ways to gain further information on the failure.
fr: Pour les rares cas (espérons-le) où un débogage plus poussé est nécessaire, il y a deux façons d'obtenir plus d'informations sur l'échec.
gl: Para aqueles casos (con sorte) raros nos que se precisa máis depuración, hai dúas formas de obter máis información sobre o fallo.
it: Per quei (speriamo) rari casi in cui è richiesto un debugging più approfondito, esistono due modi per ottenere ulteriori informazioni sul malfunzionamento.

source: Watch the logs
fr: Surveiller les journaux
gl: Inspeccionar os rexistros
it: Guardare i file di log

source: If you are comfortable in a CLI environment, most Javascript errors will leave an entry in the app log file::
fr: Si vous êtes à l'aise dans un environnement du type interface en ligne de commande, la plupart des erreurs Javascript laisseront une entrée dans le fichier journal de l'application :
gl: Se estás cómodo nun ambiente CLI, a maioría dos erros Javascript deixarán unha entrada no ficheiro de rexistro do aplicativo:
it: Se sei abituato ad usare la riga di comando, nel file di log della app troverai molti errori Javascript::

source: Debugging in the browser
fr: Débogage dans le navigateur
gl: Depuración no navegador
it: Esegui il debug nel browser

source: The default Ubuntu Touch browser is based on the Blink technology that is also used in Chrome/Chromium. By starting the browser in a special mode, you have access to the regular Chrome-style debugger.
fr: Le navigateur par défaut d'Ubuntu Touch est basé sur la technologie Blink qui est également utilisée dans Chrome/Chromium. En démarrant le navigateur dans un mode spécial, vous avez accès au débogueur de type Chrome.
gl: O navegador Ubuntu Touch predeterminado está baseado na tecnoloxía Blink que tamén se usa en Chrome/Chromium. Ao iniciar o navegador nun modo especial, terás acceso ao depurador normal ao estilo Chrome.
it: Il browser di default di Ubuntu Touch è basato sulla tecnologia Blink che è anche utilizzata dai browser Chrome/Chromium. Avviando il browser in una modalità speciale, avrai accesso al debug in stile Chrome.

source: On your phone, start the browser in inspector mode:::
fr: Sur votre téléphone, démarrez le navigateur en mode inspecteur :
gl: No teu teléfono, inicie o navegador en modo inspector:::
it: Sul tuo smartphone, avvia il browser in modalità inspector:::

source: Now on your computer, launch Chrome/Chromium browser, and point address to ``http://YOUR_UT_IP_ADDRESS:9221``
fr: Maintenant, sur votre ordinateur, lancez le navigateur Chrome/Chromium et saisissez l'adresse ``http://ADRESSE_IP_DE_VOTRE_UT:9221``
gl: Agora no teu ordenador, inicie o navegador Chrome/Chromium e diríxete ao enderezo "http: // YOUR_UT_IP_ADDRESS: 9221"
it: Ora sul tuo computer, lancia il browser Chrome/Chromium, e punta all'indirizzo ``http://YOUR_UT_IP_ADDRESS:9221``

source: Bug reporting
fr: Remonter un problème
gl: Información de erros
it: Segnalazione dei bug

source: This page contains information to help you help us by reporting an actionable bug for Ubuntu Touch. It does NOT contain information on reporting bugs in apps, most of the time their entry in the OpenStore will specify where and how to do that.
fr: Cette page contient des informations pour vous aider à nous aider en signalant un problème sur Ubuntu Touch. Il ne contient PAS d'informations sur le signalement des problèmes pour les applications, la plupart du temps leur description dans l'OpenStore indiquera où et comment le faire.
gl: Esta páxina contén información para axudarnos a informar dun error aplicable a Ubuntu Touch. NON contén información sobre a notificación de erros en aplicativos, a maioría das veces a súa entrada en OpenStore especificará onde e como facelo.
it: Questa pagina contiene le informazioni per aiutarti ad aiutarci segnalando un bug riproducibile di Ubuntu Touch. Non contiene informazioni per la segnalazione di bug delle applicazioni, il più delle volte nella loro pagina sull'Open Store è specificato dove e come farlo.

source: Get the latest Ubuntu Touch
fr: Obtenir la dernière version d'Ubuntu Touch
gl: Obteña o último Ubuntu Touch
it: Ottieni l'ultima versione di Ubuntu Touch

source: This might seem obvious, but it's easy to miss. Go to (Settings - Updates) and make sure that your device doesn't have any Ubuntu updates available. If not, continue through this guide. If so, update your device and try to reproduce the bug. If it still occurs, continue through this guide. If not, do a little dance! The bug has already been fixed and you can continue using Ubuntu Touch.
fr: Cela peut sembler évident, mais vous pouvez facilement passer à côté. Allez dans (Paramètres - Mises à jour) et vérifiez si votre appareil affiche des mises à jour pour Ubuntu. Si ce n'est pas le cas, continuez à parcourir ce guide. Si c'est le cas, mettez à jour votre appareil et essayez de reproduire le problème. Si cela se produit encore, continuez à parcourir ce guide. Sinon, réjouissez-vous ! Le problème a déjà été corrigé et vous pouvez continuer à utiliser Ubuntu Touch.
gl: Isto podería parecer obvio pero é fácil pasalo por alto. Vaia a (Configuración - Actualizacións) e asegúrese de que o seu dispositivo no ten ningunha actualización de Ubuntu dispoñible. Se non, continúe a través de esta guía. Si es así, actualice su dispositivo e intente reproducir el error. Si aún ocorre, continúe a través desta guía. Se non, faga un baileciño! O erro xa se solucionou e pode continuar usando Ubuntu Touch.
it: Questo potrebbe sembrare ovvio, ma non è sempre facile. Vai a (Impostazioni - Aggiornamenti) e assicurati che il tuo dispositivo non abbia aggiornamenti disponibili su Ubuntu. In caso contrario, continua attraverso questa guida. In tal caso, aggiorna il dispositivo e prova a riprodurre il bug. Se si verifica ancora, continua attraverso questa guida. Se no, fai un po 'di danza! Il bug è già stato risolto e puoi continuare a utilizzare Ubuntu Touch.

source: Check if the bug is already reported
fr: Vérifier si le problème a déjà été rapporté
gl: COmprobar se xa se informou do erro
it: Controlla se il bug è già segnalato

source: Open up the bug tracker for `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
fr: Ouvrez la page de suivi des problèmes sur `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
gl: Abrao seguidor de erros para `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
it: Aprire il bug tracker di `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.

source: Pinephone users should check for and report bugs `here <https://gitlab.com/ubports/community-ports/pinephone>`_
fr: Les utilisateurs/trices de Pinephone doivent rechercher et signaler les problèmes `ici <https://gitlab.com/ubports/community-ports/pinephone>`_
gl: Os usuarios de Pinephone deben comprobar por e informar sobre erros `aquí <https://gitlab.com/ubports/community-ports/pinephone>`_
it: Gli utenti di Pinephone dovrebbero verificare e segnalare i bug `qui <https://gitlab.com/ubports/community-ports/pinephone>`_

source: First, you'll need to make sure that the bug you're trying to report hasn't been reported before. Search through the bugs reported. When searching, use a few words that describe what you're seeing. For example, "Lock screen transparent" or "Lock screen shows activities".
fr: Tout d'abord, vous devez vous assurez que le problème que vous essayez de faire remonter n'a pas déjà été signalé. Cherchez dans la liste des problèmes rapportés. Lors de la recherche, utilisez quelques mots en anglais qui décrivent ce que vous voyez. Par exemple, « Lock screen transparent » (Écran d'accueil transparent) ou « Lock screen shows activities » (L'écran de verrouillage affiche des activités).
gl: En primeiro lugar, terás que asegurarte de que o erro que estás intentando informar non se informou antes. Busca a través dos erros notificados. Cando busque, use algunhas palabras que describan o que está a ver. Por exemplo, "Bloquear pantalla transparente" ou "Bloquear pantalla mostrando actividades".
it: Primo, accertati che il baco che stai tentando di segnalare non sia già stato segnalato. Cerca tra i bug segnalati. Durante la ricerca, usa delle parole che descrivano cosa stai vedendo. Per esempio, "Schermata di blocco trasparente" ("Lock screen transparent") oppure "Schermata di blocco mostra attività" ("Lock screen shows activities").

source: If you find that a bug report already exists, select the "Add your Reaction" button (it looks like a smiley face) and select the +1 (thumbs up) reaction. This shows that you are also experiencing the bug.
fr: Si vous constatez qu'un rapport existe déjà sur le sujet, cliquez sur le bouton « Ajouter votre réaction » (il ressemble à un visage qui sourit) et sélectionnez la réaction +1 (pouce vers le haut). Cela montre que vous rencontrez également ce problème.
gl: Se atopas que xa existe un informe de erros, selecciona o botón "Engade a túa reacción" (parece unha cara sorrinte) e selecciona a reacción +1 (polgar cara arriba). Isto demostra que tamén está experimentando o erro.
it: Se vedi che già c'è una segnalazione, seleziona il bottone "Add your Reaction" (sembra uno smile) e seleziona la reaction +1 (il pollice in su). Questo mostra che anche tu hai riscontrato il bug.

source: If the report is missing any of the information specified later in this document, please add it yourself to help the developers fix the bug.
fr: Si le rapport ne contient pas certaines des informations spécifiées plus loin dans ce document, veuillez les ajouter vous-même pour aider les développeurs à corriger le problème.
gl: Se falta no informe algunha información especificada máis adiante neste documento, engádao vostede mesmo para axudar aos desenvolvedores a solucionar o erro.
it: Se nel report mancano alcune delle informazioni specificate di seguito in questo documento, aggungile per aiutare gli sviluppatori a risolvere il problema.

source: Reproduce the issue you've found
fr: Reproduire le problème que vous avez trouvé
gl: Reproducir o problema que atopaches
it: Riprodurre il problema che si è trovato

source: Next, find out exactly how to recreate the bug that you've found. Document the exact steps that you took to find the problem in detail. Then, reboot your phone and perform those steps again. If the problem still occurs, continue on to the next step. `If not... <https://youtu.be/nn2FB1P_Mn8?t=10s>`_
fr: Ensuite, déterminez comment reproduire le problème que vous avez trouvé. Documentez en détail les étapes exactes que vous avez suivies pour trouver le problème. Puis redémarrez votre appareil et réitérez ces étapes. Si le problème persiste, passez à l'étape suivante. `Sinon... <https://youtu.be/nn2FB1P_Mn8?t=10s>`_
gl: A continuación, descubre exactamente como recrear o erro que atopou. Documente os pasos exactos que tomaches para atopar o problema en detalle. A continuación, reinicie o teléfono e realice eses pasos de novo. Se aínda se produce o problema, continúe co seguinte paso. `Se non ... <https://youtu.be/nn2FB1P_Mn8?t=10s>` _
it: Successivamente, trova il modo esatto per riprodurre il bug trovato. Documenta dettagliatamente ogni passo che hai fatto per arrivare al problema. Quindi riavvia il telefono e ripeti questi passi di nuovo. Se il problema si ripresenta, passa al prossimo punto. `Altrimenti... <https://youtu.be/nn2FB1P_Mn8?t=10s>`_

source: Making the bug report
fr: Générer le rapport du problème
gl: Preparación do informe do erro
it: Fare la segnalazione del bug

source: Now it's time for what you've been waiting for, the bug report itself! Bug reports need to be filed in English.
fr: Le moment que vous attendiez tant est désormais arrivé, le signalement du problème en lui-même ! Les rapports de problèmes doivent être écrits en Anglais.
gl: Agora é o momento para o que estivo esperando, o informe de erro en sí! Os informes de erro tienen que presentarse en inglés.
it: Ora è il momento che stavi aspettanto, la segnalazione del problema! Tale segnalazione deve essere fatta in inglese.

source: First, pull up the `bug tracker <https://github.com/ubports/ubuntu-touch>`_ and click "New Issue". Log in to GitHub if you haven't yet.
fr: Tout d'abord, allez dans la `liste de suivi des problèmes <https://github.com/ubports/ubuntu-touch>`_ et cliquez sur « Nouveau problème ». Connectez-vous à GitHub si ce n'est pas déjà le cas.
gl: Primeiro, levante o `tracker de erros <https://github.com/ubports/ubuntu-touch>` _ e prema en "Novo número". Inicie sesión en GitHub se aínda non o fixeches.
it: Per prima cosa apri il `bug tracker <https://github.com/ubports/ubuntu-touch>`_ e clicca su "New Issue". Entra su GitHub se ancora non lo hai fatto.

source: Next, you'll need to name your bug. Pick a name that says what's happening, but don't be too wordy. Four to eight words should be enough.
fr: Puis, donnez un nom à votre problème. Choisissez un nom qui décrit ce qui se passe, mais restez succinct. Quatre à huit mots devraient suffire.
gl: A continuación, terás que nomear o teu erro. Escolle un nome que diga o que está a suceder, pero non sexas demasiado palabra. De catro a oito palabras deberían ser suficientes.
it: Poi hai bisogno di dare un nome al tuo bug. Scegli un nome che spiega cosa succede ma che sia conciso. Dovrebbero bastare dalle 4 alle 8 parole.

source: Now, write your bug report. A good bug report includes the following:
fr: Écrivez désormais votre rapport de problème. Un bon rapport contient les informations suivantes :
gl: Agora, escribe o teu informe de erros. Un bo informe de erros inclúe o seguinte:
it: Adesso scrivi la tua segnalazione. Una buona segnalazione contiene:

source: What happened: A synopsis of the erroneous behavior
fr: Ce qui s'est passé : un résumé du comportement incorrect
gl: Que pasou: unha sinopse do comportamento erróneo
it: Cosa sta succedendo: Un riassunto del comportamento errato

source: What I expected to happen: A synopsis of what should have happened, if there wasn't an error
fr: Ce à quoi je m'attendais : un résumé de ce qui aurait dû se passer si aucune erreur ne s'était produite
gl: O que esperaba que acontecese: unha sinopse do que debería ter ocorrido, se non houbo un erro
it: Cosa mi aspetto che succeda: Un riassunto di cosa dovrebbe accadere se non ci forrero errori

source: Steps to reproduce: You wrote these down earlier, right?
fr: Les étapes pour reproduire le problème : vous avez noté cela un peu plus tôt, non ?
gl: Pasos para reproducir: escribiches isto antes, non?
it: Passi per riprodurlo: Li avevi scritti prima giuso?

source: Software Version: Go to (Settings - About) and list what appears on the "OS" line of this screen. Also include the release channel that you used when you installed Ubuntu on this phone.
fr: La version du logiciel : allez dans (Paramètres - À propos) et listez ce qui apparaît dans la ligne « Système d'exploitation » de cet écran ; incluez également le canal de distribution que vous avez utilisé lorsque vous avez installé Ubuntu sur cet appareil.
gl: Versión do software: vai a (Configuración - Sobre) e lista o que aparece na liña "SO" desta pantalla. Inclúe tamén a canle de lanzamento que utilizaches cando instalaches Ubuntu neste teléfono.
it: Versione software: vai a (Impostazioni - Informazioni) ed elenca ciò che appare sulla riga "OS" di questa schermata. Includere anche il canale di rilascio che hai usato quando hai installato Ubuntu su questo telefono.

source: Once you're finished with that, post the report. You can't add labels yourself, so please don't forget to state the device you're experiencing the issue on in the description so a moderator can easily add the correct tags later.
fr: Une fois que vous avez terminé cela, postez le problème. Vous ne pouvez pas ajouter vous-même de mots-clés, veillez donc à mentionner le nom de l'appareil sur lequel vous rencontrez le problème dans la description de manière à ce qu'un/e modérateur/trice puisse facilement ajouter le bon mot-clé plus tard.
gl: Unha vez rematado, publique o informe. Non podes engadir etiquetas por ti mesmo, polo que non esquezas indicar o dispositivo no que estás experimentando o problema na descrición para que un moderador poida engadir facilmente as etiquetas correctas máis tarde.
it: Una volta terminato, posta l'errore. Non puoi aggiungere etichette tu stesso, quindi ti preghiamo di non dimenticare di indicare nella descrizione il dispositivo su cui stai riscontrando il problema, in modo che un moderatore possa in seguito facilmente aggiungere i tag corretti.

source: A developer or QA-team member will confirm and triage your bug, then work can begin on it. If you are missing any information, you will be asked for it, so make sure to check in often!
fr: Un développeur ou un membre de l'équipe qualité confirmera et effectuera un tri avec votre problème. S'il manque des informations, celles-ci vous seront demandées, vérifiez donc régulièrement !
gl: Un desenvolvedor ou un membro do equipo de control de calidade confirmará e seleccionará o seu erro e entón poderá comezar a traballar nel. Se falta algunha información, solicitaráselle, así que asegúrese de rexistrarse a miúdo!
it: Uno sviluppatore o un membro del team QA confermerà e tratterà il bug, quindi il lavoro può iniziare. Se ti manca qualche informazione, ti verrà richiesta e assicurati quindi di fare spesso il controllo!

source: Getting Logs
fr: Obtenir les journaux d'évènement
gl: Obtención dos rexistros
it: Prendere i Log

source: Here we'll discuss the general steps to get logs, files that contain important debugging messages, on Ubuntu Touch. You may be asked for logs after submitting your issue. This section will help you to retrieve these logs from the device.
fr: Ici, nous allons discuter des étapes générales pour obtenir des journaux (des fichiers qui contiennent des messages de débogage importants) sur Ubuntu Touch. Il se peut que l'on vous demande des journaux après avoir soumis votre problème. Cette section vous aidera à récupérer ces journaux sur l'appareil.
gl: Aquí discutiremos os pasos xerais para obter rexistros, ficheiros que conteñan mensaxes importantes de depuración, en Ubuntu Touch. Pódeselle solicitar rexistros despois de enviar o seu problema. Esta sección axudaralle a recuperar estes rexistros do dispositivo.
it: Qui discuteremo i passi generali per ottenere i log, file che contengono importanti messaggi di debug, su Ubuntu Touch. È possibile che vi vengano richiesti i log dopo aver inviato il vostro problema. Questa sezione vi aiuterà a recuperare i log dal dispositivo.

source: Log files may contain information you prefer to keep private. Please be sure to skim through them to ensure this is not the case before posting them. We can coordinate to get them through e-mail or a similarly less public medium.
fr: Les fichiers journaux peuvent contenir des informations que vous préférez garder privées. Parcourez-les pour vous assurer que ce n'est pas le cas avant de les afficher. Nous pouvons nous coordonner pour les obtenir par courrier électronique ou par un autre moyen moins public.
gl: Os ficheiros de rexistro poden conter información que prefiren manter privada. Asegúrese de revisalos para asegurarse de que non é así antes de publicalos. Podemos coordinar para obtelos a través do correo electrónico ou dun medio semellante menos público.
it: I file di registro possono contenere informazioni che si preferisce mantenere private. Assicuratevi di scorrerli per assicurarvi che non sia questo il caso prima di pubblicarli. Possiamo coordinarci per ottenerli tramite e-mail o un mezzo simile meno pubblico.

source: To get ready, download the `Logviewer app <https://open-store.io/app/logviewer.neothethird>`_ from the OpenStore. This app will help us find, view, and send the logs we need.
fr: Pour vous préparer, téléchargez l'application « Visionneuse de journaux » (Logviewer) <https://open-store.io/app/logviewer.neothethird>`_ sur l'OpenStore. Cette application nous aidera à trouver, visualiser et envoyer les journaux dont nous avons besoin.
gl: Para prepararse, descargue o aplicativo `Logviewer <https://open-store.io/app/logviewer.neothethird>` _ desde o OpenStore. Este aplicativo axudaranos a atopar, ver e enviar os rexistros que precisamos.
it: Per prepararsi, scaricare l'applicazione `Logviewer <https://open-store.io/app/logviewer.neothethird>`_ dall'OpenStore. Questa applicazione ci aiuterà a trovare, visualizzare e inviare i log di cui abbiamo bisogno.

source: Now, open the Logviewer app. You'll see a list of all of the log files available in your user log folder, ``/home/phablet/.cache/upstart/``. This folder contains many, but not all, of the logs for software running on your device. You can tap on any log to view it, then tap the "send" icon in the top right corner to share it using an online service.
fr: Maintenant, ouvrez l'application Visionneuse de journaux. Vous verrez une liste de tous les fichiers disponibles dans votre dossier de journaux, /home/phablet/.cache/upstart/``. Ce dossier contient un grand nombre, mais pas la totalité, des journaux des logiciels exécutés sur votre appareil. Vous pouvez cliquer sur n'importe quel journal pour le consulter, puis sur l'icône « Envoyer » en haut à droite pour le partager à l'aide d'un service en ligne.
gl: Agora abre o aplicativo Logviewer. Verás unha lista de todos os ficheiros de rexistro dispoñibles no cartafol de rexistro de usuario, "/ home / phablet / .cache / upstart /". Este cartafol contén moitos, pero non todos, os rexistros do software que se executa no seu dispositivo. Podes tocar calquera rexistro para velo e logo tocar a icona "enviar" na esquina superior dereita para compartilo cun servizo en liña.
it: Ora, aprire l'applicazione Logviewer. Verrà visualizzato un elenco di tutti i file di registro disponibili nella cartella di registro dell'utente, ``/home/phablet/.cache/upstart/``. Questa cartella contiene molti, ma non tutti, i registri del software in esecuzione sul dispositivo. È possibile toccare qualsiasi registro per visualizzarlo, quindi toccare l'icona "invia" nell'angolo in alto a destra per condividerlo tramite un servizio online.
