Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Whether to show in notification centre; defaults to false.
fr: Si on veut l'afficher dans le centre de notification; la valeur par défaut est false.
gl: Se é amosada no centro de notificacións; por omisión é falso.
it: Se mostrare in centro di notifica; default a falso.

source: popup
gl: elemento emerxente

source: Whether to show in a bubble. Users can disable this, and can
fr: Si on veut montrer la notification dans une bulle. Les utilisateurs peuvent le désactiver,
gl: Se é amosada nunha burbulla. Os usuarios poden desactivar isto e poden
it: Che si mostri in una bolla. Gli utenti possono disattivare questo, e possono

source: easily miss them, so don't rely on it exclusively. Defaults
fr: et peuvent aisément la manquer, donc ne pas compter exclusivement dessus.
gl: bótaos de menos facilmente, así que non confíes nel exclusivamente. Valores predeterminados
it: facilmente perdere, quindi non fare affidamento su di esso esclusivamente. Predefiniti

source: to false.
fr: Prend la valeur false par défaut.
gl: para falso.
it: a false.

source: Vibrate
fr: Vibration
gl: Vibrar
it: Vibrazione

source: pattern
gl: patrón

source: A list of integers describing a vibration pattern (duration of alternating
fr: Une liste d'entiers décrivant un motif de vibration (alternances de périodes
gl: Unha lista de números enteiros que describen un patrón de vibración (duración da alternancia
it: Un elenco di interi che descrive un modello di vibrazione (durata dell'alternanza

source: vibration/no vibration times, in milliseconds).
fr: avec/sans vibration, en millisecondes).
gl: tempos de vibración / sen vibración, en milisegundos).
it: tempi di vibrazione/senza vibrazioni, in millisecondi).

source: repeat
gl: repetir
it: ripeti

source: Number of times the pattern has to be repeated (defaults to 1, 0 is the
fr: Nombre de répétition du motif (1 est la valeur par défaut, 0 est considéré
gl: Número de veces que se debe repetir o patrón (por defecto 1, 0 é o
it: Numero di volte che il modello deve essere ripetuto (default a 1, 0 è il

source: same as 1).
fr: de la même façon que 1).
gl: igual a 1).
it: come 1).

source: Emblem-Counter
fr: Compteur sur l'Icône
gl: Contador de emblemas
it: Emblema-Contatore

source: count
fr: Comptes en ligne
gl: conta
it: conto

source: A number to be displayed over the application's icon in the launcher.
fr: Un nombre qui sera affiché sur l'icône de l'appli dans le lanceur.
gl: Número que se amosará sobre a icona do aplicativo no iniciador.
it: Un numero da visualizzare sull'icona dell'applicazione nel launcher.

source: Set to true to show the counter, or false to hide it.
fr: Positionné à true pour montrer le compteur, false pour le cacher.
gl: Configure como verdadeiro para mostrar o contador ou falso para ocultalo.
it: Impostare a true per mostrare il contatore, o falso per nasconderlo.

source: User Metrics
fr: Métriques utilisateur
gl: Interface do usuario
it: Metriche dell'utente

source: What are User Metrics?
fr: Que sont les métriques utilisateur ?
gl: Que son as Interfaces do Usuario?
it: Quali sono le metriche dell'utente?

source: If you look on the lock screen, you will see a circle. Inside the circle is text. Look closer, and you’ll notice that the text contains data regarding the user’s activity. Double tap on the middle of the circle, and you will see more "metrics" about the user.
fr: Si vous regardez sur l'écran de verrouillage, vous verrez un cercle. À l'intérieur de ce cercle se trouve du texte. Regardez de plus près, et vous remarquerez que sont des données concernant l'activité de l'utilisateur. Appuyez deux fois sur le milieu du cercle et vous verrez d'autres "mesures" concernant l'activité de l'utilisateur.
gl: Se miras na pantalla de bloqueo, verás un círculo. Dentro do círculo hai texto. Mire máis de cerca e notará que o texto contén datos relativos á actividade do usuario. Toca dúas veces no medio do círculo e verás máis "métricas" sobre o usuario.
it: Se si guarda sullo schermo di blocco, si vedrà un cerchio. All'interno del cerchio c'è scritto. Guarda più da vicino, e noterai che il testo contiene i dati relativi all'attività dell'utente. Doppio tap al centro del cerchio, e vedrete più "metriche" sull'utente.

source: This shows "7 text messages sent today." How did it know?
fr: Le texte indique "7 messages texte envoyés aujourd'hui". Comment cette donnée est-elle récupérée ?
gl: Amosa "7 mensaxes de texto enviadas hoxe". Como o soubo?
it: Questo mostra "7 messaggi di testo inviati oggi". Come lo sapeva?

source: This is from a 3rd-party application (`nCounter <https://gitlab.com/joboticon/ncounter/>`_) that makes use of the User Metrics feature.
fr: Ceci provient d'une application tierce (`nCounter <https://gitlab.com/joboticon/ncounter/>`_) qui utilise la fonction User Metrics.
gl: Trátase dun aplicativo de terceiros (`nCounter <https://gitlab.com/joboticon/ncounter/>` _) que fai uso da función Métricas de usuario.
it: Questo è da un'applicazione di terze parti (`nCounter <https://gitlab.com/joboticon/ncounter/>`_) che fa uso della funzione User Metrics.

source: For the most part, these messages are quite clearly state what they are counting, and which app is related. But where do these metrics come from?
fr: Pour la plupart, ces messages indiquent clairement ce qu'ils comptent, et quelle application est concernée. Mais d'où viennent ces données ?
gl: Na súa maior parte, estas mensaxes indican con bastante claridade o que contan e o aplicativo relacionado. Pero de onde veñen estas métricas?
it: Per la maggior parte, questi messaggi sono abbastanza chiaramente dichiarare ciò che stanno contando, e quale app è correlata. Ma da dove vengono queste metriche?

source: How can I use User Metrics in my application?
fr: Comment puis-je utiliser les métriques utilisateur dans mon application ?
gl: Como podo usar Métricas de usuario no meu aplicativo?
it: Come posso utilizzare User Metrics nella mia applicazione?

source: All of the following information will be based on the code for `nCounter`_.
fr: Les explications suivantes seront basées sur le code de `nCounter`_.
gl: Toda a seguinte información basearase no código de `nCounter`_.
it: Tutte le seguenti informazioni saranno basate sul codice per `nCounter`_.

source: Your app's apparmor file must include ``usermetrics`` in the policy:
fr: Le fichier apparmor de votre application doit inclure ``usermetrics`` dans la stratégie de sécurité :
gl: O ficheiro apparmor do teu aplicativo debe incluír "usermetrics" na política:
it: Il file apparmor della tua app deve includere ``usermetrics`` nella politica:

source: Next, you will need to import the module in the QML file that will handle the User Metrics:
fr: Ensuite, vous il faut importer le module dans le fichier QML qui gérera les données utilisateur :
gl: A continuación, terá que importar o módulo no ficheiro QML que xestionará as métricas do usuario:
it: Successivamente, è necessario importare il modulo nel file QML che gestirà le metriche dell'utente:

source: (There may be updated versions of this above 0.1)
fr: (Il peut y avoir des versions plus à jour pour ceci après la 0.1)
gl: (Pode haber versións actualizadas desta anterior 0.1)
it: (Ci possono essere versioni aggiornate di questo sopra 0.1)

source: Next, the specific Metric must be defined in the code as an object:
fr: Ensuite, la métrique en question doit être définie dans le code comme un objet (Metric) :
gl: A continuación, a métrica específica debe definirse no código como un obxecto:
it: Successivamente, il Metric specifico deve essere definito nel codice come un oggetto:

source: Now that the metric is created, we can update the "format" or "emptyFormat" when an event takes place by referencing the variables in the Metric object.
fr: Maintenant que la métrique est créée, nous pouvons mettre à jour "format" ou "emptyFormat" lorsqu'un événement se produit en faisant référence aux variables de l'objet Metric.
gl: Agora que se crea a métrica, podemos actualizar o "formato" ou "Formato baleiro" cando se produce un evento facendo referencia ás variables no obxecto Métrica.
it: Ora che la metrica viene creata, possiamo aggiornare il "format" o "emptyFormat" quando un evento avviene facendo riferimento alle variabili dell'oggetto Metrico.

source: Here we assign a new value to the circleMetric string variable that’s inside the Metric object:
fr: Ici, nous attribuons une nouvelle valeur à la variable chaîne circleMetric qui se trouve dans l'objet Metric :
gl: Aquí asignamos un novo valor á variable de cadea circleMetric que está dentro do obxecto Métrico:
it: Qui assegnamo un nuovo valore alla variabile di stringa circleMetric che è all'interno dell'oggetto Metric:

source: (Remember that circleMetric is the variable value assigned to format)
fr: (Rappelez-vous que circleMetric est la valeur de la variable affectée au format)
gl: (Lembre que circleMetric é o valor variable asignado ao formato)
it: (Ricorda che circleMetric è il valore variabile assegnato al formato)

source: Metric Id [dot] Variable Name [equals] New variable information
fr: Id Metric [point] Nom de la variable [égal] Nouvelles informations sur la variable
gl: Id métrica [punto] Nome da variable [igual] Nova información de variable
it: Metric Id [punto] Nome variabile [uguale] Nuove informazioni variabili

source: ``metric.circleMetric = "New Metric Message"``
gl: `` metric.circleMetric = "Nova mensaxe métrica" ``
it: ``metric.circleMetric = "Nuovo messaggio metrico"``

source: We then tell the lock screen to update the metric.
fr: Nous demandons ensuite à l'écran de verrouillage de mettre à jour la métrique.
gl: A continuación, indicámoslle á pantalla de bloqueo que actualice a métrica.
it: Diremo poi alla schermata di blocco per aggiornare la metrica.

source: Metric ID [dot] update (specific amount to set if included in the format)
fr: Id Metric [point] mise à jour (contenu spécifique à définir si inclus dans le format)
gl: Actualización de ID de métrica [punto] (cantidade específica para definir se é incluído no formato)
it: Aggiornamento Metric ID [dot] (importo specifico da impostare se incluso nel formato)

source: (Note: In this example, ``0`` is arbitrary since the metric value doesn't include a counter)
fr: (Note : Dans cet exemple, ``0`` est arbitraire puisque metric n'inclut pas de compteur)
gl: (Nota: Neste exemplo, "0" é arbitrario xa que o valor métrico non inclúe un contador)
it: (Nota: In questo esempio, ``0`` è arbitrario poiché il valore metrico non include un contatore)

source: We have now updated the metric for today. When the time rolls over to tomorrow, the metric will be reset to whatever is in ``emptyFormat``.
fr: Nous avons maintenant mis à jour la métrique pour le jour courant. Rendu à demain, cette métrique sera réinitialisé à ce qui se trouve dans ``emptyFormat``.
gl: Actualizamos a métrica de hoxe. Cando o tempo pasa a mañá, a métrica restablecerase a todo o que estea en "Formato baleiro".
it: Ora abbiamo aggiornato la metrica per oggi. Quando il tempo passa a domani, la metrica sarà ripristinata a qualsiasi cosa sia in ``emptyFormat`.

source: For most apps, this defaults to 0 counts for messages, calls, etc.
fr: Pour la plupart des appli, la valeur par défaut est de 0 pour les messages, les appels, etc.
gl: Para a maioría das aplicacións, isto predeterminado é 0 para mensaxes, chamadas, etc.
it: Per la maggior parte delle applicazioni, questo default a 0 conta per messaggi, chiamate, ecc.

source: How do User Metrics work?
fr: Comment les métriques utilisateur fonctionne-t-elles ?
gl: Como funcionan as métricas de usuario?
it: Come funzionano le metriche degli utenti?

source: User Metrics are made up of two "formats":
fr: L'objet est constitué de deux "formats" :
gl: As métricas de usuario compóñense de dous "formatos":
it: I metrici utente sono costituiti da due "formati":

source: metrics/messages for today (``format``)
fr: metrics/messages pour aujourd'hui (``format``)
gl: métricas / mensaxes de hoxe ("formato")
it: metriche/messaggio per oggi (``format``)

source: metrics/messages for tomorrow (``emptyFormat``)
fr: metrics/messages pour demain (``emptyFormat``)
gl: métricas / mensaxes para mañá ("Formato baleiro")
it: metriche/messaggio per domani (``emptyFormat``)

source: The value of ``emptyFormat`` is what displays on the lock screen when no value has been stored in ``format``. In order to display a new value of ``format`` the metric must be updated.
fr: La valeur de ``emptyFormat`` est ce qui s'affiche sur l'écran de verrouillage quand aucune valeur n'a été stockée dans ``format``. Afin d'afficher une nouvelle valeur de ``format``, metric doit être mis à jour.
gl: O valor de "Formato baleiro" é o que aparece na pantalla de bloqueo cando non se gardou ningún valor en "formato". Para amosar un novo valor de "formato", a métrica debe actualizarse.
it: Il valore di ``emptyFormat`` è quello che visualizza sulla schermata di blocco quando nessun valore è stato memorizzato in ``format``. Per visualizzare un nuovo valore di ``format`` la metrica deve essere aggiornata.

source: There are two options for updating the metric:
fr: Il existe deux façon de mettre à jour metric :
gl: Hai dúas opcións para actualizar a métrica:
it: Ci sono due opzioni per aggiornare la metrica:

source: Set the metric to a specific amount:
fr: Positionner la métrique à un certain montant :
gl: Estableza a métrica nunha cantidade específica:
it: Impostare la metrica a un importo specifico:

source: ``metricID.update(x)`` (where x is a number of type `double` to set for a counter value). ``metricID`` is the ``id:`` specified in the Metric item. The counter value can be included in the ``format`` setting by using ``%1``. e.g. ``format: "%1 buttons pressed today"``
fr: ``metricID.update(x)`` (où x est un nombre de type `double` à définir pour une valeur de compteur). ``metricID`` est le ``id:`` spécifié dans l'élément Metric. La valeur du compteur peut être incluse dans le paramètre ``format`` en utilisant ``%1``. Par exemple, ``format : "%1 boutons pressés aujourd'hui"``
gl: "metricID.update (x)" "(onde x é un número de tipo" dobre "para establecer un valor de contador). "metricID" é o "id:" especificado no elemento Métrica. O valor do contador pódese incluír na configuración "formato" usando "% 1". por exemplo `` format: "% 1 botóns presionados hoxe" ``
it: ``metricID.update(x)`` (dove x è un numero di tipo `doppio` da impostare per un controvalore). ``metricID`` è il ``id:`` specificato nella voce Metrica. Il controvalore può essere incluso nell'impostazione ``format`` utilizzando ``%1``. ad esempio ``format: "%1 pulsanti premuto oggi"``

source: Increment the metric:
fr: Incrémenter la métrique:
gl: Subir a métrica:
it: Incremento della metrica:

source: ``metricID.increment(x)`` (where x is the amount to add to the current counter)
fr: ``metricID.increment(x)`` (où x est le montant à ajouter au compteur actuel)
gl: "metricID.increment (x)" (onde x é a cantidade para engadir ao contador actual)
it: ``metricID.increment(x)`` (dove x è la quantità da aggiungere al contatore corrente)

source: The metric will reset back to the value stored in ``emptyFormat`` each day.
fr: La métrique sera réinitialisé à la valeur stockée dans ``emptyFormat`` chaque jour.
gl: A métrica restablecerase ao valor almacenado en "Formato baleiro" cada día.
it: La metrica ritornerà al valore memorizzato in ``emptyFormat`` ogni giorno.

source: Applications make use of User Metrics by setting and updating the "formats" whenever a certain event takes place. e.g. When you press send in Telegram, or when you receive a phone call. The application may store the data for manipulation, but generally the data is stored in the system (`/var/lib/usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>`_).
fr: Les applications utilisent les métriques utilisateur en définissant et en mettant à jour les "formats" chaque fois qu'un certain événement a lieu, par exemple lorsque vous appuyez sur envoyer dans Telegram, ou lorsque vous recevez un appel téléphonique. L'application peut stocker les données pour les manipuler, mais généralement celles-ci sont stockées dans le système (`/var/lib/usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>`_).
gl: As aplicacións fan uso das métricas do usuario configurando e actualizando os "formatos" sempre que se produce un determinado evento. Por exemplo Cando preme enviar en Telegram ou cando recibe unha chamada. O aplicativo pode almacenar os datos para manipulalos, pero xeralmente os datos almacénanse no sistema (`/ var / lib / usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>` _) .
it: Le applicazioni fanno uso di metriche dell'utente impostando e aggiornando i "formati" ogni volta che un determinato evento avviene. ad esempio. Quando si preme inviare in Telegram, o quando si riceve una telefonata. L'applicazione può memorizzare i dati per la manipolazione, ma generalmente i dati vengono memorizzati nel sistema (`/var/lib/usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>`_).

source: (See this `blog post <https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>`_ for a simple example)
fr: (Voir cet `article de blog <https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>`_ pour un exemple simple)
gl: (Vexa esta `publicación do blog <https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>` _ para un exemplo sinxelo)
it: (Vedi questo articolo<https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>`_ per un semplice esempio)

source: Limitations and wonders
fr: Limitations et expectatives
gl: Limitacións e marabillas
it: Limitazioni e meraviglie

source: Once a metric is registered, it remains on the lock screen even after the app has been uninstalled. A database file (db) is stored in `/var/lib/usermetrics`, which can be deleted by root (but not with sudo). Deleting this file and rebooting will remove all stored metrics. Presumably, the db file could be edited instead of deleted.
fr: Une fois qu'une métrique est enregistrée, elle reste sur l'écran de verrouillage même après la désinstallation de l'application. Un fichier de base de données (db) est stocké dans `/var/lib/usermetrics`, qui peut être supprimé par root (mais pas avec sudo). La suppression de ce fichier et le redémarrage supprimeront toutes les métriques stockées. Le fichier db pourrait sans doute être édité au lieu d'être supprimé.
gl: Unha vez rexistrada unha métrica, permanece na pantalla de bloqueo incluso despois de desinstalar o aplicativo. Un ficheiro de base de datos (db) almacénase en `/ var / lib / usermetrics`, que pode ser eliminado por root (pero non con sudo). Ao eliminar este ficheiro e reiniciar eliminaranse todas as métricas almacenadas. É de supoñer que o ficheiro db podería editarse en vez de eliminarse.
it: Una volta che una metrica è registrata, rimane sulla schermata di blocco anche dopo che l'applicazione è stata disinstallata. Un file di database (db) viene memorizzato in `/var/lib/usermetrics`, che può essere eliminato da root (ma non con sudo). Cancellare questo file e riavviare rimuoverà tutte le metriche memorizzate. Presumibilmente, il file db potrebbe essere modificato invece di cancellato.

source: Based on how the "formats" are set up, it seems that it is difficult to maintain a running tally beyond one day (though not impossible. See `FluffyChat <https://gitlab.com/ChristianPauly/fluffychat>`_).
fr: En se basant sur la façon dont les "formats" sont mis en place, il semble qu'il soit difficile de maintenir un décompte courant au-delà d'un jour (mais pas impossible. Voir `FluffyChat <https://gitlab.com/ChristianPauly/fluffychat>`_).
gl: En función de como se configuran os "formatos", parece que é difícil manter un balance de execución máis alá dun día (aínda que non imposible. Vexa `FluffyChat <https://gitlab.com/ChristianPauly/fluffychat>` _).

source: In the case of the `nCounter`_ app. I wanted to count the number of days, but since the metric "resets" each day, that presents a problem. I created a workaround that updates the metric every time the application is opened. Thus, the ``emptyFormat`` (default) tells the user to open the application. This, however, nearly defeats the purpose of the metric entirely, other than having a neat stat reminder for the day.
fr: Dans le cas de l'application `nCounter`_. Je voulais compter le nombre de jours, mais comme la métrique se "réinitialise" chaque jour, cela pose un problème. J'ai créé une solution de contournement qui met à jour la métrique chaque fois que l'application est ouverte. Ainsi, ``emptyFormat`` (par défaut) indique à l'utilisateur d'ouvrir l'application. Cependant, cela va presque à l'encontre de l'utilité des métriques, si ce n'est d'avoir un rappel des statistiques pour la journée.
gl: No caso da aplicación `nCounter`_. Quería contar o número de días, pero dado que a métrica "restablécese" cada día, iso presenta un problema. Creei unha solución que actualiza a métrica cada vez que se abre o aplicativo. Así, o "Formato baleiro" (por defecto) dille ao usuario que abra o aplicativo. Non obstante, isto case derrota completamente o propósito da métrica, ademais de ter un recordatorio de estatísticas para o día.

source: There must be a way for a process to run independently in the background (e.g. cron) to retrieve data from a specific app code. One lead is the Indicator Weather app. This runs a process every X minutes to update the weather indicator automatically without having to open the app.
fr: Il y a sûrement un moyen pour un processus de s'exécuter indépendamment en arrière-plan (par exemple, cron) pour récupérer les données d'une d'application spécifique. L'application Indicator Weather en est un exemple. Elle exécute un processus toutes les X minutes pour mettre à jour automatiquement l'indicateur météo sans avoir à être ouverte.
gl: Debe haber un xeito de que un proceso se execute de forma independente en segundo plano (por exemplo, cron) para recuperar datos dun código de aplicativo específico. Un dos principais son a aplicación Indicator Weather. Isto executa un proceso cada X minutos para actualizar o indicador meteorolóxico automaticamente sen ter que abrir o aplicativo.

source: Writable directories
fr: Répertoires en écriture
gl: Directorios editables

source: App confinement is part of the Ubuntu Touch security concept. Data can be exchanged between apps only according to the AppArmor policies, mainly using the :ref:`ContentHub <contenthub>`. This being said, apps can only read and write files that are located in one of three app specific directories explained in this guide.
fr: Le confinement des applications fait partie du concept de sécurité d'Ubuntu Touch. Les données peuvent être échangées entre les applications en fonction des politiques AppArmor, principalement en utilisant le :ref:`centre de contenus <contenthub>`. Cela dit, les applications peuvent uniquement lire et écrire sur des fichiers qui sont situés dans l'un des trois répertoires spécifiques expliqués dans ce guide.
gl: O confinamento de aplicacións forma parte do concepto de seguridade Ubuntu Touch. Os datos pódense intercambiar entre aplicativos só segundo as políticas de AppArmor, principalmente usando: ref: `ContentHub <contenthub>`. Dito isto, os aplicativos só poden ler e escribir ficheiros que se atopan nun dos tres directorios específicos do aplicativo explicados nesta guía.

source: Standard Paths
fr: Chemins standards
gl: Ruta estándar
