Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: If you have trouble accessing your device in fastboot mode, but are able to access it in TWRP recovery mode using adb, then boot into recovery mode and try the following alternative method::
fr: Si vous avez des difficultés à accéder à votre appareil en mode de démarrage rapide, mais que vous pouvez y accéder en mode récupération avec TWRP en utilisant adb, alors démarrez en mode de récupération et essayez la méthode alternative suivante ::
gl: Se tes problemas para acceder ao teu dispositivo no modo de arranque rápido, pero podes acceder a el no modo de recuperación TWRP usando adb, inicia o modo de recuperación e proba o seguinte método alternativo:

source: On your device, choose *Install* in the TWRP menu, navigate to the sdcard directory, choose *Image*, select your image file, select *Boot* and swipe to flash.
fr: Sur votre appareil, choisissez *Install* dans le menu de TWRP, naviguez jusqu'au répertoire sdcard, choisissez *Image*, sélectionnez votre fichier image, sélectionnez *Boot* et faites glisser pour lancer l'installation.
gl: No seu dispositivo, escolla * Instalar * no menú TWRP, desprácese ata o directorio sdcard, escolla * Imaxe *, seleccione o seu ficheiro de imaxe, seleccione * Arrancar * e pase o dedo para flashear.

source: Samsung devices: Flashing halium-boot.img on Samsung devices is done using the Heimdall flashing utility (on Linux) or the Odin utility (on Windows) after first bringing the device into 'download mode'. See more information on these utilities `here <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>`_. Follow the instructions for the utility you choose, including the specific flashing command for flashing the boot partition. Install system.img and rootfs (below) with the device in recovery mode.
fr: Pour les appareils Samsung : L'installation de halium-boot.img sur les appareils Samsung se fait à l'aide de l'utilitaire d'installation Heimdall (sous Linux) ou de l'utilitaire Odin (sous Windows) après avoir mis l'appareil en 'mode téléchargement'. Plus d'informations sur ces utilitaires sont disponibles `ici <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>`_. Suivez les instructions pour l'utilitaire que vous avez choisi, y compris la commande d'installation spécifique pour l'installation de la partition de démarrage. Installez system.img et rootfs (ci-dessous) avec l'appareil en mode récupération.
gl: Dispositivos Samsung: o halium-boot.img intermitente nos dispositivos Samsung faise mediante a utilidade intermitente Heimdall (en Linux) ou a utilidade Odin (en Windows) despois de levar o dispositivo ao "modo de descarga". Vexa máis información sobre estas utilidades `aquí <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>` _. Siga as instrucións da utilidade que escolla, incluído o comando de parpadeo específico para parpadear a partición de arranque. Instale system.img e rootfs (a continuación) co dispositivo en modo de recuperación.

source: Install system.img and rootfs
fr: Installation de system.img et de rootfs
gl: Instalar system.img e rootfs
it: Installa system.img e rootfs

source: Next you need to download the appropriate rootfs for your device. At the moment there are two available versions, a 32 bit and a 64 bit one.
fr: Ensuite, vous devez télécharger le fichier rootfs approprié pour votre appareil. Il existe actuellement deux versions disponibles, l'une en 32 bits et l'autre en 64 bits.
gl: A continuación, tes que descargar os rootfs adecuados para o teu dispositivo. Polo momento hai dúas versións dispoñibles, unha de 32 bits e outra de 64 bits.

source: Simply download ``ubports-touch.rootfs-xenial-armhf.tar.gz`` (32 bit) from `our CI server <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__.
fr: Il suffit de télécharger ``ubports-touch.rootfs-xenial-armhf.tar.gz`` (32 bit) sur ``notre serveur d'intégration continue <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__.
gl: Simplemente descargue "ubports-touch.rootfs-xenial-armhf.tar.gz" (32 bits) desde "o noso servidor CI <https://ci.ubports.com/job/xenial-rootfs-armhf/>" __ .

source: If you have a 64-bit ARM (aarch64) device, this same rootfs should work for you. You can also try the 64 bit version keeping in mind that you may possibly run into more issues with this owing to the current state of development of this rootfs. (If you have an x86 device, let us know. There is no rootfs available for these yet.)
fr: Si vous disposez d'un appareil ARM 64 bits (aarch64), ce même fichier rootfs devrait fonctionner pour vous. Vous pouvez également essayer la version 64 bits en gardant à l'esprit que vous pourriez rencontrer d'autres problèmes en raison de l'état actuel de développement de ce fichier rootfs. (Si vous avez un périphérique x86, faites-le nous savoir, il n'y a pas encore de fichier rootfs disponible pour ceux-ci.)
gl: Se tes un dispositivo ARM de 64 bits (aarch64), este mesmo rootfs debería funcionar para ti. Tamén podes probar a versión de 64 bits tendo en conta que posiblemente teñas máis problemas debido ao estado actual de desenvolvemento deste rootfs. (Se tes un dispositivo x86, avísanos. Aínda non hai rootfs dispoñibles para estes.)

source: Clone or download the `halium-install repository <https://gitlab.com/JBBgameich/halium-install>`_. This repository contains tools that can be used to install a Halium system image and distribution rootfs. Reboot your device to recovery (e.g. TWRP), to get adb access again. Now use the ``halium-install`` script to install Ubuntu Touch on your device::
fr: Clonez ou téléchargez le `dépôt halium-install <https://gitlab.com/JBBgameich/halium-install>`_. Ce dépôt contient des outils qui peuvent être utilisés pour installer une image système d'Halium et un fichier rootfs de la distribution. Redémarrez votre appareil en mode récupération (par exemple via TWRP), pour obtenir à nouveau un accès à adb. Maintenant, utilisez le script ``halium-install`` pour installer Ubuntu Touch sur votre appareil ::
gl: Clonar ou descargar o repositorio `install-halium <https://gitlab.com/JBBgameich/halium-install>` _. Este repositorio contén ferramentas que se poden empregar para instalar unha imaxe do sistema Halium e rootfs de distribución. Reinicie o dispositivo para recuperalo (por exemplo, TWRP) para volver acceder a adb. Agora use o script "halium-install" para instalar Ubuntu Touch no seu dispositivo:

source: The script will copy and extract the files to their proper places, then allow you to set the user password for your device (the *phablet* user's password).
fr: Le script copiera et extraira les fichiers dans leurs emplacements respectifs, puis vous autorisera à définir le mot de passe de votre appareil (le mot de passe *phablet*).
gl: O script copiará e extraerá os ficheiros nos lugares adecuados e logo permitiralle configurar o contrasinal de usuario para o seu dispositivo (o contrasinal do usuario * phablet *).

source: Get SSH access
fr: Obtenir un accès SSH
gl: Obter acceso por SSH
it: Ottenere l'accesso SSH

source: When your device boots, it will likely stay at the bootloader screen. However, you should also get a new network connection on the computer you have it plugged in to. You will need to use this to debug the system.
fr: Lorsque votre appareil démarre, il reste en règle générale sur l'écran de chargeur d'amorçage. Cependant, vous devez aussi obtenir une nouvelle connexion au réseau sur l'ordinateur auquel vous l'avez branché. Vous aurez besoin d'utiliser cela pour dépanner le système.
gl: Cando o dispositivo arranca, probablemente permanecerá na pantalla do cargador de arranque. Non obstante, tamén debería ter unha nova conexión de rede no ordenador ao que está conectado. Deberá empregalo para depurar o sistema.

source: To confirm that your device has booted correctly, on your host computer, run ``dmesg -w`` and watch for "GNU/Linux device" in the output. If you instead get something similar to "Halium initrd Failed to boot", please get in contact with us so we can find out why.
fr: Pour confirmer que votre appareil a correctement démarré, exécutez sur votre ordinateur hôte la commande ``dmesg -w`` et guettez « GNU/Linux device » en sortie. Si vous obtenez en revanche quelque chose du style « Halium initrd Failed to boot », veuillez prendre contact avec nous pour que nous comprenions pourquoi.
gl: Para confirmar que o seu dispositivo se iniciou correctamente, no seu computador anfitrión, execute `` dmesg -w`` e vexa "dispositivo GNU / Linux" na saída. Se obtén algo semellante a "Fallo ao iniciar Halium initrd", póñase en contacto connosco para que poidamos saber por que.

source: Similar to the Halium reference rootfs, you should `set your computer's IP on the newly connected RNDIS interface <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>`__ to ``10.15.19.100`` if you don't get one automatically. Then, run the following to access your device::
fr: De la même manière que pour le rootfs de référence d'Halium, vous devez `configurer l'adresse IP de votre ordinateur sur la nouvelle interface connectée RNDIS <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>`__ à ``10.15.19.100`` si vous n'en obtenez pas une automatiquement. Exécutez ensuite la commande suivante pour accéder à votre appareil ::
gl: De xeito semellante aos rootfs de referencia de Halium, debería `configurar a IP do seu ordenador na interface RNDIS recentemente conectada <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>` __ a "10.15.19.100" se non o consegue automaticamente. A continuación, execute o seguinte para acceder ao seu dispositivo:

source: The password will be the one that you set while running halium-install.
fr: Le mot de passe sera celui que vous avez défini lors de l'exécution d'halium-install.
gl: O contrasinal será o que definiu mentres executaba halium-install.

source: Troubleshooting initial boot
fr: Résolution des problèmes du lancement initial
gl: Solución de problemas do arranque inicial

source: Refer to :ref:`Known-issues-with-initial-boot`.
fr: Référez-vous à :ref:`Problèmes connus avec le démarrage initial`.
gl: Consulte: ref: `Problemas coñecidos-con-arranque-inicial '.

source: Reference material
fr: Documents de référence
gl: Documentos de referencia

source: Display settings
fr: Paramètres d'affichage
gl: Parámetros da pantalla
it: Impostazioni schermo

source: ``GRID_UNIT_PX`` (Pixels per Grid Unit or Px/GU) is specific to each device. Its goal is to make the user interface of the system and its applications the same *perceived* size regardless of the device they are displayed on. It is primarily dependent on the pixel density of the device’s screen and the distance to the screen the user is at. The latter value cannot be automatically detected and is based on heuristics. We assume that tablets and laptops are the same distance and that they are held at 1.235 times the distance phones tend to be held at.
fr: ``GRID_UNIT_PX`` (Pixels per Grid Unit ou Px/GU ou Pixels par Unité de Grille) est spécifique à chaque appareil. Son but est de donner à l'interface utilisateur du système et à ses applications la même taille *perçue* peu importe l'appareil sur lequel elles sont affichées. Il est essentiellement dépendant de la densité de pixels de l'écran de l'appareil et de la distance entre l'utilisateur et l'écran. Cette dernière valeur ne peut être automatiquement détectée et est basée sur l'expérience. Nous supposons que les tablettes et les ordinateurs sont à la même distance et qu'ils sont tenus à 1,235 fois la distance à laquelle les téléphones ont tendance à être tenus.
gl: "GRID_UNIT_PX" (píxeles por unidade de rede ou Px / GU) é específico de cada dispositivo. O seu obxectivo é facer que a interface de usuario do sistema e os seus aplicativos teñan o mesmo tamaño * percibido * independentemente do dispositivo no que se mostren. Depende principalmente da densidade de píxeles da pantalla do dispositivo e da distancia á pantalla na que se atopa o usuario. Este último valor non se pode detectar automaticamente e baséase en heurísticas. Supoñemos que as tabletas e os portátiles están á mesma distancia e que se manteñen a 1,235 veces a distancia que adoitan estar os teléfonos.
it: `` GRID_UNIT_PX`` (Pixel per Grid Unit o Px / GU) è specifico per ogni dispositivo. Il suo obiettivo è quello di rendere l'interfaccia utente del sistema e delle sue applicazioni della stessa dimensione * percepita *, indipendentemente dal dispositivo su cui sono visualizzate. Dipende principalmente dalla densità dei pixel dello schermo del dispositivo e dalla distanza dello schermo dall'utente. Quest'ultimo valore non può essere rilevato automaticamente e si basa sull'euristica. Supponiamo che tablet e laptop siano alla stessa distanza e che siano tenuti a 1.235 volte la distanza a cui i telefoni tendono ad essere tenuti.

source: ``QTWEBKIT_DPR`` sets the display scaling for the Oxide web engine, so changes to this value will affect the scale of the browser and webapps.
fr: ``QTWEBKIT_DPR`` définit la mise à l'échelle de l'affichage pour le moteur Web Oxide, ainsi des modifications de cette valeur affecteront l'échelle du navigateur et des Webapps.
gl: "QTWEBKIT_DPR" establece a escala de visualización para o motor web Oxide, polo que os cambios neste valor afectarán a escala do navegador e das webapps.
it: `` QTWEBKIT DPR`` imposta il ridimensionamento dello schermo per il motore web Oxide, pertanto le modifiche a questo valore influiranno sulla scala del browser e delle webapps.

source: A reference device has been chosen from which we derive the values for all other devices. The reference device is a laptop with a 120ppi screen. However, there is no exact formula since these options are set for *perceived* size rather than *physical* size. Here are some values for other devices so you may derive the correct one for yours:
fr: Un appareil de référence a été choisi et nous dérivons de celui-ci les valeurs pour tous les autres appareils. L'appareil de référence est un ordinateur avec un écran de 120 ppi (pixels par pouce). Cependant, il n'existe pas de formule exacte puisque ces options sont définies pour une taille *perçue* plutôt qu'une taille *physique*. Voici quelques valeurs pour d'autres appareils afin que vous puissiez dériver les valeurs correctes pour le vôtre :
gl: Escolleuse un dispositivo de referencia do que derivamos os valores para o resto de dispositivos. O dispositivo de referencia é un portátil cunha pantalla de 120 ppp. Non obstante, non hai unha fórmula exacta xa que estas opcións están definidas para o tamaño * percibido * en lugar do tamaño * físico *. Aquí tes algúns valores para outros dispositivos para que poida obter o correcto para o teu:

source: Device
fr: Appareil
gl: Dispositivo

source: Resolution
fr: Résolution
gl: Resolución
it: Risoluzione

source: Display Size
fr: Taille d'affichage
gl: Tamaño da pantalla
it: Grandezza dello schermo

source: 'Normal' density laptop
fr: Ordinateur à densité « normale »
gl: Ordenador portátil con densidade 'normal'
it: Laptop a densità 'normale'

source: N/A
gl: N/D
it: N/D

source: 'High' density laptop
fr: Ordinateur à densité « forte »
gl: Ordenador portátil de densidade 'alta'
it: Laptop a densità 'alta'

source: Experiment with a few values to find one that feels good when compared to the Ubuntu Touch experience on other devices. If you are unsure of which is the best, share some pictures (including some object for scale) along with the device specs with us.
fr: Essayez plusieurs valeurs pour trouver celle qui donne de bons résultats comparés au rendu d'Ubuntu Touch sur d'autres appareils. Si vous n'êtes pas certains de la meilleure, partagez quelques photos (comprenant quelques objets pour l'échelle) accompagnées des spécifications de l'appareil avec nous.
gl: Proba algúns valores para atopar un que se sinta ben en comparación coa experiencia Ubuntu Touch noutros dispositivos. Se non está seguro de cal é o mellor, comparta con nós algunhas fotos (incluído algún obxecto para a escala) xunto coas especificacións do dispositivo.
it: Sperimenta con alcuni valori per trovare quello che meglio si adatta se confrontato con l'esperienza di Ubuntu Touch su altri dispositivi. Se non sei sicuro di quale sia il migliore, condividi con noi alcune immagini (compresi alcuni oggetti per la scala) insieme alle specifiche del dispositivo.

source: There are two other settings that may be of interest to you:
fr: Il existe deux autres paramètres qui peuvent vous intéresser :
gl: Hai outras dúas configuracións que pode estar interesado en ti:

source: Form factor
fr: Facteur de forme
gl: Factor de forma
it: Fattore di forma

source: ``FORM_FACTOR`` specifies the device's form factor. This value is set as the device's Chassis, which you can find by running ``hostnamectl``. The acceptable values are ``handset``, ``tablet``, ``laptop`` and ``desktop``. Apps such as the gallery use this information to change their functionality. For more information on the Chassis, see the freedesktop.org hostnamed specification.
fr: ``FORM_FACTOR`` spécifie le facteur de forme de l'appareil. Cette valeur est définie par le châssis de l'appareil, que vous pouvez trouver en exécutant ``hostnamectl``. Les valeurs acceptées sont ``handset``, ``tablet``, ``laptop`` et ``desktop``. Les applications telles que la galerie utilisent cette information pour modifier leurs fonctionnalités. Pour plus d'informations sur le châssis, consultez la spécification du nom d'hôte hébergée sur freedesktop.org.
gl: "FORM_FACTOR" especifica o factor de forma do dispositivo. Este valor establécese como Chasis do dispositivo, que podes atopar executando "hostnamectl". Os valores aceptables son "teléfono", "tableta", "portátil" e "escritorio". Aplicacións como a galería utilizan esta información para cambiar a súa funcionalidade. Para obter máis información sobre o chasis, consulte a especificación de nome host host freedesktop.org.

source: Native orientation
fr: Orientation native
gl: Orientación nativa

source: ``NATIVE_ORIENTATION`` sets the display orientation for the device's built-in screen. This value is used whenever autorotation isn't working correctly or when an app wishes to be locked to the device's native orientation. Acceptable values are ``landscape``, which is normally used for tablets, laptops, and desktops; and ``portrait``, which is usually used for phone handsets.
fr: ``NATIVE_ORIENTATION`` définit l'orientation d'affichage de l'écran intégré à l'appareil. Cette valeur est utilisée lorsque la rotation automatique ne fonctionne pas correctement ou lorsqu'une application souhaite être verrouillée dans l'orientation native de l'appareil. Les valeurs acceptables sont ``landscape`` (paysage, qui est normalement utilisée pour les tablettes, les ordinateurs portables et les ordinateurs de bureau) et ``portrait`` (portait, qui est habituellement utilisée pour les terminaux téléphoniques).
gl: "NATIVE_ORIENTATION" establece a orientación da pantalla para a pantalla integrada do dispositivo. Este valor úsase cando a autorotación non funciona correctamente ou cando unha aplicación quere bloquearse na orientación nativa do dispositivo. Os valores aceptables son "paisaxe", que normalmente se usa para tabletas, portátiles e escritorios; e "retrato", que normalmente se usa para os teléfonos móbiles.
it: ``NATIVE_ORIENTATION` configura l'orientazione del dispositivo per il suo schermoil. Tale valore usato qualora non funzionasse correttamente l'autorotazione o quando una applicazione desidera bloccare l'orienzazione nativa del dispositivo. Valori accettabili sono ``orizzontale``, che è usato normalmente per tabla, computer portatili e da tavolo; ``verticale``, per apparecchi cellulari.

source: To understand Apparmor, what it is and how it works, refer to `AppArmor on the Ubuntu Wiki <https://wiki.ubuntu.com/AppArmor>`_
gl: Para entender Apparmor, que é e como funciona e como funciona, vai a`AppArmor na Wiki de Ubuntu <https://wiki.ubuntu.com/AppArmor>`_

source: Backporting kernel drivers
gl: Controladores de núcleo de backporting

source: Depending on your device port, what kernel and Halium versions it is based on, you may need to backport one or more kernel drivers. The procedure for backporting bluetooth to Halium 7.1-based ports is described in `the porting-FAQ <https://pad.ubports.com/p/porting-faq>`_ . The process is challenging and has potential pitfalls.
gl: Dependendo do porto do dispositivo, en que versións do núcleo e Halium está baseado, pode que teña que facer un backport dun ou máis controladores do núcleo. O procedemento para facer o backporting do bluetooth a portos baseados en Halium 7.1 descríbese en `FAQ-porting <https://pad.ubports.com/p/porting-faq>` _. O proceso é desafiante e ten posibles trampas.

source: If you wish to gain a better understanding of backporting, please refer to `the Backports Project wiki page <https://backports.wiki.kernel.org/index.php/Main_Page>`_
gl: Se desexa obter unha mellor comprensión do backporting, consulte "a páxina do wiki do proxecto Backports <https://backports.wiki.kernel.org/index.php/Main_Page>" _

source: Android init scripts
gl: scripts init de Android

source: The init scripts play a key role in bringing up the different services inside your Android container that need to run on your device in order for it to function properly. Refer to `the Android init language <https://android.googlesource.com/platform/system/core/+/master/init/README.md>`_ for an explanation of the syntax of these scripts.
gl: Os scripts init xogan un papel fundamental na creación dos diferentes servizos dentro do teu recipiente de Android que precisan executarse no teu dispositivo para que funcione correctamente. Consulte "a linguaxe de inicio de Android <https://android.googlesource.com/platform/system/core/+/master/init/README.md>" _ para obter unha explicación da sintaxe destes scripts.

source: The graphical UI
fr: L'interface utilisateur/trice graphique
gl: A UI gráfica

source: Bring up Unity 8 (the graphical UI)
fr: Mise en place d'Unity 8 (l'interface utilisateur/trice graphique)
gl: Executando Unity 8 (a UI gráfica)
