Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: The launcher file will tell UT how to launch the app, which name and icon to display on the home screen, and some other properties.
fr: Le fichier du lanceur indique à Ubuntu Touch comme lancer l'application, quel nom et quelle icône afficher sur l'écran d’accueil, ainsi que d'autres propriétés.
gl: O ficheiro do iniciador indicará a UT como iniciar o aplicativo, que nome e icona amosar na pantalla de inicio e algunhas outras propiedades.
it: Il file di avvio indicherà a UT come avviare l'app, quale nome e icona visualizzare nella schermata iniziale e alcune altre proprietà.

source: Example of ``app.desktop``::
fr: Exemple de ``app.desktop`` ::
gl: Exemplo de ``app.desktop``::
it: Esempio di ``app.desktop``::

source: Non exhaustive list of properties:
fr: Liste non exhaustive de propriétés :
gl: Lista non exhaustiva de propiedades:
it: Elenco non esaustivo delle proprietà:

source: Name: Application title has shown in the dash
fr: Nom : le titre de l'application affiché dans le tableau de bord
gl: Nome: o título do aplicativo amosouse no guión
it: Nome: il titolo dell'applicazione è mostrato nella dash

source: Exec: Path to the executable file
fr: Exec : le chemin d'accès au fichier exécutable
gl: Exec: ruta ao ficheiro executable
it: Exec: Percorso al file eseguibile

source: Icon: Path to the icon to display
fr: Icon : le chemin vers l'icône à afficher
gl: Icona: ruta á icona que se amosa
it: Icon: Percorso dell'icona da mostrare

source: Terminal: ``false`` if will not run in terminal window
fr: Terminal : ne s'exécute pas dans une fenêtre de terminal si défini à ``false`` (faux)
gl: Terminal: "falso" se non se executa na xanela do terminal
it: Terminal: ``false`` non funzionerà in una finestra del terminale

source: Type: Specifies the type of the launcher file. The type can be Application, Link or Directory.
fr: Type : spécifie le type du fichier du lanceur. Le type peut être Application, Link (Lien) ou Directory (Répertoire).
gl: Tipo: especifica o tipo de ficheiro de inicio. O tipo pode ser Aplicativo, Ligazón ou Directorio.
it: Type: Specifica il tipo di file eseguibile. Può essere Application, Link o Directory.

source: X-Ubuntu-Touch: ``true`` to make the app visible
fr: X-Ubuntu-Touch : ``true`` (vrai) pour rendre l'application visible
gl: X-Ubuntu-Touch: "true" para facer visible o aplicativo
it: X-Ubuntu-Touch: ``true`` affinchè la app sia visibile

source: X-Ubuntu-XMir-Enable: ``true`` if your app is built for X
fr: X-Ubuntu-XMir-Enable : ``true`` (vrai) si votre application est construite pour le système de fenêtrage X
gl: X-Ubuntu-XMir-Enable: "true" se o teu aplicativo está deseñado para X
it: X-Ubuntu-XMir-Enable: ``true`` se la app è creata per X

source: X-Ubuntu-Supported-Orientations: ``landscape`` or ``portrait`` to force your app start in landscape mode and portrait mode respectively.
fr: X-Ubuntu-Supported-Orientations : ``landscape`` ou ``portrait`` pour forcer votre démarrage d'appli en mode paysage et portrait.
gl: X-Ubuntu-Supported-Orientations: "horizontal" ou "portrait" para forzar o inicio do aplicativo no modo horizontal e vertical.

source: Security and app isolation
fr: Sécurité et confinement d'application
gl: Seguridade e illamento de aplicativos
it: Sicurezza e isolamento della app

source: All Ubuntu apps are confined respecting AppArmor access control mechanism (see `Application Confinement <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_) , meaning they only have access to their own resources and are isolated from other apps and parts of the system. The developer must declare which policy groups are needed for the app or scope to function properly with an apparmor ``.json`` file.
fr: Toutes les applications et les moteurs de recherche d'Ubuntu sont confinés en respectant le mécanisme de contrôle d'accès d'AppArmor (voir `Confinement d'application <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_), ce qui signifie qu'ils ont seulement accès à leurs propres ressources et sont isolés des autres applications et des autres parties du systèmes. Le développeur doit déclarer dans un fichier apparmor ``.json`` quels groupes de règles sont nécessaires pour que l'application ou le moteur de recherche fonctionne correctement.
gl: Todos os aplicativos de Ubuntu están confinadas respectando o mecanismo de control de acceso AppArmor (consulte `Confinamento do aplicativo <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>` _), o que significa que só teñen acceso aos seus propios recursos e están illados doutros aplicativos e partes do sistema. O desenvolvedor debe declarar que grupos de políticas son necesarios para que o aplicativo ou o alcance funcione correctamente cun ficheiro apparmor ".json".

source: Example ``apparmor.json`` file::
fr: Exemple de fichier ``apparmor.json`` :
gl: Ficheiro de exemplo "apparmor.json" ::
it: Esempio ``apparmor.json`` file::

source: For a full list of available policy groups, see :doc:`apparmor`.
fr: Pour la liste complète des groupes de politique disponibles, voir :doc:`apparmor`.
gl: Para unha lista completa dos grupos de políticas dispoñibles, consulte: doc: `apparmor`.

source: Here are Ubuntu Touch platforms key topics when you want to extend your app with Ubuntu Touch ecosystem:
fr: Voici les thématiques clés pour les plateformes Ubuntu Touch lorsque vous souhaitez étendre le support pour votre appli par l'écosystème Ubuntu Touch :
gl: Aquí tes temas clave das plataformas Ubuntu Touch cando queres ampliar o teu aplicativo co ecosistema Ubuntu Touch:

source: Content Hub
fr: Centre de contenu
gl: Centro de contidos
it: Hub dei contenuti

source: Each application can expose content outside its sandbox, giving the user precise control over what can be imported, exported or shared with the world and other apps.
fr: Chaque application peut exposer du contenu en dehors de son bac à sable, ce qui donne à l'utilisateur un contrôle précis sur ce qui peut être importé, exporté ou partagé avec le monde et d'autres applications.
gl: Cada aplictivo pode expoñer contido fóra do seu sandbox, dándolle ao usuario un control preciso sobre o que se pode importar, exportar ou compartir co mundo e outros aplicativos.
it: Ogni applicazione può esporre il contenuto al di fuori della sua sandbox, dando all'utente un controllo preciso su ciò che può essere importato, esportato o condiviso con il mondo e altre app.

source: By using a push server and a companion client, instantly serve users with the latest information from their network and apps.
fr: Grâce à l'utilisation d'un serveur de notifications poussées et d'un client compagnon, les utilisateurs bénéficient instantanément des dernières informations de leurs réseaux et de leurs applications.
gl: Ao usar un servidor de elementos emerxentes e un cliente acompañante, atenda instantaneamente aos usuarios a información máis recente da súa rede e aplicativos.
it: Utilizzando un server push e un client associato, servi immediatamente gli utenti con le ultime informazioni dalla loro rete e dalle loro app.

source: URL dispatcher
fr: Répartiteur d'URL
gl: Distribuidor de URL
it: Dispatcher URL

source: Help users navigate between your apps and drive their journey with the URL dispatcher.
fr: Aidez les utilisateurs à naviguer entre vos applications et orientez-les grâce au répartiteur d'URL.
gl: Axude aos usuarios a navegar entre os seus aplicativos e dirixa a súa viaxe co distribuidor de URL.
it: Aiuta gli utenti a navigare tra le tue app e a guidare il loro viaggio con il dispatcher di URL.

source: Online accounts
fr: Comptes en ligne
gl: Contas en liña
it: Gli account online

source: Simplify user access to online services by integrating with the online accounts API. Accounts added by the user on the device are registered in a centralized hub, allowing other apps to re-use them.
fr: Simplifiez l'accès des utilisateurs aux services en ligne en intégrant l'API des comptes en ligne. Les comptes ajoutés par l'utilisateur sur l'appareil sont enregistrés et centralisés, ce qui permet à d'autres applications de les réutiliser.
gl: Simplifique o acceso do usuario a servizos en liña integrándose coa API de contas en liña. As contas engadidas polo usuario no dispositivo rexístranse nun concentrador centralizado, o que permite a outros aplicativos reutilizalos.
it: Semplifica l'accesso degli utenti ai servizi online integrandosi con l'API degli account online. Gli account aggiunti sul dispositivo dall'utente vengono registrati in un hub centralizzato, consentendo il riutilizzo da parte di altre app.

source: `Read the docs <https://docs.ubuntu.com/phone/en/platform/>`__
fr: `Lisez la documentation <https://docs.ubuntu.com/phone/en/platform/>`__
gl: `Ler os documentos <https://docs.ubuntu.com/phone/en/platform/>`__
it: `Leggi la documentazione <https://docs.ubuntu.com/phone/en/platform/>`__

source: Packaging your app
fr: Déboguer votre application Web
gl: Depuración do voso aplicativo web

source: Here you will get some informations about the confinment model and the packaging system:
fr: Vous trouverez ici des informations sur le modèle de confinement et le système de packaging :
gl: Aquí obterás información sobre o modelo de confinamento e o sistema de envasado:

source: App publishing guides
fr: Guides de publication des applications
gl: Guías de publicación de aplicativos

source: We are currently working on expanding our list of publishing guides. In the mean time you can get started over at the `OpenStore's submission page <https://open-store.io/submit>`__.
fr: Nous travaillons actuellement sur l'extension de la liste de nos guides de publication. En attendant, vous pouvez commencer pour démarrer par la `page de soumission de l'OpenStore <https://open-store.io/submit>`__.
gl: Actualmente estamos a traballar para ampliar a nosa lista de guías de publicación. Mentres tanto, podes comezar de novo na páxina de envío de `OpenStore <https://open-store.io/submit>` __.

source: If you are interested in helping create developer guides check out our `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
fr: Si vous êtes intéressé(e) pour aider à la création de guides du développeur, consultez notre `projet GitLab <https://gitlab.com/ubports/ux/development-resources>`__.
gl: Se estás interesado en axudar a crear guías para desenvolvedores, consulta o noso `Proxecto GitLab <https://gitlab.com/ubports/ux/development-resources>` __.

source: Sample Apps
fr: Modèles d'applications
gl: Aplicativos de mostra

source: We are currently working on expanding our list of sample apps. In the mean time many apps on the `OpenStore <https://open-store.io/>`__ are open source and can be used as a reference.
fr: Nous travaillons actuellement sur l'extension de notre liste de modèles d'applications. En attendant, de nombreuses applications sur l'`OpenStore <https://open-store.io/>`__ sont libres et peuvent servir de référence..
gl: Actualmente estamos a traballar para ampliar a nosa lista de aplicativos de exemplo. Mentres tanto, moitos aplicativos de `OpenStore <https://open-store.io/>` __ son de código aberto e pódense usar como referencia.

source: If you are interested in helping create sample apps check out our `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
fr: Si vous êtes intéressé(e) pour aider à créer des modèles d'applications, consultez notre `projet GitLab <https://gitlab.com/ubports/ux/development-resources>`__.
gl: Se estás interesado en axudar a crear mostras de aplicativos, consulta o noso `Proxecto GitLab <https://gitlab.com/ubports/ux/development-resources>` __.

source: Guide
gl: Guía
it: Guida

source: How the webapp fits into the shell
fr: Comment l'application Web s'intègre dans l'interface
gl: Como o aplicativo web encaixa no intérprete de ordes
it: Come la webapp si adatta nella shell

source: A web app displays in a webview inside a webapp-container that runs as an Ubuntu app in the Ubuntu/Unity shell.
fr: Une application Web s'affiche dans une vue Web à l'intérieur d'un conteneur qui s'exécute comme une application Ubuntu dans l'interface Ubuntu/Unity.
gl: Un aplicativo web móstrase nunha vista web dentro dun recipiente de aplicativos web que funciona como un aplicativo Ubuntu no shell Ubuntu / Unity.
it: Una app Web viene visualizzata in una vista Web all'interno di un contenitore che viene eseguito come app di Ubuntu nella shell di Ubuntu/Unity.

source: Taking a closer look:
fr: Regardons de plus près :
gl: Botando unha ollada máis atenta:
it: Dando un'occhiata più da vicino:

source: At the innermost level, there is a website that the developer identifies by URL. The website is rendered and runs in an Oxide webview. Oxide is a Blink/Chrome webview that is customized for Ubuntu. The Oxide webview runs and displays in the webapp-container. The webapp-container is the executable app runtime that is integrated with the Ubuntu/unity shell.
fr: Au niveau le plus profond, il y a un site web que le développeur identifie par une URL. Le site web est rendu et s'exécute dans une vue web Oxide. Oxide est vue web Blink/Chrome personnalisée pour Ubuntu. La vue web Oxide s'exécute et s'affiche dans le conteneur d'application web. Le conteneur d'application web est le runtime de l'application exécutable qui est intégré au shell Ubuntu/unity.
gl: No nivel máis íntimo, hai un sitio web que o desenvolvedor identifica por URL. O sitio web está representado e execútase nunha vista web de Oxide. Oxide é unha vista web Blink / Chrome personalizada para Ubuntu. A vista web de Oxide execútase e móstrase no recipiente webapp. O recipiente webapp é o tempo de execución do aplicativo executable que está integrado co shell Ubuntu / unidade.
it: Al livello più interno, c'è un sito web che lo sviluppatore identifica attraverso l'URL. Il sito Web viene renderizzato e viene eseguito in una webview Oxide. Oxide è una webview Blink/Chrome personalizzata per Ubuntu. La webview di Oxide viene eseguita e visualizzata nel contenitore webapp. Il webapp-container è il runtime dell'app eseguibile integrato con la shell di Ubuntu/unity.

source: Launching
fr: Le lancement
gl: Lanzamento
it: Lancio

source: You can launch a webapp from the terminal with:::
fr: Vous pouvez lancer une application web depuis le terminal avec :
gl: Podes iniciar un aplicativo web desde o terminal con :::
it: Ė possibile eseguire una webapp dal terminale con:::

source: For example:::
fr: Par exemple :
gl: Por exemplo:::
it: Per esempio:::

source: This simple form works, but almost every webapp also uses other features, such as URL containment with URL patterns as described below.
fr: Ce formulaire simple fonctionne, mais presque toutes les applications web utilisent également d'autres fonctionnalités, telles que le confinement d'URL avec des motifs URL comme décrit ci-dessous.
gl: Este sinxelo formulario funciona, pero case todos os aplicativos web tamén usan outras funcións, como a contención de URL con patróns de URL como se describe a continuación.
it: Questo semplice modulo funziona, ma quasi ogni webapp utilizza anche altre funzionalità, come il contenimento degli URL con pattern URL come descritto qui di seguito.

source: User interface
fr: L'interface utilisateur
gl: Interface do usuario
it: Interfaccia utente

source: A webapp generally fills the entire app screen space, without the need of the UI controls generally found on standard browsers.
fr: Une application web remplit généralement tout l'espace de l'écran, sans avoir besoin des contrôles d'interface utilisateur que l'on trouve généralement sur les navigateurs standards.
gl: Un aplicativo web xeralmente enche todo o espazo da pantalla do aplicativo, sen a necesidade dos controis de interface de usuario que normalmente se atopan nos navegadores estándar.
it: Una webapp generalmente riempie l'intero spazio dello schermo dell'app, senza la necessità dei controlli dell'interfaccia utente presenti normalmente sui browser standard.

source: In some cases some navigation controls are appropriate, such as Back and Forward buttons, or a URL address bar. These are added as command line arguments:
fr: Dans certains cas, certains contrôles de navigation sont appropriés, tels que les boutons Précédent et Suivant, ou une barre d'adresse web. Ceux-ci sont ajoutés comme arguments en ligne de commande :
gl: Nalgúns casos algúns controis de navegación son apropiados, como botóns Atrás e Adiante, ou unha barra de enderezos URL. Estes engádense como argumentos da liña de comandos:
it: In alcuni casi i controlli di navigazione sono appropriati, come i pulsanti Indietro e Avanti o una barra degli indirizzi URL. Questi vengono aggiunti come argomenti della riga di comando:

source: ``--enable-back-forward`` Enable the display of the back and forward buttons in the toolbar (at the bottom of the webapp window)
fr: ``--enable-back-forward`` Activer l'affichage des boutons de retour et d'avance dans la barre d'outils (en bas de la fenêtre de l'application web)
gl: "--enable-back-forward" Habilite a visualización dos botóns atrás e adiante na barra de ferramentas (na parte inferior da xanela do aplicativo web)
it: `` --enable-back-forward`` Abilita la visualizzazione dei pulsanti back (indietro) e forward (avanti) nella barra degli strumenti (nella parte inferiore della finestra webapp)

source: ``--enable-addressbar`` Enable the display of the address bar (at the bottom of the webapp window)
fr: ``--enable-addressbar`` Activer l'affichage de la barre d'adresse (en bas de la fenêtre de l'application web)
gl: "--enable-addressbar" Activa a visualización da barra de enderezos (na parte inferior da xanela do aplicativo web)
it: `` --enable-address bar`` Abilita la visualizzazione della barra degli indirizzi (nella parte inferiore della finestra dell'app Web)

source: URL patterns
fr: Les modèles d'URL
gl: Patróns URL
it: Modelli di URL

source: Webapp authors often want to contain browsing to the target website. That is, the developer wants to control the URLs that can be opened in the webapp (all other URLs are opened in the browser). This is done with URL patterns as part of the webapp command line.
fr: Les auteurs d'applications Web veulent souvent confiner la navigation au site cible. Autrement dit, le développeur veut contrôler les liens qui peuvent être ouverts dans l'application Web (tous les autres liens sont ouverts dans le navigateur). Cela est réalisé avec les modèles de lien qui font partie de la ligne de commande de l'application Web.
gl: Os autores de Webapp a miúdo queren conter a navegación polo sitio web de destino. É dicir, o desenvolvedor quere controlar os URL que se poden abrir no aplicativo web (o resto de URL están abertos no navegador). Isto faise cos patróns de URL como parte da liña de comandos do aplicativo web.

source: However, many web apps use pages that are hosted over multiple sites or that use external resources and pages.
fr: Cependant, beaucoup d'applications web utilisent des pages qui sont hébergées sur plusieurs sites ou qui utilisent des ressources et des pages externes.
gl: Non obstante, moitos aplicativosweb utilizan páxinas aloxadas en varios sitios ou que utilizan páxinas e recursos externos.
it: Tuttavia, molte app Web utilizzano pagine ospitate su più siti o che utilizzano risorse e pagine esterne.

source: However, both containment and access to specified external URLs are implemented with URL patterns provided as arguments at launch time. Let’s take a closer look.
fr: Néanmoins, le confinement et l'accès aux liens externes spécifiés sont implémentés avec les modèles de lien fournis comme arguments au moment du lancement. Regardons de plus près.
gl: Non obstante, tanto a contención como o acceso a URL externas especificadas implementanse con patróns de URL proporcionados como argumentos no momento do lanzamento. Vexamos de preto.

source: Uncontained by default
fr: Non confiné par défaut
gl: Sen conter por defecto
it: Vuoto per default

source: By default, there is no URL containment. Suppose you launch a webapp without any patters and only a starting URL like this:::
fr: Par défaut, il n' y a pas de confinement d'URL. Supposons que vous lanciez une application web sans modèle et seulement une URL de démarrage comme ceci :
gl: Por defecto, non hai contención de URL. Supoñamos que inicia un aplicativo web sen patróns e só un URL de inicio coma este :::
it: Per impostazione predefinita, non vi è alcun contenuto URL. Supponiamo di avviare una webapp senza schemi e solo un URL iniziale come questo :::

source: The user can navigate to any URL without limitation. For example, if they click the Developer button at the top, they navigate to developer.ubuntu.com, and it displays in the webapp.
fr: L'utilisateur peut naviguer vers n'importe quelle URL sans limitation. Par exemple, s'il clique sur le bouton Developer en haut de la page, il accède à developer. ubuntu. com, qui s'affiche dans l'application web.
gl: O usuario pode navegar a calquera URL sen limitacións. Por exemplo, se premen o aplicativo web.
it: L'utente può raggiungere qualsiasi URL senza limiti. Ad esempio cliccando il pulsante Sviluppatore nella parte in alto, si arriva a developer.ubuntu.com, e mostra la webapp.

source: Tip: You can see the URL of the current page by enabling the address bar with ``--enable-addressbar``.
fr: Astuce : vous pouvez voir l'URL de la page courante en activant la barre d'adresse avec ``--enable-addressbar``.
gl: Consello: podes ver o URL da páxina actual habilitando a barra de enderezos con "--enable-addressbar".
it: Suggerimento: puoi vedere la URL della pagina attuale abilitando la barra degli indirizzi con ``--enable-addressbar``.

source: Simple containment to the site
fr: Le confinement simple au site
gl: Contención sinxela do sitio
it: Semplice contenuto al sito

source: One often wants to contain users to the site itself. That is, if the website is www.ubuntu.com, it may be useful to contain webapp users only to subpages of www.ubuntu.com. This is done by adding a wildcard URL pattern to the launch command, as follows:::
fr: On veut souvent confiner les utilisateurs au site lui-même. En d'autres termes, si le site Web est www.ubuntu.com, il peut être utile de ne confiner les utilisateurs de l'application web qu'aux sous-pages de www.ubuntu.com. Ceci est fait en ajoutant un modèle d'URL joker à la commande de lancement, comme suit :
gl: A miúdo quérese conter usuarios no sitio. É dicir, se o sitio web é www.ubuntu.com, pode ser útil que conteña usuarios de aplicativos web só en subpáxinas de www.ubuntu.com. Isto faise engadindo un patrón de URL comodín ao comando de inicio, do seguinte xeito :::
it: Alcune volte si vuole contenere gli utenti nel sito stesso. Cioè, se il sito web è www.ubuntu.com, potrebbe essere utile contenere gli utenti di webapp solo per le sottopagine di www.ubuntu.com. Questo viene fatto aggiungendo un pattern URL con caratteri jolly al comando di avvio, come segue :::

source: ``--webappUrlPatterns=`` indicates a pattern is next
fr: ``--webappUrlPatterns=`` indique qu'un modèle suit
gl: "--webappUrlPatterns =" indica que o seguinte patrón é
it: ``--Indirizzo Url del modello di webapp=`` indica il prossimo modello

source: http://www.ubuntu.com/* is the pattern The asterisk is a wildcard that matches any valid sequence of trailing (right-most) characters in a URL
fr: http://www.ubuntu.com/* est le modèle, où l'astérisque est un joker qui correspond à n'importe quelle séquence valide de caractères à la fin du lien
gl: http://www.ubuntu.com/* é o patrón O asterisco é un comodín que coincide con calquera secuencia válida de caracteres finais (á dereita) dun URL
