Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Congratulations! Your device will now boot into a super old version of Ubuntu Touch. You can now use the UBports Installer to install an updated version.
fr: Félicitations ! Votre appareil démarrera sous une version extrêmement ancienne d'Ubuntu Touch. Vous pouvez désormais utiliser l'installateur d'UBports pour installer une version mise à jour.
gl: Parabéns! O seu dispositivo agora arrincará nunha versión súper antiga de Ubuntu Touch. Agora podes usar o instalador de UBports para instalar unha versión actualizada.
it: Congratulazioni! Il tuo dispositivo si avvierà ora con una versione stravecchia di Ubuntu Touch. Ora puoi usare l'UBports Installer per l'installazione di una versione aggiornata.

source: This is the documentation for the UBports project. Our goal is to create an open-source (GPL if possible) mobile operating system that converges and respects your freedom.
fr: Ceci est la documentation du projet UBports. Notre but est de créer un système d'exploitation open source (sous licence GPL si possible), convergent, pour appareils mobiles et qui respecte vos libertés.
it: Questa è la documentazione del progetto UBports. Il nostro obiettivo è la creazione di un sistema operativo open-source (se possibile, GPL) che sia convergente e rispetti la tua libertà.

source: The UBports project was founded by Marius Gripsgard in 2015 and in its infancy was a place where developers could share ideas and educate each other in hopes of bringing the Ubuntu Touch platform to more and more devices.
fr: Le projet UBports a été fondé en 2015 par Marius Gripsgard. Le projet était à ses débuts un lieu où les développeurs pouvaient échanger des idées et des connaissances afin d'étendre toujours plus le nombre d'appareils accueillant Ubuntu Touch.
it: Il progetto UBports è stato fondato da Marius Gripsgard nel 2015 e nella sua infanzia è stato un luogo in cui gli sviluppatori potevano condividere idee ed educarsi a vicenda nella speranza di portare la piattaforma Ubuntu Touch a sempre più dispositivi.

source: After Canonical suddenly announced `their plans to terminate support of Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ in April of 2017, UBports and its sister projects began work on the open-source code, maintaining and expanding its possiblilities for the future.
fr: Après que Canonical a annoncé soudainement « sa volonté d'arrêter le développement d'Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/> »_ en avril 2017, UBports et ses projets frères ont commencé à travailler sur le code open source, en le maintenant et en étendant ses possibilités futures.
it: Nell'aprile del 2017, a seguito dell'improvviso annuncio di `porre termine al supporto di Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ , UBports (assieme ad altri progetti) decise di proseguire il lavoro sui codici sorgente del progetto, al fine di mantenerlo ed espanderne le potenzialità.

source: This documentation is always improving thanks to the members of the UBports community. It is written in ReStructuredText and converted into this readable form by `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, and `Read the Docs <https://readthedocs.io>`_. You can start contributing by checking out the :doc:`Documentation intro </contribute/documentation>`.
fr: Cette documentation s'améliore en permanence grâce aux membres de la communauté d'UBports. Elle est écrite en ReStructuredText et convertie dans cette forme lisible par `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, et `Read the Docs <https://readthedocs.io>`_. Vous pouvez commencer à contribuer en jetant un œil à :doc:`l'introduction à la documentation </contribute/documentation>`.
it: Questa documentazione è in continuo miglioramento grazie al costante contributo dei membri della comunità di UBports. È scritta in ReStructuredText e convertita in un formato leggibile con `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, e `Read the Docs <https://readthedocs.io>`_. È possibile contribuire consultando l':doc:`la relativa documentazione </contribute/documentation>`.

source: Since our quality assurance depends heavily on the community, we try to track issues where the user would expect them, instead of seperated by repository. This means, that issues of almost all components that are distributed as with the system-image are tracked in the `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. An exception of this are click-apps that can be updated independently through the OpenStore.
fr: Étant donné que notre assurance qualité dépend énormément de la communauté, nous essayons de faire le suivi des problèmes là où l'utilisateur irait naturellement, au lieu de le faire séparément pour chaque dépôt. Cela veut dire que les problèmes concernant à peu près tous les composants distribués avec l'image système sont suivis dans le `gestionnaire de suivi pour Ubuntu Touch <https://github.com/ubports/ubuntu-touch>`__. Les applications Click sont une exception car elles peuvent être mises à jour de façon indépendante via l'OpenStore.
it: Dal momento che la nostra garanzia di qualità dipende fortemente dalla comunità, tentiamo di tener traccia dei problemi dove gli utenti se lo aspettano, invece di repository separati. Ciò significa che i problemi di quasi tutti i componenti che sono distribuiti, come l'immagine di sistema, sono tracciati nel `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. Eccezion fatta per le click-app che possono essere aggiornate in forma indipendente attraverso l'OpenStore.

source: To increase transparency and communication, GitHub projects (Kanban-Boards) are used whereever practical. In case of github.com/ubports/ubuntu-touch, a single project is used for all issues. Projects support filtering by labels, so that only issues that belong to a specific team or affect a specific device can be viewed.
fr: Pour améliorer transparence et communication, les projets GitHub (tableaux kanban) sont utilisés partout où cela est pertinent du point de vue pratique. Dans le cas de github.com/ubports/ubuntu-touch, un seul projet est utilisé pour tous les suivis de problèmes. Les projets comportent un filtrage par mots-clés, afin que les suivis qui concernent une équipe spécifique ou un matériel spécifique puissent être recherchés et consultés facilement.
it: Per migliorare la trasparenza ed i flussi comunicativi, viene utilizzata la funzione "progetti" di GitHub (Kanban-Boards) laddove risulti pratico. Nel caso di github.com/ubports/ubuntu-touch, un unico progetto è usato per tenere traccia di tutti i problemi. I progetti hanno un supporto per filtrare secondo specifici "tag", in modo da facilitare la visualizzazione dei problemi che appartengono ad uno specifico gruppo di lavoro, o ad uno specifico dispositivo.

source: **None (awaiting triage)**: The issue has been approved by a member of the qa team and is awaiting review from the responsible development team. if the issue is a bug, instructions to reproduce are included in the issue description. if the issue is a feature request, it has passed a primary sanity check by the qa-team but has not yet been accepted by the responsible development-team.
fr: **None (awaiting triage)** (Aucun, en attente de tri) : Le problème a été approuvé par un membre de l'équipe de l'assurance qualité et attend une vérification par l'équipe de développement concernée. Si le problème est un bogue, les instructions pour le reproduire sont incluses dans la description du problème. Si le problème est une demande de fonctionnalité, il a passé une première vérification par l'équipe de l'assurance qualité mais n'a pas encore été accepté par l'équipe de développement concernée.
it: **Nessuno (in attesa di definirne una priorità)**: il report è stato approvato da un membro del gruppo di QA ed è in attesa di essere preso in carico dal responsabile del gruppo di sviluppo. Se il report riguarda un bug, le istruzioni per riprodurlo sono incluse nella descrizione del problema. Se è una richiesta di una funzionalità, il gruppo di QA ha già effettuato un controllo iniziale, ma non è ancora stato accettato dal responsabile del gruppo di sviluppo. In inglese, "None (awaiting triage)".

source: **Accepted**: The issue has been accepted by the responsible development-team. If the issue is a bugreport, the team has decided that it should be fixable and accepts the responsibility. If the issue is a featrue request, the team thinks it should be implemented as described.
fr: **Accepted** (Accepté) : Le problème a été accepté par l'équipe de développement concernée. Si le problème est un rapport de bogue, l'équipe a décidé qu'il pouvait être corrigé et en accepte la responsabilité. Si le problème est une demande de fonctionnalité, l'équipe pense que celle-ci peut être implémentée telle que décrite.
it: **Accettato**: il report è stato accettato dal responsabile del gruppo di sviluppo. Se il report riguarda un bug, il gruppo ha deciso che può essere risolto e ne accetta la responsabilità. Se è una richiesta di una funzionalità, il gruppo ritiene che possa essere implementato così come descritto. In inglese, "Accepted".

source: **Quality Assurance**: The patch is completed and has passed initial testing. The QA team will now review it and provide feedback. If problems are found, the issue is moved back to “Accepted”.
fr: **Quality Assurance** (Assurance qualité) : le correctif est finalisé et a passé les premiers tests. L'équipe de l'assurance qualité va maintenant le tester sur tous les matériels et fournir un retour. Si des dysfonctionnements sont trouvés, le problème est rétrogradé à l'état « Accepted » (Accepté).
it: **Quality Assurance**: la pezza è stata completata e ha passato il test iniziale. Il gruppo di QA la rivedrà e fornirà un responso. Se si non incontrassero problemi, sarebbe spostata in "Accettata" (Accepted).

source: **None (removed from the project)**: If the issue is open and labeled "help wanted", community contributions are required to resolve the issue. If it's closed, that means that either a patch has been released on the stable channel (a comment on the issue should link to the patch) or the issue has been rejected (labeled “wontfix”).
fr: **None (removed from the project)** (aucun, retiré du projet) : si le problème est ouvert et marqué « help wanted » (aide souhaitée), des contributions de la communauté sont nécessaires pour résoudre le problème. S'il est clos, alors soit un correctif a été fourni sur le canal stable (un commentaire sur le problème devrait alors être joint au correctif), soit le problème a été rejeté (marqué « wontfix » : ne sera pas corrigé).
it: **Niente (rimosso dal progetto)** (in inglese **None (removed from the project)**): se un problema è aperto ed etichettato come "necessita aiuto", la comunità è chiamata a risolverlo. Se è chiuso, significa che la pezza è stata rilasciata sul canale stabile (a cui si allega un commento) o il problema è stato rigettato (etichettato come "wontfix").

source: **bug**: This issue is a confirmed bug. If it's reproducable, reproduction steps are described.
fr: **bug** (bogue) : ce problème est confirmé être un bogue. S'il est reproductible, les étapes nécessaires à sa reproduction sont décrites.
it: **bug**: questo problema è stato confermato. `Se riproducibile, i passi per ricrearlo sono stati descritti.

source: **good first issue**: This issue is not critical and trivial to fix. It is reserved for new contributors as a place to start.
fr: **good first issue** (bon premier problème) : ce problème n'est pas critique et est relativement facile à corriger. Il est réservé aux nouveaux contributeurs pour démarrer.
it: **buono per iniziare**: Questo è un problema non critico e è facile da risolvere. Lo si riserva come punto di partenza per nuovi contributori.

source: Once a *developer* is assigned and starts working on the issue, it is moved to “In Development”. As soon as they have something to show for, the issue is closed and automatically moved to “Quality Assurance” for feedback from the QA team. If neccessary, the developer will provide hints on how to test his patch in a comment on the issue.
fr: Une fois qu'un *développeur* est assigné et commence à travailler sur le problème, celui-ci est déplacé dans « In Development » (En développement). Dès qu'une solution est disponible, le problème est déplacé dans « Quality Assurance » (Assurance Qualité) pour obtenir un retour. Si c'est nécessaire, le développeur peut fournir des pistes sur la façon de tester son correctif dans un commentaire sur le problème.
it: Una volta che uno *sviluppatore* è assegnato e inizia a lavorarci, il problema si sposta nello stato "In sviluppo" ("In Development"). Non appena c'è qualcosa da mostrare, lo si chiude e lo si sposta automaticamente in "Quality Assurance" in attesa di un riscontro dal Gruppo QA. Se necessario, lo sviluppatore potrà fornirà suggerimenti su come testare la patch nei commenti del problema.

source: The *QA-Team* tests the fix on all devices and provides feedback to the developer. If problems are found, the issue is re-opened and goes back to “Accepted”, else it’s moved to “Release Candidate” to be included in the next release.
fr: L'équipe de *l'assurance qualité* teste le correctif sur tous les appareils et fournit un retour au développeur. Si des problèmes sont trouvés, le problème retourne dans « Accepted » (Accepté), sinon il est déplacé dans « Release Candidate » (Version Candidate) pour être intégré dans la prochaine version.
it: Il *Gruppo QA* testa su tutti i dispositivi la soluzione e fornisce un riscontro allo sviluppatore. Se ci sono problemi, si riapre il problema e ritorna in "Accettato" (in inglese "Accepted"), altrimenti la si chiude e la si sposta in "Candidato per il rilascio" ("Release Candidate") per essere inclusa nel prossimo rilascio.

source: `Ubuntu Touch programming book <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__
fr: `Le livre de programmation d'Ubuntu Touch <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__
it: `Libro di programmazione di Ubuntu Touch <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__

source: If the library does not contain a CMake configuration, you need to use the `qmake` or `custom` template instead.
fr: Si la bibliothèque ne contient pas une configuration CMake, vous devez utiliser le modèle `qmake` ou `custom` à la place.
it: Se la libreria non contiene una configurazione CMake, è necessario utilizzare il template `qmake` o `custom`.

source: expire_on
it: scadere_il

source: `ISO8601 Extendendformat <https://www.w3.org/TR/NOTE-datetime>`_.
it: `ISO8601 Formato esteso <https://www.w3.org/TR/NOTE-datetime>`_.

source: replace_tag
it: sostituire_tag

source: emblem-counter
it: emblema-contatore

source: Emblem-counter
it: Emblema-contatore

source: visible
it: visibile

source: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ CLI
fr: L'interface en ligne de commande `Clickable <http://clickable.bhdouglass.com/en/latest/>`_
it: `Pacchetti Click <https://click.readthedocs.io/en/latest/>`_ CLI

source: `calculator-app on GitLab`_
fr: `calculator-app sur GitLab`_
it: `calcolatrice-app su GitLab`_

source: OpenStore
it: NegozioAperto (OpenStore)

source: Terminal
it: Terminale

source: How does a text gets translated (technical background)
fr: Comment un texte est-il traduit (informations techniques) ?
it: Come viene tradotto un testo (background tecnico)

source: Within a app strings are marked either this way ``i18n.tr("string")`` when using gettext or like this ``tr("string")`` when using QtLinguist. When the app is build those translatable strings are extracted and written into the *.pot* or *.ts* template files. The *.po* and *.ts* language files then need to be updated from their template.
fr: Dans une application, les chaînes sont marquées soit de cette façon ``i18n.tr("string")`` lorsqu'on utilise gettext, soit comme ceci ``tr("string")`` lorsqu'on utilise QtLinguist. Lorsque l'application est créée, ces chaînes traduisibles sont extraites et écrites dans les fichiers modèles *.pot* ou *.ts*. Les fichiers de langue *.po* et *.ts* doivent ensuite être mis à jour à partir de leur modèle.
it: All'interno di un'applicazione le stringhe sono contrassegnate in questo modo ``i18n.tr("string")`` quando si usa gettext o in questo modo ``tr("string")`` quando si usa QtLinguist. Quando l'applicazione viene creata, le stringhe traducibili vengono estratte e scritte nei file di template *.pot* o *.ts*. I file di lingua *.po* e *.ts* devono quindi essere aggiornati dal loro modello.

source: There are three common ways used to translate an app:
fr: Il existe trois façons habituelles de traduire une application :
it: Ci sono tre modi comuni utilizzati per tradurre un'app:

source: Team translation: We also have a `Translation Forum <https://forums.ubports.com/category/39/translations>`_ to discuss translating Ubuntu Touch and its core apps. Some projects are using Telegram or matrix groups too, and some teams are still using the Ubuntu Launchpad framework.
fr: Traduction en équipe : nous avons également un `Forum de traduction <https://forums.ubports.com/category/39/translations>`_ pour discuter de la traduction d'Ubuntu Touch et de ses applications principales. Certains projets utilisent également Telegram ou des groupes Matrix et certaines équipes utilisent passent par Ubuntu Launchpad.
it: Traduzione del team: Abbiamo anche un `Forum di traduzione <https://forums.ubports.com/category/39/translations>`_ per discutere di tradurre Ubuntu Touch e le sue applicazioni core. Alcuni progetti utilizzano anche i gruppi Telegram o Matrix, e alcune squadre utilizzano ancora il framework Ubuntu Launchpad.

source: Once you're logged in, the site is self-explanatory and you'll find there all the options and customization you can do.
fr: Une fois que vous serez connecté, le site est explicite et vous y trouverez toutes les options et personnalisations à votre disposition.
it: Una volta entrato, il sito non ha bisogno di spiegazioni e vi potrai trovare tutte le opzioni e le personalizzazioni possibili.

source: There are online gettext .po editors and those you can install in your computer. You can choose whatever editor you want, but we prefer to work with free software only. There are too many plain text editors and tools to help you translate *.po*/*.ts* files to put down a list here.
fr: Il existe des éditeurs gettext de fichiers .po en ligne et des que vous pouvez installer sur votre ordinateur. Vous pouvez choisir l'éditeur que vous voulez, mais nous préférons travailler uniquement avec des logiciels libres. Il existe trop d'éditeurs de texte simple et d'outils pour vous aider à traduire les fichiers *.po*/*.ts* pour en dresser la liste ici.
it: Esistono editor di gettext .po online e quelli che si possono installare nel computer. Potete scegliere l'editor che preferite, ma noi preferiamo lavorare solo con software libero. Esistono troppi editor e strumenti per la traduzione di file *.po*/*.ts* per elencarli qui.

source: For high quality translations it is recommended to go through all of the steps given below. Although if you are not familiar with building apps using clickable, skip the steps 4. to 6. You may not be able to translate the latest strings though. And you will not know if the strings fit into the apps layout.
fr: Pour des traductions de qualité, il est recommandé de suivre toutes les étapes indiquées ci-dessous. Toutefois, si vous n'êtes pas familier/ère avec la création d'applications à l'aide de « clickable », passez les étapes 4. à 6. Il se peut toutefois que vous ne puissiez pas traduire les dernières chaînes de caractères. Et vous ne saurez pas si les chaînes s'intègrent dans la mise en page de l'application.
it: Per traduzioni di alta qualità si consiglia di passare attraverso tutti i passaggi indicati di seguito. Anche se non si ha familiarità con le app di costruzione utilizzando clickable, saltare i passaggi 4. a 6. Potrebbe non essere in grado di tradurre le ultime stringhe però. E non saprai se le stringhe si adattano al layout delle app.

source: fork the apps repo into your GitHub or GitLab account
fr: Copiez le dépôt de l'application sur votre compte GitHub ou GitLab
it: creare un fork del repo apps nel proprio account GitHub o GitLab

source: clone the repo locally or use GitLab's online editor
fr: Clonez le dépôt localement ou utilisez l'éditeur en ligne de GitLab
it: clonare il repo localmente o utilizzare l'editor online GitLab

source: (optional) create a new branch for the translation
fr: Facultatif : créez une nouvelle branche pour la traduction
it: (opzionale) creare un nuovo ramo per la traduzione

source: build the app using clickable to get up-to-date *.pot*/*.ts* template files
fr: Générez l'application en utilisant clickable pour obtenir des fichiers modèles *.pot*/*.ts* à jour
it: costruire l'applicazione facendo clic per ottenere i file di modello *.pot*/*.ts*

source: update the desired *.po*/*.ts* language file(s) from the template
fr: Mettez à jour le(s) fichier(s) de langue *.po*/*.ts* souhaité(s) à partir du modèle
it: aggiornare il file di lingua *.po*/*.ts* desiderato dal modello

source: translate all strings
fr: Traduisez toutes les chaînes
it: tradurre tutte le stringhe

source: build and install the app on your device and test the translations
fr: Générez et installez l'application sur votre appareil puis testez les traductions
it: costruire e installare l'app sul tuo dispositivo e testare le traduzioni

source: (optional) repeat steps 6. and 7. until you are satisfied with your work
fr: Facultatif : répétez les étapes 6. et 7. jusqu'à ce que vous soyez satisfait/e de votre travail
it: (opzionale) ripetere i passi 6. e 7. fino a quando non sei soddisfatto del tuo lavoro

source: push the translated *.po*/*.ts* file(s) to your forked repo [do NOT commit *.pot*/*.ts* template files]
fr: Publiez le(s) fichier(s) *.po*/*.ts* traduit(s) vers votre dépôt cloné [ne pas envoyer les fichiers modèles *.pot*/*.ts*]
it: spingere il file *.po*/*.ts* tradotto nel repo predetto [non commettere *.pot*/*.ts* file template]

source: open an merge/pull request from your fork to the apps repo
fr: Ouvrez une demande de fusion de votre version au dépôt de l'application
it: aprire una richiesta di fusione/pull dalla tua fork al repo delle app

source: App main view
it: App vista principale

source: When an app starts, shows a generic splash screen (as in the image) or a custom one, then the main view.
it: Quando un'applicazione inizia, mostra uno schermo splash generico (come nell'immagine) o uno personalizzato, quindi la vista principale.

source: The standard parts of a main view or any other page may be:
it: Le componenti standard di una vista principale o di qualsiasi altra pagina possono essere:

source: Header
it: Intestazione

source: Display app name, leading area and trailing area icons.
it: Visualizza il nome dell'app, l'area principale e traccia l'area delle icone.

source: In this case, showing title and trailing actions.
it: In questo caso, mostra il titolo e le azioni finali.

source: Tabbed content
it: Contenuto a schede

source: To organize information under tabs.
it: Per organizzare le informazioni nelle schede.

source: Bottom edge menu
it: Menu sul bordo inferiore
