Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: **The second option** is based on ``libertine-launch``. It will execute your commands as user phablet in a completely set up container. So you may use this option to modify your files using installed packages.
fr: **La seconde option** est basée sur ``libertine-launch``. Elle exécutera vos commandes en tant qu'utilisateur dans un conteneur complètement mis en place. Vous pouvez donc utiliser cette option pour modifier vos fichiers en utilisant les paquets installés.
gl: ** A segunda opción ** baséase en "lanzamento libertino". Executará os teus comandos como phablet de usuario nun recipiente completamente configurado. Podes usar esta opción para modificar os teus ficheiros usando paquetes instalados.
it: **La seconda opzione** si basa su ``libertine-launch``. Tale soluzione permette di eseguire i comandi come l'utente phablet in un contenitore completamente configurato. È possibile utilizzare questa opzione per modificare i files utilizzando i pacchetti installati.

source: To get a shell as user ``phablet`` run::
fr: Pour obtenir une interface système en tant qu'utilisateur de ``phablet``, lancez::
gl: Para obter un intérprete de comandos como executar "phablet" ::
it: Per ottenere una shell come utente ``phablet`` esegui::

source: When you launch bash in this way you will not get any specific feedback to confirm that you are now *inside* the container. You can check ``ls /`` to confirm for yourself that you are inside the container. The listing of ``ls /`` will be different inside and outside of the container.
fr: Quand vous lancez bash de cette manière, vous n'aurez aucun retour confirmant que vous êtes à l'intérieur de ce conteneur. Vous pouvez cependant lancer ``ls /`` pour vérifier que vous êtes bien à l’intérieur de ce conteneur.
gl: Cando inicies bash deste xeito, non recibirás ningún comentario específico que confirme que agora estás dentro do recipiente. Podes comprobar "ls /" para confirmar por ti mesmo que estás dentro do recipiente. A lista de "ls /" será diferente dentro e fóra do recipiente.
it: Quando esegui bash in questo modo, non riceverai alcun feedback specifico per confermare che sei *dentro* il contenitore. Puoi controllare ``ls /`` per confermare che sei all'interno del contenitore. L'elenco di `` ls / `` sarà diverso all'interno e all'esterno del contenitore.

source: Accessing SD card
fr: Accéder à la carte mémoire
gl: Accedendo á tarxeta SD
it: Accesso alla scheda SD

source: In order to access your SD-card or any other part of the regular filesystem from inside your libertine container you must create a bind mount.
fr: Afin d'accéder à votre carte mémoire ou à toute autre partie du système de fichiers classique à partir de votre conteneur Libertine, vous devez créer un montage de la liaison.
gl: Para acceder á súa tarxeta SD ou a calquera outra parte do sistema de ficheiros normal desde o seu recipiente libertino, debe crear unha montaxe vinculante.
it: Per accedere alla tua scheda SD o a qualsiasi altra parte del filesystem canonico dall'interno del tuo contenitore libertine, devi creare un bind mount.

source: In order to add a bind mount use::
fr: Afin d'ajouter un montage de la liaison, utilisez ::
gl: Para engadir unha montaxe de vinculación, use ::
it: Per aggiungere un bind mount usa::

source: You can also make deep links in case you only want parts of your SD-card available in the container. In this case just the entire path to the directory you want to bind mount::
fr: Vous pouvez également créer des liens profonds au cas où vous ne souhaiteriez que certaines parties de votre carte mémoire dans le conteneur. Dans ce cas, il suffit d'indiquer le chemin d'accès complet au répertoire que vous voulez monter et lier::
gl: Tamén podes facer ligazóns profundas no caso de que só desexes partes da túa tarxeta SD dispoñibles no recipiente. Neste caso só o camiño completo ao directorio que desexa vincular mount ::
it: Puoi anche creare collegamenti diretti nel caso desideri che solo parti della tua scheda SD siano disponibili nel contenitore. In questo caso fornire l'intero percorso alla directory a cui si desidera associare il mount ::

source: This will not allow the container access to any of the directories earlier in the path for anything other than accessing your mounted directory.
fr: Cela ne permettra pas au conteneur d'accéder à l'un des répertoires situés plus haut dans le chemin d'accès pour autre chose que d'accéder à votre répertoire monté.
gl: Isto non permitirá que o contedor poida acceder a ningún dos directorios anteriores á ruta por outra cousa que non sexa acceder ao seu directorio montado.
it: Ciò non consentirà l'accesso al contenitore a nessuna delle precedenti directory nel percorso e per nessuna ragione, eccetto l'accesso alla directory montata.

source: In order to use the SD-card as extra space for your container, make sure first to format it using ext4 or similar. There is a mis-feature in udisk2 that mounts SD-cards (showexec) that ensures only files ending in .bat, .exe or .com can be executed from the drive if it is (v)fat formatted. This has been changed in other distributions allowing any file to have execute priviliges, but not ubuntu. The reccomended workaround is to add a udev rule to control how to mount a card with a given id, but since the udev rules are on the read only port on touch, this is not possible.
fr: Pour utiliser la carte mémoire comme espace supplémentaire pour votre conteneur, assurez-vous d'abord de la formater en utilisant le format ext4 ou un format similaire. Il existe une mauvaise fonctionnalité dans udisk2 qui permet de monter les cartes mémoire (showexec) qui garantit que seuls les fichiers se terminant par .bat, .exe ou .com peuvent être exécutés à partir du disque s'il est formaté en (v)fat. Cette caractéristique a été modifiée dans d'autres distributions, permettant à n'importe quel fichier d'avoir des privilèges d'exécution, mais pas dans Ubuntu. La solution recommandée est d'ajouter une règle udev pour contrôler comment monter une carte avec un identifiant donné, mais comme les règles udev sont sur le port en lecture seule sur appareil tactile, ceci n'est pas possible.
gl: Para usar a tarxeta SD como espazo adicional para o seu recipiente, asegúrese primeiro de formatala usando ext4 ou similar. Hai unha función errónea en udisk2 que monta tarxetas SD (showexec) que garante que só se poden executar arquivos que rematen en .bat, .exe ou .com dende a unidade se ten (v) formato de graxa. Isto cambiouse noutras distribucións que permiten que calquera ficheiro teña privilexios de execución, pero non ubuntu. A solución recomendada é engadir unha regra udev para controlar como montar unha tarxeta cunha identificación determinada, pero dado que as regras udev están no porto de só lectura ao tocar, isto non é posible.
it: Per utilizzare la scheda SD come spazio aggiuntivo per il tuo contenitore, assicurati prima di formattarla utilizzando ext4 o simile. C'è una funzionalità errata in udisk2 che monta schede SD (showexec) che garantisce che solo i file che terminano con .bat, .exe o .com possano essere eseguiti dall'unità se formattata (v)fat. Ciò è stato modificato in altre distribuzioni consentendo a qualsiasi file di avere privilegi di esecuzione, ma non in Ubuntu. La soluzione consigliata è aggiungere una regola udev per controllare come montare una scheda con un dato id, ma poiché le regole udev sono sulla porta in sola lettura in touch, questo non è possibile.

source: Shortcuts
fr: Raccourcis
gl: Atallos
it: Scorciatoie

source: If you want, you can add aliases for command line tools. Add lines like the following ones to your ``~/.bash_aliases``::
fr: Si vous le souhaitez, vous pouvez ajouter des alias pour les outils en ligne de commande. Ajoutez des lignes comme les suivantes à votre fichier ``~/.bash_aliases``::
gl: Se queres, podes engadir alias para ferramentas de liña de comandos. Engade liñas como as seguintes ás túas "~ / .bash_aliases" ::
it: Se vuoi, puoi aggiungere degli alias per gli strumenti della riga di comando. Aggiungi delle righe come le seguenti al file ``~/.bash_aliases``::

source: Background
fr: Arrière-plan
gl: Contexto

source: A display server coordinates input and output of an operating system. Most Linux distributions today use the X server. Ubuntu Touch does not use X, but a new display server called Mir. This means that standard X applications are not directly compatible with Ubuntu Touch. A compatibility layer called XMir resolves this. Libertine relies on XMir to display desktop applications.
fr: Un serveur d'affichage coordonne les entrées et les sorties d'un système d'exploitation. La plupart des distributions Linux utilisent de nos jours un serveur X. Ubuntu touch n'utilise pas de serveur X mais utilise un nouveau serveur d'affichage appelé Mir. Cela signifie que les applications standard X ne sont pas directement compatibles avec Ubuntu Touch. Une couche de compatibilité appelé XMir est nécessaire. Libertine utilise donc XMir pour afficher les applications de bureau.
gl: Un servidor de visualización coordina a entrada e saída dun sistema operativo. A maioría das distribucións de Linux hoxe en día utilizan o servidor X. Ubuntu Touch non usa X, pero si un novo servidor de visualización chamado Mir. Isto significa que os aplicativos estándar X non son directamente compatibles con Ubuntu Touch. Unha capa de compatibilidade chamada XMir resolve isto. Libertine confía en XMir para amosar aplicativos de escritorio.
it: Un server di visualizzazione coordina l'input e l'output di un sistema operativo. La maggior parte delle distribuzioni Linux oggi usa il server X. Ubuntu Touch non usa X, ma un nuovo server di visualizzazione chiamato Mir. Ciò significa che le applicazioni X standard non sono direttamente compatibili con Ubuntu Touch. Un livello di compatibilità chiamato XMir risolve questo problema. Libertine si affida a XMir per visualizzare le applicazioni desktop.

source: Another challenge is that Ubuntu Touch system updates are released as OTA images. A consequence of this is that the root filesystem is read only. Libertine provides a container with a read-write filesystem to allow the installation of regular Linux desktop applications.
fr: Un autre défi est que les mises à jours d'Ubuntu Touch sont délivrées par des images OTA. En conséquence, le système de fichier racine est en lecture seule. Libertine met à disposition un conteneur avec un système de fichier en mode lecture et écriture pour permettre l'installation d'applications Linux traditionnelles pour poste de travail.
gl: Outro desafío é que as actualizacións do sistema Ubuntu Touch sexan publicadas como imaxes OTA. Unha consecuencia disto é que o sistema de ficheiros raíz só se le. Libertine ofrece un recipiente cun sistema de ficheiros de lectura e escritura para permitir a instalación de aplicativos de escritorio Linux habituais.
it: Un'altra sfida è che gli aggiornamenti del sistema Ubuntu Touch sono rilasciati come immagini OTA. Una conseguenza di ciò è che il filesystem di root è di sola lettura. Libertine fornisce un contenitore con un filesystem in lettura-scrittura per consentire l'installazione di normali applicazioni desktop Linux.

source: Using location services
fr: Utilisation des services de localisation
gl: Usando servizos de localización
it: Utilizzo dei servizi di localizzazione

source: Location services in Ubuntu Touch allow apps to access your current location. Using this data, apps can `offer turn-by-turn navigation <https://open-store.io/app/navigator.costales>`__, `track your exercise paths <https://open-store.io/app/activitytracker.cwayne18>`__, `locate public transport near you <https://open-store.io/app/transport.zubozrout>`__, and more.
fr: Les services de localisation dans Ubuntu Touch permettent aux applications d'accéder à votre position actuelle. Grâce à ces données, les applications peuvent `vous offrir une navigation en temps réel <https://open-store.io/app/navigator.costales>`__, `suivre vos parcours d'entraînements <https://open-store.io/app/activitytracker.cwayne18>`__, `localiser des transports publics proches de vous <https://open-store.io/app/transport.zubozrout>`__, et bien plus encore.
gl: Os servizos de localización en Ubuntu Touch permiten ás aplicacións acceder á túa situación actual. Usando estes datos, os aplicativos poden `ofrecer navegación paso a paso <https://open-store.io/app/navigator.costales>` __, `rastrexar os camiños de exercicios <https://open-store.io/ app / activitytracker.cwayne18> `__,` localiza o transporte público preto de ti <https://open-store.io/app/transport.zubozrout> `__ e moito máis.
it: I servizi di localizzazione in Ubuntu Touch consentono alle applicazioni di accedere alla posizione corrente dell'utente. Utilizzando questi dati, le applicazioni possono `offrire una navigazione turn-by-turn <https://open-store.io/app/navigator.costales>`__, `tracciare i percorsi di allenamento <https://open-store.io/app/activitytracker.cwayne18>`__, `localizzare i trasporti pubblici nelle vicinanze <https://open-store.io/app/transport.zubozrout>`__ e altro ancora.

source: The location services built in to Ubuntu Touch are designed to protect your privacy -- you choose to permit or deny apps access to this data. Apps may only access your location data when the device screen is on and the app is in use.
fr: Les services de localisation intégrés à Ubuntu Touch sont conçus pour protéger votre vie privée : vous choisissez d'autoriser ou de refuser l'accès des applications à ces données. Les applications ne peuvent accéder à vos données de localisation que lorsque l'écran de l'appareil est allumé et que l'application est en cours d'utilisation.
gl: Os servizos de localización integrados en Ubuntu Touch están deseñados para protexer a súa privacidade; elixe permitir ou denegar o acceso dos aplicativos a estes datos. Os aplicativos só poden acceder aos teus datos de situación cando a pantalla do dispositivo está activada e a aplicativo está en uso.
it: I servizi di localizzazione integrati in Ubuntu Touch sono progettati per proteggere la tua privacy: tu scegli se consentire o negare alle app l'accesso a questi dati. Le app possono accedere ai dati sulla tua posizione solo quando lo schermo del dispositivo è acceso e l'app è in uso.

source: Checking if location services are enabled
fr: Vérifier si les services de localisation sont activés
gl: Comprobando se os servizos de localización están habilitados
it: Verifica se sono abilitati i servizi di localizzazione

source: The Location Indicator is displayed whenever location services are enabled. Normally, this indicator will appear to be dark.
fr: L'indicateur de localisation est affiché chaque fois que les services de localisation sont activés. Normalement, cet indicateur apparaîtra comme étant sombre.
gl: O indicador de localización móstrase sempre que se activan os servizos de localización. Normalmente, este indicador parecerá escuro.
it: L'Indicatore Posizione viene visualizzato ogni volta che i servizi di localizzazione sono abilitati. Normalmente, questo indicatore apparirà scuro.

source: The Location Indicator, showing location enabled but not in use
fr: L'indicateur de localisation, qui indique la localisation activée mais non utilisée
gl: O indicador de situación, que mostra a situación habilitada pero non en uso
it: L'Indicatore Posizione mostra la posizione abilitata ma non in uso

source: If an app is accessing location data, the Location Indicator brightens.
fr: Si une application accède à des données de localisation, l'indicateur de localisation s'éclaircit.
gl: Se un aplicativo accede a datos de localización, o indicador de situación brilla.
it: Se un'app sta accedendo ai dati sulla posizione, l'Indicatore Posizione si illumina.

source: The Location Indicator, showing location enabled and in use
fr: L'indicateur de localisation, qui indique la localisation activée et en cours d'utilisation
gl: O indicador de situación, que mostra a situación habilitada e en uso
it: L'Indicatore Posizione, mostra la localizzazione abilitata e in uso

source: Accessing location services settings
fr: Accès aux paramètres des services de localisation
gl: Acceso á configuración dos servizos de localización
it: Accesso alle impostazioni dei servizi di localizzazione

source: There are several ways to access settings related to location services in Ubuntu Touch.
fr: Il existe plusieurs façons d'accéder aux paramètres liés aux services de localisation dans Ubuntu Touch.
gl: Hai varias formas de acceder á configuración relacionadas cos servizos de localización en Ubuntu Touch.
it: In Ubuntu Touch esistono diversi modi per accedere alle impostazioni relative ai servizi di localizzazione.

source: Open location quick settings
fr: Ouvrir les paramètres rapides de localisation
gl: Abrir configuración rápida de localización
it: Apri le impostazioni rapide della localizzazione

source: The Location Indicator contains quick settings related to location services, including a switch to turn services on or off.
fr: L'indicateur de localisation contient des réglages rapides liés aux services de localisation, y compris un interrupteur pour activer ou désactiver les services.
gl: O indicador de localización contén configuración rápida relacionadas cos servizos de localización, incluído un interruptor para activar ou desactivar os servizos.
it: L'Indicatore Posizione contiene impostazioni rapide relative ai servizi di localizzazione, incluso un interruttore per attivare o disattivare i servizi.

source: To access these settings, press on the Location Indicator and pull down toward the bottom of the screen.
fr: Pour accéder à ces paramètres, appuyez sur l'indicateur de localisation et tirez vers le bas de l'écran.
gl: Para acceder a esta configuración, prema no indicador de situación e tire cara abaixo cara á parte inferior da pantalla.
it: Per accedere a queste impostazioni, premere sull'Indicatore Posizione e tirare verso il basso verso la parte inferiore dello schermo.

source: If location services are disabled, you can access the location quick settings by pressing on any other indicator and pulling down. Then, scroll through the icons at the top of the screen to find Location. Select Location to open the quick settings.
fr: Si les services de localisation sont désactivés, vous pouvez accéder aux paramètres rapides de localisation en appuyant sur n'importe quel autre indicateur et en tirant vers le bas. Ensuite, faites défiler les icônes en haut de l'écran pour trouver la localisation. Sélectionnez Localisation pour ouvrir les paramètres rapides.
gl: Se os servizos de localización están desactivados, pode acceder á configuración rápida de localización premendo calquera outro indicador e tirando cara abaixo. A continuación, desprácese polas iconas da parte superior da pantalla para atopar a localización. Seleccione Localización para abrir a configuración rápida.
it: Se i servizi di localizzazione sono disabilitati, puoi accedere alle impostazioni rapide della localizzazione premendo su qualsiasi altro indicatore e tirando verso il basso. Poi fai scorrere le icone nella parte superiore dello schermo per trovare Posizione. Seleziona Posizione per aprire le impostazioni rapide.

source: Open location settings in the settings app
fr: Ouvrir les paramètres de localisation dans l'application Paramètres du système
gl: Abra a configuración de localización no aplicativo da configuración
it: Aprire le impostazioni di localizzazione nell'app delle impostazioni

source: The system settings app can be used to control location services. There are more controls in the system settings app than in the Location Indicator.
fr: L'application Paramètres du système peut être utilisée pour contrôler les services de localisation. Il y a plus de contrôles dans l'application Paramètres du système que dans l'indicateur de localisation.
gl: O aplicativo de configuración do sistema pode usarse para controlar os servizos de localización. Hai máis controis no aplicativo de configuración do sistema que no indicador de situación.
it: L'app delle impostazioni di sistema può essere utilizzata per controllare i servizi di localizzazione. Nell'app delle impostazioni di sistema ci sono più controlli rispetto l'Indicatore Posizione.

source: There are two ways to access location services controls in the system settings app.
fr: Il y a deux façons d'accéder aux contrôles des services de localisation dans l'application Paramètres du système.
gl: Hai dous xeitos de acceder aos controis dos servizos de localización no aplicativo de configuración do sistema.
it: Esistono due modi per accedere ai controlli dei servizi di localizzazione nell'app delle impostazioni di sistema.

source: Quick settings
fr: Paramètres rapides
gl: Configuración rápida
it: Impostazioni rapide

source: `Open location quick settings`_, then select ``Location settings...``.
fr: `Ouvrez les paramètres rapides de localisation`_, puis sélectionnez ``Paramètres de localisation...``.
gl: `Abrir configuración rápida de localización`_ e logo seleccione“ Configuración da localización ... “.
it: Aprire le impostazioni rapide di localizzazione`_, quindi selezionare ``Impostazioni di localizzazione...``.

source: System settings app
fr: Application Paramètres du système
gl: Aplicativo de configuración do sistema
it: App impostazioni di sistema

source: Launch the ``System Settings`` app. Select ``Security & Privacy``, then select ``Location``.
fr: Lancez l'application ``Paramètres du système``. Sélectionnez ``Sécurité & Vie privée``, puis sélectionnez ``Localisation``.
gl: Inicia o aplicativo "Configuración do sistema". Selecciona "Seguridade e privacidade" e logo selecciona "Localización".
it: Avvia l'app ``Impostazioni di sistema`` . Seleziona ``Sicurezza e privacy``, quindi seleziona ``Posizione``.

source: Enabling or disabling location services
fr: Activer ou désactiver les services de localisation
gl: Activación ou desactivación dos servizos de localización
it: Abilitazione o disabilitazione dei servizi di localizzazione

source: If location services are on, apps which you have allowed access to your location data may request your current location. Location services are enabled by default on Ubuntu Touch.
fr: Si les services de localisation sont activés, les applications auxquelles vous avez autorisé l'accès à vos données de localisation peuvent demander votre position actuelle. Les services de localisation sont activés par défaut sur Ubuntu Touch.
gl: Se os servizos de localización están activados, os aplicativos ás que permitiches acceder aos teus datos de situación poden solicitar a túa situación actual. Os servizos de localización están habilitados de xeito predeterminado en Ubuntu Touch.
it: Se i servizi di localizzazione sono attivi, le app a cui hai consentito l'accesso ai dati sulla tua posizione potrebbero richiedere la tua posizione corrente. Nelle impostazioni predefinite di Ubuntu Touch i servizi di localizzazione sono abilitati.

source: If location services are off, apps will not be able to access your current location.
fr: Si les services de localisation sont désactivés, les applications ne pourront pas accéder à votre localisation actuelle.
gl: Se os servizos de localización están desactivados, os aplicativos non poderán acceder á túa situación actual.
it: Se i servizi di localizzazione sono disabilitati, le app non saranno in grado di accedere alla tua posizione corrente.
