Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Check that you typed the file name correctly
fr: Vérifiez que vous avez correctement saisi le nom du fichier
gl: Comprobe se escribiu correctamente o nome do ficheiro
it: Controlla di aver scritto correttamente il nome del file

source: If the APK does not reside in the current folder where you execute adb, you have to specify the full path, e.g. ``/home/phablet/Downloads/my-app.apk`` instead of just ``my-app.apk``
fr: Si l'APK ne se trouve pas dans le dossier actuel et dans le quel vous exécutez la commande ADB, vous devez spécifier le chemin complet, par exemple ``/home/phablet/Downloads/my-app.apk`` au lieu de juste ``my-app.apk``
gl: Se o APK non reside no cartafol actual onde executas adb, tes que especificar a ruta completa, por exemplo. "/ home / phablet / Downloads / my-app.apk" en lugar de só "my-app.apk"
it: Se l'APK non risiede nella cartella corrente dove esegui adb, devi specificarne il percorso completo, per esempio: ``/home/phablet/Downloads/my-app.apk`` invece di ``my-app.apk``

source: Reporting bugs
fr: Signaler des bugs
gl: Información de erros
it: Report di bug (bachi)

source: Please :doc:`report any bugs </contribute/bugreporting>` you come across. Bugs with Ubuntu Touch 16.04 are reported in `the normal Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch/issues>`_ and issues with Anbox are reported on `our downstream fork <https://github.com/ubports/anbox/issues>`_. Thank you!
fr: Veuillez :doc:`signaler tout problème </contribute/bugreporting>` que vous rencontrez. Les problèmes concernant Ubuntu Touch 16.04 sont signalés dans `la liste de suivi normal d'Ubuntu Touch <https://github.com/ubports/ubuntu-touch/issues>`_ et les problèmes concernant Anbox sont signalés dans `notre version modifiée en aval <https://github.com/ubports/anbox/issues>`_. Merci !
gl: Por favor: doc: `informe de calquera erro </ contribute / bugreporting>` que atopes. Os erros con Ubuntu Touch 16.04 infórmanse no `rastreador normal de Ubuntu Touch <https://github.com/ubports/ubuntu-touch/issues>` _ e os problemas con Anbox infórmanse no `noso fork descendente <https: // github .com / ubports / anbox / issues> `_. Grazas!
it: Per favore :doc:`segnala eventuali bug </contribute/bugreporting>` in cui ti imbatti. I bug relativi a Ubuntu Touch 16.04 sono segnalati`nel normal Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch/issues>`_ e i problemi relativi ad Anbox sono segnalati nel `nostro downstream fork <https://github.com/ubports/anbox/issues>`_. Grazie!

source: Daily use
fr: Utilisation quotidienne
gl: Uso diario
it: Uso quotidiano

source: This section of the documentation details common tasks that users may want to perform while using their Ubuntu Touch device.
fr: Cette rubrique de la documentation détaille les tâches communes que les utilisateur peuvent effectuer lors de l'utilisation de leur appareil Ubuntu Touch.
gl: Esta sección da documentación detalla as tarefas comúns que os usuarios poden querer realizar mentres usan o seu dispositivo Ubuntu Touch.
it: Questa sezione della documentazione descrive le attività comuni che gli utenti potrebbero voler eseguire durante l'utilizzo del loro dispositivo Ubuntu Touch.

source: Run desktop applications
fr: Lancer des applications desktop
gl: Execución dos aplicativos do escritorio
it: Esegui applicazioni desktop

source: Libertine allows you to use standard desktop applications in Ubuntu Touch.
fr: Libertine vous permet d'utiliser des applications desktop dans Ubuntu Touch.
gl: Libertine permítelle usar aplicativos de escritorio estándar en Ubuntu Touch.
it: Libertine ti consente di utilizzare le applicazioni desktop standard in Ubuntu Touch.

source: To install applications you may use the phone's *Settings* interface or you may use the command line as described further below.
fr: Pour installer des applications, vous pouvez utiliser l'interface *Paramètres* du téléphone ou utiliser la ligne de commande comme décrit plus loin.
gl: Para instalar aplicativos pode usar a interface * Configuración * do teléfono ou pode usar a liña de comandos como se describe máis adiante.
it: Per installare applicazioni è possibile utilizzare l'interfaccia * Impostazioni * del telefono oppure è possibile utilizzare la riga di comando come descritto di seguito.

source: Manage containers
fr: Gérer les conteneurs
gl: Xestor de contidos
it: Gestire i contenitori

source: Create a container
fr: Créer un conteneur
gl: Creación dun recipiente
it: Creare un contenitore

source: The first step is to create a container where applications can be installed:
fr: La première étape est de créer un conteneur dans lequel les applications peuvent être installées ::
gl: O primeiro paso é crear un recipiente onde os aplicativos van ser instalados:
it: Il primo passo è quello di creare un contenitore in cui poter installare le applicazioni::

source: Open Settings and scroll down to *Libertine* under the *System* sub-heading.
fr: Ouvrez l'application Paramètres du système et faites défiler vers le bas jusqu'à *Libertine* sous la section *Système*.
gl: Abre Configuración e desprázate cara abaixo ata * Libertine * baixo o subtítulo * Sistema *.
it: Apri Impostazioni e scorri verso il basso fino a * Libertine * nel sottoelenco * Sistema *.

source: Tap *Libertine* to get to the *Manage Libertine Containers* sub-menu. If you have other containers already installed, they will be visible here. Tap the + sign at the upper right to add a container.
fr: Appuyez sur *Libertine* pour accéder au sous-menu *Gestion des conteneurs de Libertine*. Si vous avez d'autres conteneurs déjà installés, ils seront visibles ici. Appuyez sur le signe + en haut à droite pour ajouter un conteneur.
gl: Toca * Libertine * para acceder ao submenú * Administrar recipientes Libertine *. Se xa tes outros recipientes instalados, serán visibles aquí. Prema o signo + na parte superior dereita para engadir un recipiente.
it: Tocca * Libertine * per accedere al sottomenu * Gestisci Contenitori Libertine *. Se hai altri contenitori già installati, saranno visibili qui. Tocca il segno + in alto a destra per aggiungere un contenitore.

source: The *Container Options* dialog box will open asking you to enter a container name and password if desired. Confirm your entries by tapping OK, and the container will be created.
fr: La boîte de dialogue *Options du conteneur* s'ouvre et vous demande de saisir un nom de conteneur et un mot de passe si vous le souhaitez. Confirmez vos saisies en appuyant sur « Valider » et le conteneur sera créé.
gl: Abrirase o cadro de diálogo * Opcións do recipiente * solicitándolle que introduza un nome e un contrasinal do recipiente se o desexa. Confirma as túas entradas premendo Aceptar e crearase o recipiente.
it: La finestra di dialogo * Opzioni Contenitore * si aprirà chiedendoti di inserire un nome per il contenitore e, se lo desideri, una password. Conferma quanto inserito toccando OK e il contenitore verrà creato.

source: To do this via command line follow these steps::
fr: Pour ce faire, suivez les étapes suivantes en ligne de commande ::
gl: Para facer isto vía liña de comando siga estes pasos::
it: Per far questo via linea di comando segui questi passi::

source: You can add extra options such as:
fr: Vous pouvez ajouter des options supplémentaires comme:
gl: Pode engadir opcións extra como:
it: Puoi aggiungere opzioni extra come:

source: ``-n name`` name is a more user friendly name of the container
fr: ``-n name`` remplacer name par un nom facile à retenir à donner au conteneur
gl: O nome "-n name" é un nome máis fácil de usar do recipiente
it: `` -n nome`` è un nome più user friendly per il contenitore

source: ``-t type`` type can be either ``chroot`` or ``lxc``. Default is ``chroot`` and is compatible with every device. If the kernel of your device supports it then ``lxc`` is suggested.
fr: ``-t type`` le type peut être soit ``chroot`` soit ``lxc``. Le type par défaut est ``chroot`` et est compatible avec tous les appareils. Si le noyau de votre appareil le prend en charge, ``lxc`` est alors suggéré.
gl: O tipo "-t tipo" pode ser "chroot" ou "lxc". O predeterminado é "chroot" e é compatible con todos os dispositivos. Se o núcleo do teu dispositivo o admite, suxírese "lxc".
it: Il tipo `` -t type`` può essere `` chroot`` o `` lxc``. L'impostazione predefinita è `` chroot`` ed è compatibile con ogni dispositivo. Se il kernel del tuo dispositivo lo supporta, allora è suggerito `` lxc``.

source: The creating process can take some time, due to the size of the container (some hundred of megabytes).
fr: Le processus de création peut prendre du temps en raison de la taille du conteneur (quelques centaines de mégaoctets).
gl: O proceso de creación pode levar moito tempo debido ao tamaño do recipiente (uns centos de megabytes).
it: Il processo di creazione può richiedere del tempo, a causa delle dimensioni del contenitore (alcune centinaia di megabyte).

source: The ``create`` command shown above cannot be run directly in the terminal app, due to apparmor restrictions. You can run it from another device using either ``adb`` or ``ssh`` connection. Alternatively, you can run it from the terminal app using a loopback ssh connection running this command: ``ssh localhost``.
fr: La commande ``create`` montrée ci-dessus ne peut pas être lancée directement dans l'application Terminal du fait de restrictions Apparmor. Vous pouvez la lancer depuis un autre appareil en utilisant soit une connexion ``adb`` soit une connexion ``ssh``. Autrement, vous pouvez la lancer depuis l'application Terminal en utilisant une connexion SSH « loopback » en lançant la commande : ``ssh localhost``.
gl: O comando "crear" que se mostra anteriormente non se pode executar directamente no aplicativo terminal, debido a restricións do apoderador. Podes executalo desde outro dispositivo usando a conexión "adb" ou "ssh". Alternativamente, podes executalo desde o aplicativo terminal usando unha conexión ssh loopback que executa este comando: "ssh localhost".
it: Il comando `` create`` mostrato sopra non può essere eseguito direttamente nell'app terminale a causa delle restrizioni dell'apparmor. Puoi eseguirlo da un altro dispositivo sia usando la connessione `` adb`` che `` ssh``. In alternativa, è possibile eseguirlo dall'app terminale utilizzando una connessione ssh loopback eseguendo questo comando: `` ssh localhost``.

source: List containers
fr: Liste des conteneurs
gl: Facer unha lista de recipientes
it: Lista dei contenitori

source: Use the *Settings Manage Libertine Containers* sub-menu to list all the containers you have created on the device.
fr: Utilisez le sous-menu *Paramètres / Gérer les conteneurs de Libertine* pour lister tous les conteneurs que vous avez créés sur l'appareil.
gl: Utilice o submenú * Configuración Xestionar contedores Libertine * para listar todos os recipientes que creou no dispositivo.
it: Usa il sottomenu *Impostazioni Gestisci Contenitori Libertine* per elencare tutti i contenitori che hai creato sul dispositivo.

source: You can also use the command line. Run::
fr: Vous pouvez également utiliser la ligne de commande. Exécutez ::
gl: Pode tamén usar a liña do comando. Execute::
it: Puoi anche usare la riga di comando. Esegui::

source: Destroy a container
fr: Détruire un conteneur
gl: Destrución dun recipiente
it: Distruggere un contenitore

source: Manage applications
fr: Gérer les applications
gl: Xestión de aplicativos
it: Gestione applicazioni

source: Once a container is set up, the installed applications are available in the app drawer. You can also tap the name of the container in the *Manage Libertine Containers* menu.
fr: Une fois qu'un conteneur est configuré, les applications installées sont disponibles dans le lanceur des applications. Vous pouvez également appuyer sur le nom du conteneur dans le menu *Gestion des conteneurs de Libertine*.
gl: Unha vez configurado un repcipiente, os aplciativos instalados estarán dispoñibles no caixón de aplicativos. Tamén pode tocar o nome do recipiente no menú * Xestionar recipientes de Libertine *.
it: Una volta impostato un contenitore, le applicazioni installate sono disponibili nel cassetto delle app. Puoi anche toccare il nome del contenitore nel menu *Gestisci Contenitori Libertine*.

source: You can also list them via command line::
fr: Vous pouvez également les lister via la ligne de commande ::
gl: Pode tamén listalos a través da liña do comando::
it: Puoi anche elencarli tramite la riga di comando::

source: Install a package
fr: Installer un paquet
gl: Instalar un paquete
it: Installare un pacchetto

source: From the apps list in the *Manage Libertine Containers* menu tap the + sign to get a dialog box to add a package.
fr: Dans la liste des applications du menu *Gérer les conteneurs de Libertine*, appuyez sur le signe + pour ouvrir une boîte de dialogue permettant d'ajouter un paquet.
gl: Na lista de aplicativos do menú * Xestionar recipientes Libertine * prema o signo + para obter un cadro de diálogo para engadir un paquete.
it: Dall'elenco delle app nel menu * Gestisci Contenitori Libertine * tocca il segno + per visualizzare una finestra di dialogo per aggiungere un pacchetto.

source: Enter the package name if you know it. Otherwise you can search the archives for a package. You can make this process easier by making the *Lubuntu Software Center* your first package install. Being a desktop app, you will need to use the *Libertine Tweak Tool* in the *Open Store* to make the text large enough to read on a mobile device.
fr: Saisissez le nom du paquet si vous le connaissez. Sinon, vous pouvez rechercher un paquet dans les archives. Vous pouvez faciliter ce processus en installant en premier le paquet de la *Logithèque de Lubuntu*. Comme il s'agit d'une application de bureau, vous devrez utiliser l'outil de *Personnalisation de Libertine* dans l'*Open Store* pour rendre le texte suffisamment grand pour qu'il puisse être lu sur un appareil mobile.
gl: Introduza o nome do paquete se o sabe. Se non, pode buscar un paquete nos arquivos. Pode facilitar este proceso facendo do * Lubuntu Software Center * a súa primeira instalación de paquetes. Ao ser un aplicativon de escritorio, terás que empregar a * Libertine Tweak Tool * na * Open Store * para facer o texto o suficientemente grande como para ler nun dispositivo móbil.
it: Se lo conosci inserisci il nome del pacchetto. Altrimenti puoi cercare un pacchetto negli archivi. È possibile semplificare questo processo installando per primo il pacchetto * Lubuntu Software Center *. Essendo un'app desktop, dovrai utilizzare * Libertine Tweak Tool * in * Open Store * per rendere il testo abbastanza grande da poter essere letto su un dispositivo mobile.

source: Packages may also be installed via command line::
fr: Les paquets peuvent également être installés via la ligne de commande ::
gl: Os paquetes tamén se poden instalar a través da liña de comandos:
it: I pacchetti possono anche essere installati tramite riga di comando::

source: Remove a package
fr: Supprimer un paquet
gl: Eliminar un paquete
it: Rimuovere un pacchetto

source: On the package list, within the container (*System Settings* > *Libertine* > *Manage Libertine Containers* > *CONTAINER NAME*), swipe right on the package you want to remove to reveal the option to remove the package.
fr: Sur la liste des paquets, dans le conteneur (*Paramètres du système* > *Libertine* > *Gérer les conteneurs de Libertine* > *NOM DU CONTENEUR*), faites glisser à droite sur le paquet que vous voulez supprimer pour révéler l'option de suppression du paquet.
gl: Na lista de paquetes, dentro do recipiente (* Configuración do sistema *> * Libertine *> * Xestionar recipientes Libertine *> * NOME DO CONTENEDOR *), pase o dedo cara á dereita sobre o paquete que desexa eliminar para mostrar a opción de eliminar o paquete.
it: Nell'elenco dei pacchetti, all'interno del contenitore (* Impostazioni di sistema *> * Libertine *> * Gestisci Contenitori Libertine *> * NOME CONTENITORE *), scorri verso destra il pacchetto che desideri rimuovere per far apparire l'opzione per rimuovere il pacchetto.

source: Or you can remove the package via the command line::
fr: Vous pouvez aussi retirer le paquet via la ligne de commande ::
gl: Ou pode eliminar o paquete a través da liña do comando::
it: Oppure puoi rimuovere il pacchetto via riga di comando::

source: If you have more than one container, then you can use the option ``-i CONTAINER-IDENTIFIER`` to specify for which container you want to perform an operation.
fr: Si vous avez plus d'un conteneur ; alors vous pouvez utiliser l'option ``-i CONTAINER-IDENTIFIER`` pour spécifier pour quel conteneur vous voulez effectuer cette opération.
gl: Se tes máis dun recipiente, podes empregar a opción "-i CONTAINER-IDENTIFIER" para especificar para que recipiente desexa realizar unha operación.
it: Se si dispone di più di un contenitore, è possibile utilizzare l'opzione `` -i CONTAINER-IDENTIFIER`` per specificare per quale contenitore si desidera eseguire un'operazione.

source: Run desktop application
fr: Lancer des applications de bureau
gl: Execcución dos aplicactivos do escritorio
it: Eseguire un'applicazione desktop

source: Run it from the app menu like any other app. To start a graphical application from the command line, for example ``gedit``, run in a terminal::
fr: Lancez-la à partir de la liste des applications comme n'importe quelle autre application. Pour lancer une application graphique à partir de la ligne de commande, par exemple ``gedit``, exécutez dans un terminal ::
gl: Execútea desde o menú do aplicativo como calquera outro aplicativo. Para iniciar un aplicativo gráfico desde a liña de comandos, por exemplo "gedit", execute nun terminal ::
it: Eseguila dal menu delle app come qualsiasi altra app. Per avviare un'applicazione grafica dalla riga di comando, per esempio `` gedit '', in un terminale eseguire::

source: Files
fr: Fichiers
gl: Ficheiros
it: File

source: Libertine applications do have access to these folders:
fr: Les applications Libertine ont accès à ces dossiers :
gl: Os aplicativos do Libertine teñen acceso aos cartafoles seguintes:
it: Le applicazioni Libertine hanno accesso a queste cartelle:

source: Documents
gl: Documentos
it: Documenti

source: Pictures
fr: Images
gl: Imaxes
it: Immagini

source: Downloads
fr: Téléchargements
gl: Descargas

source: Videos
fr: Vidéos
gl: Vídeos
it: Video

source: Tips
fr: Astuces
gl: Consellos
it: Suggerimenti

source: Locations
fr: Emplacements
gl: Ubicacións
it: Posizioni

source: For every container you create there will be two directories created:
fr: Pour chaque conteneur que vous créez, il y aura deux dossiers créés :
gl: Para cada recipiente que cre haberá dous directorios creados:
it: Per ogni contenitore che creerai verranno create due directory:

source: A root directory ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` and
fr: Un dossier racine ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` et
gl: Un directorio raíz "~ / .cache / libertine-container / CONTAINER-IDENTIFIER / rootfs /" e
it: Una cartella root ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` e

source: a user directory ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
fr: un dossier utilisateur ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
gl: un directorio de usuario "~ / .local / share / libertine-container / user-data / CONTAINER-IDENTIFIER /"
it: una directory utente `` ~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/ ``

source: Shell access
fr: Accès Shell
gl: Acceso á consola
it: Accesso alla shell

source: There are 2 options for executing commands inside the container.
fr: Il existe deux options pour exécuter des commandes à l'intérieur d'un conteneur.
gl: Hai 2 opcións para executar comandos dentro do recipiente.
it: Ci sono 2 possibili opzioni per eseguire comandi all'interno del contenitore.

source: **The first option** is based on ``libertine-container-manager exec``. It lets you run your commands as root. The drawback is that the container is not completely set up. So far we know that the `folders mentioned above (Documents, Music, ...) are not mounted <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>`_ i.e., the ``/home/phablet/`` directory is empty. Likewise the directory referenced in ``TMPDIR`` is not available which may lead to problems with software that tries to create temporary files or directories. You may use this option e.g., for installing packages.
fr: **La première option** est basée sur ``libertine-container-manager exec``. Elle vous laisse exécuter votre commande en tant qu'administrateur. L'inconvénient est que le conteneur n'est pas complètement configuré. Jusque-là, nous savons que les `dossiers mentionnés ci-dessus (Documents, Musique, ...) ne sont pas montés <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>`_ c'est-à-dire que le répertoire ``/home/phablet/`` est vide. De même, le répertoire référencé dans ``TMPDIR`` n'est pas disponible, ce qui peut poser des problèmes avec un logiciel qui essaye de créer des fichiers ou des répertoires temporaires. Vous pouvez utiliser cette option par exemple pour l'installation de paquets.
gl: ** A primeira opción ** baséase en "libertine-container-manager exec". Permítelle executar os seus comandos como root. O inconveniente é que o recipiente non está completamente configurado. Ata o de agora sabemos que os `cartafoles mencionados anteriormente (Documentos, Música, ...) non están montados <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the -real-home-dir # comment1273744_833984 /> "_ ie, o directorio" / home / phablet / "está baleiro. Do mesmo xeito o directorio referido en "TMPDIR" non está dispoñible, o que pode provocar problemas co software que intenta crear ficheiros ou directorios temporais. Podes usar esta opción, por exemplo, para instalar paquetes.
it: **La prima opzione** si basa su ``libertine-container-manager exec``. Ti permette di eseguire comandi con privilegi di root. Lo svantaggio è che il contenitore non viene completamente impostato. Finora sappiamo che `le cartelle spra citate (Documenti, Musica, ...) non sono montate <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>`_ per esempio, la cartella ``/home/phablet/`` è vuota. Allo stesso modo la cartella a cui si fa riferimento in ``TMPDIR`` non è disponibile e ciò può causare problemi al software che cerca di creare file o cartelle temporanee. È possibile utilizzare questa opzione, ad esempio, per installare pacchetti.

source: To execute a command you can use the following pattern::
fr: Pour exécuter une commande, vous pouvez utiliser le modèle suivant::
gl: Para executar un comando pode usar o seguinte patrón:
it: Per eseguire un comando è possibile utilizzare il seguente schema::

source: For example run::
fr: Par exemple, exécutez::
gl: Por exemplo, execute::
it: Per esempio esegui::

source: To get a shell into your container as ``root`` run::
fr: Pour obtenir un shell dans votre conteneur en tant que ``root`` lancer :
gl: Para obter unhashell no seu recipiente como execución "root":
it: Per ottenere una shell nel contenitore come ``root`` eseguire::
