Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Introduction
gl: Introdución

source: This is the documentation for the UBports project. Our goal is to create a Free and open-source (GPL if possible) mobile operating system that converges and respects your freedom.
gl: Esteé un documento para o proxecto UBports. O noso obxectivo é crear unsistema operativo para móbil de código aberto e de balde que converxa e respecte a súa liberdade.

source: About UBports
fr: À propos d'UBports
gl: Sobre UBports
it: A proposito di UBports

source: The UBports project was founded by Marius Gripsgard in 2015 and in its infancy was a place where developers could share ideas and educate each other in hopes of bringing the Ubuntu Touch platform to more mobile devices.
gl: O proxecto UBports vai ser creado por Marius Gripsgard en 2015 e, durante a primeira fase, era un sitio onde os desenvolvedores podían compartir ideas e formación con ilusión de traer á plataforma Ubuntu Touch a cada vez máis dispositivos.

source: After Canonical suddenly announced `their plans to terminate support of Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ in April 2017, UBports and its sister projects began work on the open-source code, maintaining and expanding its possibilities for the future.
gl: Despois de Canonical anunciar repentinamente os seus 'plans para terminar o soporte do Ubuntu touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ en Abril de 2017, UBports e os seus proxectos irmáns comezaron a traballar no codigo open-source, mantendo e expandindo as súas posibilidades para o futuro.

source: About the Documentation
fr: À propos de la documentation
gl: Sobre a documentación
it: Informazioni sulla documentazione

source: This documentation is always improving thanks to the members of the UBports community. It is written in ReStructuredText and converted into this readable form by `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, and `Read the Docs <https://readthedocs.io>`_. You can start contributing by checking out the :doc:`Documentation contribution document </contribute/documentation>`.
gl: Esta documentación está sempre a mellorar grazas aos membros da comunidade UBports. Está escrita en ReStructuredText e convertido nesta forma de lectura por `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, e `Read the Docs <https://readthedocs.io>`_. Pode comezar a contribuír lendo o :doc:`Documentation intro </contribute/documentation>`.

source: All documents are licensed under the Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_) license. Please give attribution to "The UBports Community".
fr: Tous les documents sont sous licence Creative Commons Attribution - Partage dans les Mêmes Conditions 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Veuillez donner l'attribution à « La Communauté d'UBports ».
gl: Todos os documentos están baixo a licenza Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Atribúa o crédito a "The UBports Community".
it: Tutti i documenti sono distribuiti con licenza Creative Commons Attribuzione - Condividi allo stesso modo 4.0 Internazionale (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Si prega di riconoscere la paternità dell'opera alla "communità di UBports".

source: Attribution
gl: Atribución
it: Attribuzione

source: This documentation was heavily modeled after the `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, attribution to Juan Linietsky, Ariel Manzur and the Godot community.
fr: Cette documentation s'est beaucoup inspirée de l'attribution de `la documentation du moteur Godot <http://docs.godotengine.org/en/stable/>`_, à Juan Linietsky, Ariel Manzur et la communauté de Godot.
gl: Esta documentación foi intensamente modelada seguindo a `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, atribución do crédito a Juan Linietsky, Ariel Manzur e a comunidade Godot.
it: Questa documentazione è stata pesantemente modellata sulla `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, i cui diritti sono di Juan Linietsky, Ariel Manzur e della comunità Godot.

source: Branch-naming convention
gl: Convención de Branch-naming

source: Our branch-naming conventions ensure that software can be built by our CI and tested easily by other developers.
gl: As nosas convencións de branch-naming garanten que o software pode ser construído polo noso CI e probado facilmente por outros desenvolvedores.

source: Every Git repository's README file should state which branch-naming convention is used and possible deviations from the norm.
gl: Todos os ficheiros README de todos os rexistros GIT deberían indicar que convención de branch-naming é usada e posibles desvios da norma.

source: Click-Packages
gl: Paquetes-click

source: Software that is exclusively distributed as a click-package (and not also as a deb) only uses one ``master`` branch that is protected. Separate temporary development branches with arbitrary descriptive names can be created and merged into master when the time comes. For marking and archiving milestones in development history, ideally Git tags or GitHub releases should be used.
gl: Software que é distribuído exclusivamente como un paquete-click (e non tamén como un deb) usa só unha ramificación `` master`` que é protexida. Ramos de desenvolvemento temporario separados con nomes descritivos arbitrarios poden ser creados e fundidos no mestre cando chegase a hora. Para marcar e arquivar marcos no histórico de desenvolvemento, idealmente, as etiquetas do Git ou as versións do GitHub deben ser usadas.

source: Deb-Packages
gl: Paquetes-deb

source: To make most efficient use of our CI system, a special naming convention for git-branches is used.
gl: Para facer un uso máis eficiente do noso sistema de CI, é usada unha convención de nomenclatura especial para git-branches.

source: For pre-installed Ubuntu Touch components, deb-packages are used wherever possible. This includes Core Apps, since they can still be independently updated using click-package downloads from the OpenStore. This policy allows us to make use of the powerful Debian build system to resolve dependencies.
gl: Para compoñentes pre-instalados do Ubuntu Touch, os deb-packages son usados sempre que posible. Isto inclúe os aplicativos principais, pois aínda poden ser actualizados de forma independente usando as descargas de paquete-click da OpenStore. Esta política permítenos usar o poderoso sistema de compilación de Debian para resolver dependencias.

source: Every repository that uses this convention will have branches for the actively supported Ubuntu releases referenced by their codenames (``bionic``, ``xenial``, ``vivid``, etc.). These are the branches that are built directly into the corresponding images and published on :doc:`repo.ubports.com <ppa>`. If no separate versions for the different Ubuntu bases are needed, the repository will just have one ``master`` branch and the CI system will still build versions for all actively supported releases and resolve dependencies accordingly.
gl: Cada rexistro que usa esta convención terá ramificacións para as versións activamente soportadas do Ubuntu referenciadas polos seus nomes de código (`` bionic``, `` xenial``, `` vivid``, etc.). Estas son as ramificacións que son construídas directamente nas imaxes correspondentes e publicadas en: doc: `repo.ubports.com <ppa>`. Se non fosen necesarias versións separadas para as diferentes bases do Ubuntu, o rexistro terá só unha ramificación `` master`` e o sistema de CI construirá aínda versións para todas as distribucións activamente soportadas e resolverá dependencias de acordo.

source: To build and publish packages based on another repository, an extension in the form of ``xenial_-_some-descriptive_extension`` can be used. The CI system will then resolve all dependencies using the ``xenial_-_some-descriptive_extension`` branch of other repositories or fall back on the normal ``xenial`` dependencies, if that doesn't exist. These special dependencies are not built into the image but still pushed to on :doc:`repo.ubports.com <ppa>`.
gl: Para construír e publicar paquetes baseados noutro rexistro, unha extensión na forma de `` xenial _-_ some-descrcript_extension`` pode ser usada. O sistema de CI irá entón resolver todas as dependencias usando a ramificación `` xenial _-_ uma-descrição_extensão`` doutros rexistros ou recorrerá ás dependencias `` xenial`` normais, se non existise. Estas dependencias especiais non son construídas na imaxe, mais aínda son enviadas a: doc: `repo.ubports.com <ppa>`.

source: Multiple branch extensions can be chained together in the form of ``xenial_-_dependency-1_-_dependency-2_-_dependency-3``. This means that the CI system will look for dependencies in the following repositories:
gl: Extensións múltiples poden ser encadeadas xuntas na forma de `` xenial _-_ dependência-1 _-_ dependência-2 _-_ dependência-3``. Isto significa que o sistema de CI procurará dependencias nos seguintes rexistros:

source: There is no prioritization, so the build system will always use the package with the highest version number or the newest build if the version is equal.
gl: Non hai priorización, por tanto, o sistema de compilación sempre usará o paquete co maior número de versión ou a compilación máis recente se a versión fose igual.

source: Dependency-file
gl: Ficheiro-dependencia

source: For complex or non-linear dependencies, a ``ubports.depends`` file can be created in the root of the repository to specify additional dependencies. The branch name will be ignored if this file exists.
gl: Para dependencias complexas ou non lineais, pódese crear un ficheiro ``ubports.depends`` na raíz do rexistro para especificar dependencias adicionais. O nome da sucursal ignorarase se existe este ficheiro.

source: The ``ubports.depends`` file is an **exclusive list**, so the build system will not resolve dependencies linearly like it does in a branch name! Every dependency has to be listed. You will almost always want to include your base release (i.e. ``xenial``).
gl: O ficheiro ``ubports.depends`` é unha **lista exclusiva**, polo que o sistema de compilación non resolverá dependencias de xeito lineal, como sucede nun nome de sucursal! Hai que enumerar todas as dependencias. Case sempre quererás incluír a túa versión base (é dicir, ``xenial``).

source: Processes
fr: Processus
gl: Procesos
it: Processi

source: This section of the documentation details standardized processes for different teams.
fr: Cette partie de la documentation détaille des processus standardisés pour les différentes équipes.
gl: Esta sección da documentación detalla procesos estandarizados para equipos diferentes.
it: Questa sezione della documentazione dettaglia processi standard per i diversi gruppi di lavoro.

source: The process definitions are still a work in progress and need to be completed by the respective teams.
fr: La définition des processus est encore en cours d'élaboration et nécessite d'être finalisée par les équipes concernées.
gl: As definicións do proceso son aínda un traball en marcha e necesitan ser completadas polos equipos respectivos.
it: La definizione dei processi è ancora in fase di sviluppo e deve essere tuttora completata dai rispettivi gruppi di lavoro.

source: Issue-Tracking Guidelines
fr: Recommandations pour le suivi des problèmes
gl: Guía de seguimento dos problemas
it: Linee guida per il rintracciamento di errori o bug

source: This document describes the standard process of dealing with new issues in UBports projects. Not to be confused with the :doc:`guide on writing a good bugreport </contribute/bugreporting>`.
fr: Ce document décrit la méthode standard de gestion des nouveaux problèmes dans les projets d'UBports. À ne pas confondre avec le :doc:`guide de rédaction d'un bon rapport de problème </contribute/bugreporting>`.
gl: Este documento describe o proceso estándar para tratar con novos problemas nos proxectos de UBports. Non confundir coa :doc:`guía para escribir un bo informe de erros </contribute/bugreporting>`.
it: Questo documento descrive la procedura standard per la gestione di nuovi problemi all'interno del progetto UBports. Da non conforndersi con la :doc:`guida per la segnalazione dei bug </contribute/bugreporting>`.

source: Where are bugs tracked?
fr: Où sont suivis les problèmes ?
gl: Onde se seguen os erros?
it: Dove vengono tracciati i bug?

source: Since our quality assurance depends heavily on the community, we try to track issues where the user would expect them, instead of separated by repository. This means, that issues of almost all components that are distributed as with the system-image are tracked in the `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. An exception of this are click-apps that can be updated independently through the OpenStore.
gl: Dado que a nosa garantía de calidade depende en gran medida da comunidade, intentamos rastrexar os problemas nos que o usuario os esperaría, en lugar de separalos por un rexistro. Isto significa que os problemas de case todos os compoñentes que se distribúen como coa imaxe do sistema se rastrexan no rastreador táctil de Ubuntu <https://github.com/ubports/ubuntu-touch> `__. Unha excepción disto son os aplicativos de click que se poden actualizar de forma independente a través de OpenStore.

source: Most other repositories track issues locally. If you're unsure whether a repository uses its own tracker or not, consult the README.md file. Repositories that don't track issues locally have their bugtracker disabled.
fr: La plupart des autres dépôts font un suivi des problèmes localement. Si vous n'êtes pas sûr(e) de savoir si un dépôt utilise son propre suivi ou non, consultez le fichier README.md. Les dépôts qui ne suivent pas les problèmes localement ont leur système de suivi de problèmes désactivé.
gl: A maioría dos outros rexistros seguen os problemas localmente. Se non está seguro de se un rexistro usa o seu propio seguimento ou non, consulte el archivo README.md. Os rexistros que non seguen os problemas localmente teñen o seu seguimento de erros deshabilitado.
it: Molti degli ambienti tengono traccia dei problemi a livello locale. Se non sei sicuro se un repository usa il proprio sistema di tracciamento o no, consulta il file README.md . I repository che non tengono traccia dei problemi a livello locale, hanno il loro sistema di tracciamento bachi disattivato.

source: This page is mainly about the Ubuntu Touch tracker, but most principles apply to other projects as well.
fr: Cette page concerne principalement le système de suivi de problèmes d'Ubuntu Touch, mais la plupart de ces principes s'appliquent de manière similaire aux autres projets.
gl: Esta páxina eé principalmente acerca do seguidor de Ubuntu Touch, pero a maioría dos principios aplícanse aos outros proxectos tamén.
it: Questa pagina riguarda principalmente il sistema di tracciamento di Ubuntu Touch, ma la maggior parte dei princìpi si applicano pure ad altri progetti.

source: Practicality beats purity! Exceptions might apply and should be described in the projects README.md file.
fr: La pratique l'emporte sur la théorie ! Des exceptions peuvent être justifiées et doivent être décrites dans le fichier README.md des projets.
gl: A funcionalidade é mellor que a pureza! Poden haber excepcións e deben ser descritas no arquivo README.md do proxecto.
it: La praticità batte la purezza! Le eccezioni potrebbero essere applicate e dovrebbero essere descritte nel file README.md dei progetti.

source: GitHub projects
fr: Les projets GitHub
gl: Proxectos de GitHub
it: Progetti su GitHub

source: To increase transparency and communication, GitHub projects (Kanban-Boards) are used wherever practical. In case of github.com/ubports/ubuntu-touch, a single project is used for all issues. Projects support filtering by labels, so that only issues that belong to a specific team or affect a specific device can be viewed.
gl: Para incrementar a transparencia e a comunicación, os proxectos do GitHub (Kanban-Boards) úsanse sempre que sexa práctico. No caso de github.com/ubports/ubuntu-touch, faise servir un único proxecto para todos os problemas. Os proxectos dan soporte ao filtro por niveis, de maneira que só se poden ver os problemas que pertenzan a un equipo específico ou afecten a un dispositivo específico.

source: These are the standard columns:
fr: Voici les colonnes standards :
gl: Estas son as columnas estándares:
it: Queste sono le colonne standard:

source: **None (awaiting triage)**: The issue has been approved by a member of the QA team and is awaiting review from the responsible development team. if the issue is a bug, instructions to reproduce are included in the issue description. if the issue is a feature request, it has passed a primary sanity check by the qa-team but has not yet been accepted by the responsible development-team.
gl: **None (awaiting triage)**: Ningunha (esperando triaxe) - O problema está aprobado por un membro do equipo de control de calidade e está pendente de revisión por parte do equipo de desenvolvemento responsable. Se o problema é un erro, inclúense instrucións por reproducilo na descrición do problema. Se o problema é unha demanda da funcionalidade, pasou unha verificación incial de adecuación por parte do equipo de control de calidade, pero non estivo aceptada aínda por parte do equipo de desenvolvemento responsable.

source: **Accepted**: The issue has been accepted by the responsible development-team. If the issue is a bugreport, the team has decided that it should be fixable and accepts the responsibility. If the issue is a feature request, the team thinks it should be implemented as described.
gl: **Accepted**: Aceptado - o problema estivo aceptado por parte do equipo de desenvolvemento responsable. Se o problema está nun informe de erro, o equipo decidiu que se pode arranxar e aceptar a responsabilidade. Se o problema está nunha demanda de funcionalidade, o equipo pensa que se implementou como se describiu.

source: **In Development**: A patch is in development. Usually means that a developer is assigned to the issue.
fr: **In Development** (En développement) : un correctif est en développement. Cela signifie généralement qu'un développeur est assigné à ce problème.
gl: **In Development**: En desenvolvemento - Estase desenvolvendo un parche. Usualmente quere dciir que se asignou un desenvolvedor ao problema.
it: **In fase di sviluppo**: una patch è in fase di sviluppo. Normalmente significa che è stato assegnato a uno sviluppatore.

source: **Quality Assurance**: The patch is completed and has passed initial testing. The QA team will now review it and provide feedback. If problems are found, the issue is moved back to "Accepted".
gl: **Quality Assurance**: Control de calidade - Completouse o parche e pasou as comprobacións inicias. A continuación o equipo de control de calidade revisarao en todos os dispositivos e fornecerá retroalimentación. Se atopas problemas, o problema volverase a "Aceptado".

source: **Release Candidate**: The patch has passed QA and is ready for release. In case of deb-packages that are included in the system-image, the patch will be included in the next over-the-air update on the rc channel, and, if everything goes well, in the next release of the stable channel.
fr: **Release Candidate** (Version admissible) : le correctif a passé l'assurance qualité et il est prêt pour la publication. Dans le cas de paquets deb inclus dans l'image système, le correctif sera intégré dans la mise à jour suivante du canal rc, et, si tout se passe bien, dans la version suivante du canal stable.
gl: **Release Candidate** (Versión candidata): o parche pasou o control de calidade e está listo para a súa publicación. No caso de paquetes deb que están incluídos na imaxe de sistema, o parche será incluído na seguinte actualización OTA na canle versión candidata e, se todo vai ben, na seguinte publicación da canle estable.
it: **Release Candidate**: La pezza ha passato il test di QA e è pronta per essere messa in produzione. Nel caso di pacchetti deb che sono inclusi nell'immagine di sistema, la pezza si includerà nella prossima attualizzazione over-the-air o nel canale RC e, se tutto va bene, nel prossimo rilascio del canale stabile.

source: **None (removed from the project)**: If the issue is open and labeled "help wanted", community contributions are required to resolve the issue. If it's closed, that means that either a patch has been released on the stable channel (a comment on the issue should link to the patch) or the issue has been rejected (labeled "wontfix").
gl: **None (removed from the project)**: Ningunha, eliminada do proxecto. Se o problema está aberto e etiqueta como "axuda desexada", son necesarias as contribucións da comunidade para resolver o problema. Se está pechado, isto significa que se lanzou un parche na canle estable (un comentario sobre o problema debería ligalo ao parche) ou se rexeitou o problema (etiquetado "non solucionar").

source: Labels
fr: Mots-clés
gl: Etiquetas
it: Etichette

source: All issues - even closed ones - should be labeled to allow the use of GitHub's global filtering. For example, `these are all of the issues labeled 'enhancement' inside @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Consult the `GitHub help pages <https://help.github.com/articles/about-searching-on-github/>`__ for more information on search and filtering.
fr: Tous les problèmes - même ceux qui sont clos - devraient être étiquetés pour permettre l'utilisation du filtrage global de GitHub. Par exemple, `voici tous les problèmes étiquetés « enhancement » (amélioration) dans @ubports <https://github.com/search?utf8=%E 12%9C 2%93& 3q=is%3A 4open+org%3A 5ubports+label%3A 6%22f 7eature+request%22& 8type=>`_. Consulter `les pages d'aide de GitHub <https://help.github.com/articles/about-searching-on-github/>`__ pour plus d'informations sur les recherches et le filtrage.
gl: Todos os problemas - incluso os pechados - deberían ser etiquetados para permitir o uso do sistema global de filtrado de GitHub. Por exemplo `estes son todos os asuntos etiquetados 'mellora' en @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22& 8type=>`_. Consulte as `páxinas de axuda de GitHub <https://help.github.com/articles/about-searching-on-github/>`__ para máis información sobre buscas e filtrado.
it: Tutti i problemi - pure quelli chiusi - dovrebbero essere etichettati per permettere l'uso dei filtri globali di GitHub. Ad esempio, `questi sono tutti i problemi considerati 'migliorie' in @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Consulta le `pagine di aiuto di GitHub <https://help.github.com/articles/about-searching-on-github/>`__ per ulteriori informazioni nulle ricerche e i filtri.

source: Here's a list of labels that are normally used by all repositories.
fr: Voici une liste des mots-clés qui sont normalement utilisés par tous les dépôts.
gl: Aquí ten unha lista das etiquetas que usan normalmente todos os rexistros.
it: Ecco una lista di etichette che sono normalmente utilizzate da tutti i repository.
