Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: Halium is built using source code for a modified version of the Android operating system called LineageOS. The required source code is available online and needs to be downloaded and configured to build the correct Halium version for each individual device port. The table below shows which versions are required for the different Halium versions.
fr: Halium est créé à partir du code source d'une version modifiée du système d'exploitation Android appelée LineageOS. Le code source requis est disponible en ligne et doit être téléchargé et configuré pour construire la version correcte d'Halium pour chaque portage d'appareil individuel. Le tableau ci-dessous indique les versions requises pour les différentes versions d'Halium.
gl: Halium está construído usando o código fonte dunha versión modificada do sistema operativo Android chamada LineageOS. O código fonte requirido está dispoñible en liña e debe descargarse e configurarse para construír a versión correcta de Halium para cada porto de dispositivo. A táboa seguinte mostra as versións necesarias para as diferentes versións de Halium.
it: Halium è costruito utilizzando il codice sorgente per una versione modificata del sistema operativo Android chiamato LineageOS. Il codice sorgente richiesto è disponibile online e deve essere scaricato e configurato per costruire la corretta versione Halium per ogni singolo trasporto del dispositivo. La tabella seguente mostra quali versioni sono richieste per le diverse versioni Halium.

source: Android version
fr: Version d'Android
gl: Versión de Android
it: Versione Android

source: Halium version
fr: Version d'Halium
gl: Versión de Halium
it: Versione Halium

source: Overview of the porting process
fr: Aperçu du processus de portage
gl: Visión xeral do proceso de portaxe
it: Panoramica del processo di porting

source: In this first stage you will choose a target device, gather information about it and choose a suitable workstation (PC or laptop) on which to do your work.
fr: Au cours de cette première étape, vous choisirez un appareil cible, recueillerez des informations à son sujet et choisirez un poste de travail approprié (fixe ou portable) sur lequel vous pourrez travailler.
gl: Nesta primeira etapa escollerá un dispositivo de destino, recollerá información sobre el e escollerá unha estación de traballo axeitada (PC ou portátil) para facer o seu traballo.
it: In questa prima fase si sceglie un dispositivo di destinazione, raccogliere informazioni su di esso e scegliere una workstation adatta (PC o laptop) su cui fare il vostro lavoro.

source: Set up your Halium build environment and complete a test build
fr: Configurer votre environnement de construction d'Halium et effectuer un test de construction
gl: Configure o seu entorno de compilación de Halium e complete unha compilación de proba
it: Impostare il vostro ambiente di costruzione Halium e completare una costruzione di prova

source: This stage involves downloading all the relevant source code and securing the vendor blobs. You will then build the Halium boot image and system image according to the Halium guide to ensure that all your sources are set up correctly and work in unison.
fr: Cette étape consiste à télécharger tous les codes sources pertinents et à obtenir les blobs des fabricants. Vous construirez ensuite l'image de démarrage d'Halium et l'image système selon le guide d'Halium pour vous assurer que toutes vos sources sont correctement configurées et fonctionnent à l'unisson.
gl: Esta etapa implica descargar todo o código fonte relevante e protexer os blobs do fornecedor. A continuación, creará a imaxe de inicio e a imaxe do sistema de Halium segundo a guía de Halium para asegurarse de que todas as fontes estean configuradas correctamente e funcionen ao unísono.
it: Questa fase comporta il download di tutto il codice sorgente rilevante e la sicurezza dei blobs del fornitore. Si costruirà quindi l'immagine di avvio di Halium e l'immagine di sistema secondo la guida di Halium per garantire che tutte le vostre fonti siano configurate correttamente e lavorare all'unisono.

source: Build halium-boot.img and system.img for Ubuntu Touch
fr: Créer halium-boot.img et system.img pour Ubuntu Touch
gl: Construír halium-boot.img e system.img para Ubuntu Touch
it: Costruisci halium-boot.img e system.img per Ubuntu Touch

source: Now you need to modify your source tree, after which you will proceed to build the halium-boot.img and system.img to be used in your port.
fr: Vous devez maintenant modifier votre arborescence de sources, après quoi vous procéderez à la construction des fichiers halium-boot.img et system.img qui seront utilisés dans votre portage.
gl: Agora cómpre modificar a árbore de orixe e despois procederá a construír o halium-boot.img e o system.img que se usarán no seu porto.
it: Ora è necessario modificare il vostro albero sorgente, dopo di che si procederà a costruire il halium-boot.img e system.img da utilizzare nel vostro trasporto.

source: Install and debug the boot process
fr: Installer et déboguer le processus de démarrage
gl: Instale e depure o proceso de arranque
it: Installare e debug il processo di avvio

source: The goal of this stage is to successfully boot into Ubuntu Touch. You will be working from the command line.
fr: L'objectif de cette étape est de réussir à démarrer Ubuntu Touch. Vous travaillerez à partir de la ligne de commande.
gl: O obxectivo desta etapa é arrincar con éxito en Ubuntu Touch. Traballarás desde a liña de comandos.
it: L'obiettivo di questa fase è quello di avviare con successo Ubuntu Touch. Starai lavorando dalla riga di comando.

source: Bring up the Ubuntu Touch graphical user interface 'Unity 8'
fr: Ouvrir, Unity 8, l'interface utilisateur graphique d'Ubuntu Touch
gl: Visualiza a interface gráfica de usuario de Ubuntu Touch 'Unity 8'
it: Rendi l'interfaccia utente grafica Ubuntu Touch 'Unity 8'

source: This stage involves adjusting some configuration and further debugging of your build.
fr: Cette étape implique l'ajustement de certaines configurations et un débogage supplémentaire de votre compilation.
gl: Esta etapa implica axustar algunha configuración e depurar máis a súa compilación.
it: Questa fase comporta la regolazione di qualche configurazione e il debug ulteriore della vostra costruzione.

source: Complete device configuration
fr: Configuration complète de l'appareil
gl: Configuración completa do dispositivo
it: Configurazione completa del dispositivo

source: Now you need to further debug the build and adjust configuration until all broken functionality is fixed. When you complete this stage you will have a fully functional port, but it will not yet be capable of accepting Over The Air (OTA) updates.
fr: Vous devez maintenant continuer à déboguer la compilation et ajuster la configuration jusqu'à ce que toutes les fonctionnalités défectueuses soient corrigées. À l'issue de cette étape, vous disposerez d'un portage pleinement fonctionnel, mais il ne sera pas encore capable d'accepter les mises à jour OTA (Over The Air).
gl: Agora debes depurar máis a compilación e axustar a configuración ata que se solucione toda a funcionalidade quebrada. Cando complete esta etapa terá un porto totalmente funcional, pero aínda non será capaz de aceptar actualizacións Over The Air (OTA).

source: Build Ubuntu Touch recovery.img
fr: Construire l'image recovery.img d'Ubuntu Touch
gl: Construír Ubuntu Touch recovery.img

source: The Ubuntu Touch recovery image is a slightly modified recovery image that is tailored to working with the UBports installer
fr: L'image de récupération d'Ubuntu Touch est une image de récupération légèrement modifiée qui est adaptée pour fonctionner avec l'installateur d'UBports
gl: A imaxe de recuperación de Ubuntu Touch é unha imaxe de recuperación lixeiramente modificada que está adaptada para traballar co instalador de UBports

source: Set up the UBports installer for your device
fr: Configurer l'installateur d'UBports pour votre appareil
gl: Configure o instalador de UBports para o seu dispositivo

source: When you have completed this stage you will have made it possible for anyone owning the device in question to install and run Ubuntu Touch on it, including the ability to receive OTA updates as they are made available.
fr: Lorsque vous aurez terminé cette étape, vous aurez permis à toute personne possédant l'appareil en question d'installer et d'exécuter Ubuntu Touch sur celui-ci, y compris la possibilité de recevoir les mises à jour OTA dès qu'elles sont disponibles.
gl: Cando remates esta etapa, terás feito posible que calquera que teña o dispositivo en cuestión instale e execute Ubuntu Touch nel, incluída a posibilidade de recibir actualizacións OTA a medida que estean dispoñibles.

source: The challenges of the porting process
fr: Les défis du processus de portage
gl: Os retos do proceso de portaxe

source: Getting the above components to work properly together always involves an amount of time-consuming configuring and testing. However, it usually also involves a certain amount of modification to parts of the source code, and sometimes quite a bit, depending on your target device.
fr: Pour que les composants ci-dessus fonctionnent correctement ensemble, il faut toujours passer beaucoup de temps à les configurer et à les tester. Cependant, cela implique généralement aussi un certain nombre de modifications de certaines parties du code source, parfois même beaucoup en fonction de votre appareil cible.
gl: Conseguir que os compoñentes anteriores funcionen correctamente xuntos sempre implica unha longa configuración e probas. Non obstante, normalmente tamén implica unha certa cantidade de modificacións en partes do código fonte e, ás veces, bastante, dependendo do dispositivo de destino.

source: Luckily, there is a community of porters out there who are eager to see Ubuntu Touch ported to new devices. When you run into trouble, you should search the sources below (Getting help) to see if others before you have solved the issue. There are online Telegram chat groups you can join to ask for help, but please bear in mind that those participating are doing so in their spare time.
fr: Heureusement, il existe une communauté de porteurs qui sont impatients de voir Ubuntu Touch porté sur de nouveaux appareils. En cas de problème, vous devriez consulter les sources ci-dessous (Obtenir de l'aide) pour voir si d'autres avant vous ont résolu le problème. Il existe des groupes de discussion en ligne sur Telegram que vous pouvez rejoindre pour demander de l'aide, mais n'oubliez pas que les participants le font pendant leur temps libre.
gl: Afortunadamente, hai unha comunidade de porteiros que están ansiosos por ver Ubuntu Touch portado a novos dispositivos. Cando teñas problemas, debes buscar nas fontes seguintes (Obtendo axuda) para ver se outras persoas antes de resolver o problema. Hai grupos de chat de Telegram en liña aos que podes unirte para pedir axuda, pero ten en conta que os participantes o fan no seu tempo libre.

source: Prior knowledge and skills
fr: Connaissances et compétences préalables
gl: Coñecementos e habilidades previas

source: Porters come in all sizes and shapes, so to speak. Therefore, this guide does not presuppose extensive knowledge or skills in any particular field. You should, however, as a bare minimum be familiar with some common shell commands and be comfortable working from the terminal on you host PC. Furthermore, the guide is based on a host PC running Linux. If you have some knowledge of programming, this will come in handy at some point, especially if you are familiar with C / C++. Also, you should familiarize yourself with git, setup a github account and start documenting your steps as described in this guide and `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html>`_ from the very beginning.
fr: Les porteurs/euses sont de toutes tailles et de toutes formes, pour ainsi dire. Par conséquent, ce guide ne présuppose pas de connaissances ou de compétences approfondies dans un domaine particulier. Vous devez cependant, au minimum, être familiarisé avec certaines commandes courantes et être à l'aise pour travailler depuis le terminal sur votre ordinateur hôte. En outre, le guide est basé sur un ordinateur hôte fonctionnant sous Linux. Si vous avez quelques connaissances en programmation, cela vous sera utile à un moment donné, surtout si vous êtes familier avec le C / C++. De plus, vous devriez vous familiariser avec git, créer un compte Github et commencer à documenter vos étapes comme décrit dans ce guide et `le guide de portage d'Halium <http://docs.halium.org/en/latest/porting/first-steps.html>`_ dès le début.
gl: Os porteiros teñen todos os tamaños e formas, por así dicilo. Polo tanto, esta guía non supón coñecementos ou habilidades extensas en ningún campo en particular. Non obstante, debes estar familiarizado con algúns comandos de shell comúns e estar cómodo traballando desde o terminal do teu PC de acollida. Ademais, a guía está baseada nun PC host con Linux. Se tes algún coñecemento de programación, isto che resultará útil nalgún momento, especialmente se estás familiarizado con C / C ++. Ademais, debería familiarizarse con git, configurar unha conta github e comezar a documentar os seus pasos como se describe nesta guía e `a guía de portaxe de Halium <http://docs.halium.org/en/latest/porting/first-steps. html> `_ desde o principio.

source: We have attempted to give a certain amount of explanations along the way, but this guide is in not an in-depth reference into architecture and inner workings of Ubuntu Touch, and gaining a deeper understanding will consequently require an amount of research on your part.
fr: Nous avons tenté de donner un certain nombre d'explications en cours de route, mais ce guide n'est pas une référence approfondie sur l'architecture et le fonctionnement interne d'Ubuntu Touch. L'acquisition d'une compréhension plus approfondie nécessitera par conséquent un certain nombre de recherches de votre part.
gl: Intentamos dar unha certa cantidade de explicacións ao longo do camiño, pero esta guía non é unha referencia en profundidade sobre a arquitectura e o funcionamento interno de Ubuntu Touch e, para obter unha comprensión máis profunda, requirirá unha gran cantidade de investigación pola súa parte.

source: Getting community help
fr: Obtenir de l'aide de la communauté
gl: Conseguir axuda da comunidade

source: When you run into trouble, and you will, refer to one or more of the sources below:
fr: Si vous avez des problèmes, et vous en aurez, consultez une ou plusieurs des sources ci-dessous :
gl: Cando teña problemas, consulte unha ou máis das fontes seguintes:

source: `The UBports Forum <https://forums.ubports.com/category/33/porting>`_
fr: `Le forum d'UBports <https://forums.ubports.com/category/33/porting>`_
gl: `O foro de UBports <https://forums.ubports.com/category/33/porting>`_

source: IRC: #halium on Freenode
fr: IRC : #halium sur Freenode
gl: IRC: #halium en Freenode

source: General advice
fr: Conseils généraux
gl: Aviso xeral

source: The more rigorous you are at making notes and documenting your steps, the less time you will spend backtracking your steps and guessing your way along. When dealing with issues that arise along the way, it is wise to work on them one at a time. If you try to correct several things at once, you risk ending up trying to guess which changes solved a given issue, which easily leads to breaking the issue in question once more.
fr: Plus vous serez rigoureux dans la prise de notes et la documentation de vos démarches, moins vous passerez de temps à revenir sur vos pas et à chercher votre chemin. Lorsque vous traitez des questions qui se posent en cours de route, il est préférable de les traiter une à une. Si vous essayez de corriger plusieurs choses à la fois, vous risquez de vous retrouver à essayer de deviner quels changements ont résolu un problème donné, ce qui conduit facilement à casser à nouveau le correctif en question.
gl: Canto máis rigoroso estea a tomar notas e documentar os seus pasos, menos tempo dedicará a retroceder e adiviñar o seu camiño. Cando se trata de problemas que xorden no camiño, é aconsellable traballar neles de cada vez. Se tenta corrixir varias cousas á vez, corre o risco de acabar intentando adiviñar que cambios resolveu un problema determinado, o que leva facilmente a romper o problema en cuestión unha vez máis.

source: If you are not discouraged after reading this, we wish you the best of luck!
fr: Si vous n'êtes pas découragé après avoir lu ceci, nous vous souhaitons bonne chance !
gl: Se non te desanimas despois de ler isto, desexámosche moita sorte!

source: Shell access via adb
fr: Accès au shell via adb
gl: Acceso á consola a través de adb
it: Accesso alla console via adb

source: You can put your UBports device into developer mode and access a Bash shell from your PC. This is useful for debugging or more advanced shell usage.
fr: Vous pouvez mettre votre appareil UBports en mode développeur, vous permettant alors d'accéder à un shell Bash sur cet appareil depuis votre ordinateur. C'est pratique pour déboguer ou aussi pour un usage plus avancé du shell.
gl: Podes poñer o teu dispositivo UBports en modo programador e acceder a un shell Bash desde o teu PC. Isto é útil para depurar ou usar un shell máis avanzado.
it: Puoi impostare il tuo dispositivo UBports in modalità sviluppatore e dal tuo PC accedere alla console. Questo è comodo per il debugging o per utilizzi avanzati della console stessa.

source: Install ADB
fr: Installer ADB (Android Debug Bridge)
gl: Instalar ADB
it: Installare ADB

source: First, you'll need ADB installed on your computer.
fr: Tout d'abord, il est nécessaire d'installer ADB sur votre ordinateur.
gl: En primeiro lugar, necesitarías instalado ADB no teu computador.
it: Per prima cosa avrai bisogno di installare ADB sul tuo computer.

source: On Ubuntu::
fr: Sur Ubuntu::
gl: En Ubuntu::
it: Su Ubuntu::

source: On Fedora::
fr: Sur Fedora::
gl: En Fedora::
it: Su Fedora::

source: And on MacOS with `Homebrew <https://brew.sh>`_::
fr: Et sur MacOS avec `Homebrew <https://brew.sh>`_::
gl: E en MacOS con `Homebrew <https://brew.sh>`_::
it: E su MacOs con `Homebrew <https://brew.sh>`_::

source: For Windows, grab the command-line tools only package from `developer.android.com <https://developer.android.com/studio/index.html#downloads>`_.
fr: Pour Windows, récupérez seulement le paquet correspondant aux outils en lignes de commande depuis `cet endroit <https://developer.android.com/studio/index.html#downloads>`_.
gl: Para Windows, colle o paquete só de ferramentas de liña de comandos de `developer.android.com <https://developer.android.com/studio/index.html#downloads>` _.
it: Per Windows, procurati il pacchetto strumenti a sola riga di comando da `developer.android.com <https://developer.android.com/studio/index.html#downloads>`_.

source: Enable developer mode
fr: Activer le mode développeur
gl: Habilitar o modp de desenvolvedor
it: Abilita la modalità sviluppatore

source: Next, you'll need to turn on Developer Mode.
fr: Ensuite, vous devrez activer le mode développeur.
gl: A continuación, necesitarás activar o modo de desenvolvedor.
it: Poi, dovrai attivare la Modalità Sviluppatore.

source: Reboot your device
fr: Redémarrez votre appareil
gl: Reiniciar o seu dispositivo
it: Riavvia il tuo dispositivo

source: Place your device into developer mode (Settings - About - Developer Mode - check the box to turn it on)
fr: Activez le mode développeur (Paramètres système - À propos de - Mode développeur - cochez la case pour l'activer)
gl: Coloca o dispositivo no modo de programador (Configuración - Sobre - Modo de programador: marca a caixa para acendelo)
it: Imposta il tuo dispositivo in modalità sviluppatore (Impostazioni - Informazioni - Modalità Sviluppatore - seleziona la casella per attivarla)

source: Plug the device into a computer with adb installed
fr: Branchez l'appareil sur l’ordinateur où adb est installé
gl: Conecte o dispositivo a un ordenador con adb instalado
it: Collega il dispositivo al computer con ADB installato

source: Open a terminal and run ``adb devices``.
fr: Ouvrez un terminal et lancez ``adb devices``.
gl: Abre un terminal e executa "dispositivos adb".
it: Apri il terminale ed esegui ``adb devices``.

source: When you're done using the shell, it's a good idea to turn Developer Mode off again.
fr: Une fois que vous avez fini d'utiliser le shell, c'est une bonne pratique de désactiver le mode développeur.
gl: Cando remates de usar o shell, é unha boa idea desactivar o modo de programador de novo.
it: Al termine dell'utlizzo della shell, è consigliato disabilitare la Modalità Sviluppatore.

source: If there's a device in the list here (The command doesn't print "List of devices attached" and a blank line), you are able to use ADB successfully. If not, continue to the next section.
fr: S'il y a bien un appareil dans cette liste (La commande n’affiche pas "List of devices attached" et une ligne vide), vous devriez alors pouvoir utiliser ADB avec succès. Sinon, continuez à la rubrique suivante.
gl: Se hai un dispositivo na lista aquí (o comando non imprime "Lista de dispositivos conectados" e unha liña en branco), pode usar ADB con éxito. Se non, continúa coa seguinte sección.
it: Se c'è un dispositivo in questa lista (il comando non mostra "Lista dei dispositivi collegati" e una linea vuota), puoi usare con successo ADB. In caso contrario passa alla sezione successiva.

source: Adb shell commands::
fr: Commandes adb shell ::
gl: Comandos do shell adb::
it: Comandi Adb da shell::

source: Additional Adb commands::
fr: Commandes supplémentaires adb ::
gl: Comandos adicionais adb::
it: Comandi Adb addizionali::

source: For more ADB commands refer to the `official documentation <https://developer.android.com/studio/command-line/adb>`_.
fr: Pour plus de commandes adb, consultez la `documentation officielle <https://developer.android.com/studio/command-line/adb>`_.
gl: Para obter máis comandos ADB consulte a `documentación oficial <https://developer.android.com/studio/command-line/adb>` _.
it: Per ulteriori comandi ADB fare riferimento alla `documentazione ufficiale <https://developer.android.com/studio/command-line/adb>`_.

source: Add hardware IDs
fr: Ajouter des identifiants de matériels
gl: Engadir os identificadores da máquina
it: Aggiungere gli identificativi (IDs) hardware

source: ADB doesn't always know what devices on your computer it should or should not talk to. You can manually add the devices that it does not know how to talk to.
fr: ADB n'arrive pas toujours à déterminer à quels appareils sur votre PC il doit parler ou pas. Vous pouvez ajouter manuellement l'appareil auquel il ne sait pas comment parler.
gl: ADB non sempre sabe con que dispositivos do seu ordenador debe ou non falar. Podes engadir manualmente os dispositivos cos que non sabe falar.
it: ADB non sempre sa con quali dispositivi collegati al tuo computer può o non può comunicare. Puoi aggiungere manualmente i dispositivi con cui possa comunicare.
