Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: `Română <https://docs.ubports.com/ro/latest/>`_
fr: `Roumain <https://docs.ubports.com/ro/latest/>`_
gl: `Romano <https://docs.ubports.com/ro/latest/>`_
it: `Rumeno <https://docs.ubports.com/ro/latest/>`_

source: `Русский <https://docs.ubports.com/ru/latest>`_
fr: `Russe <https://docs.ubports.com/ru/latest>`_
gl: `Ruso <https://docs.ubports.com/ru/latest>`_

source: `Türkçe <https://docs.ubports.com/tr/latest/>`_
fr: `Turc <https://docs.ubports.com/tr/latest/>`_
gl: `Turco <https://docs.ubports.com/tr/latest/>`_
it: `Turco <https://docs.ubports.com/tr/latest/>`_

source: `Simplified Chinese <https://docs.ubports.com/zh_CN/latest/>`_
fr: `Chinois simplifié <https://docs.ubports.com/zh_CN/latest/>`_
gl: `Chinés simplificado <https://docs.ubports.com/zh_CN/latest/>`_

source: Preparations
fr: Préparatifs
gl: Preparativos
it: Preparazioni

source: Not all devices can be made to run Ubuntu Touch. Research your target device before you start.
fr: Tous les appareils ne sont pas conçus pour fonctionner avec Ubuntu Touch. Faites des recherches sur l'appareil cible avant de commencer.
gl: Non se poden facer todos os dispositivos para executar Ubuntu Touch. Busque o dispositivo de destino antes de comezar.

source: To determine your device's specifications, search for it on `GSM Arena <https://www.gsmarena.com>`_ and/or `Device Specification <https://www.devicespecifications.com/en>`_.
fr: Pour déterminer les spécifications de votre appareil, recherchez-le sur `GSM Arena <https://www.gsmarena.com>`_ et/ou `Device Specifications <https://www.devicespecifications.com/fr>`_.
gl: Para determinar as especificacións do seu dispositivo, busque en `GSM Arena <https://www.gsmarena.com>` _ e / ou `Especificación do dispositivo <https://www.devicespecifications.com/en>` _.

source: Refer to the `Halium Porting Guide <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>`_ for further information on requirements and how to check if your device qualifies.
fr: Reportez-vous au « Guide de portage d'Halium » <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>`_ pour plus d'informations sur les exigences et la façon de vérifier si votre appareil remplit les conditions requises.
gl: Consulte a `Halium Porting Guide <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>` _ para obter máis información sobre os requisitos e como comproba se o teu dispositivo é apto.

source: Locate relevant guides and other information
fr: Trouver les guides et autres informations pertinentes
gl: Localiza guías relevantes e outra información

source: If your desired target device complies to the above, the next thing to do is to locate the available guides and other documentation. This step will help you later on when you run into issues developing your port. For now, the main thing to look for is how to unlock your bootloader. (See below).
fr: Si l'appareil cible que vous souhaitez utiliser est conforme à ce qui précède, la prochaine chose à faire est de trouver les guides et autres documents disponibles. Cette étape vous aidera plus tard lorsque vous rencontrerez des problèmes pour développer votre portage. Pour l'instant, la principale chose à rechercher est la manière de déverrouiller votre programme de démarrage (voir ci-dessous).
gl: Se o dispositivo de destino desexado cumpre o anterior, o seguinte é facer localizar as guías dispoñibles e outra documentación. Este paso axudaralle máis tarde cando teña problemas para desenvolver o teu porto. Polo de agora, o principal que hai que buscar é como desbloquear o cargador de arranque. (Ver abaixo).

source: Head over to the `LineageOS Wiki <https://wiki.lineageos.org/>`_. Look up your device and read and bookmark the guides that are listed there. Try a web search for additional information, specifying both its retail name and the code name you found on the LineageOS site. Be careful to check that the information you gather applies to your specific device, keeping in mind that many devices are sold in a number of different variants with different hardware specifications.
fr: Rendez-vous sur le wiki `LineageOS <https://wiki.lineageos.org/>`_. Cherchez votre appareil, lisez et mettez dans vos favoris les guides qui y sont répertoriés. Essayez une recherche sur internet pour obtenir des informations supplémentaires, en précisant à la fois son nom de vente et le nom de code que vous avez trouvé sur le site de LineageOS. Veillez à vérifier que les informations que vous avez recueillies s'appliquent à votre appareil spécifique, en gardant à l'esprit que de nombreux appareils sont vendus dans un certain nombre de variantes différentes avec des spécifications matérielles différentes.
gl: Diríxete ao `LineageOS Wiki <https://wiki.lineageos.org/>` _. Busque o dispositivo e lea e marque as guías que figuran alí. Probe a buscar na web para obter información adicional, especificando o seu nome de venda polo miúdo e o nome de código que atopou no sitio de LineageOS. Teña coidado de comprobar que a información que recolle se aplica ao seu dispositivo específico, tendo en conta que moitos dispositivos véndense en varias variantes diferentes con especificacións de hardware diferentes.

source: Another rich source of information is the `XDA Developers Forum <https://www.xda-developers.com/>`_.
fr: Une autre source d'information intéressante est le `Forum des développeurs de XDA<https://www.xda-developers.com/>`_.
gl: Outra fonte rica de información é o `XDA Developers Forum <https://www.xda-developers.com/>` _.

source: Unlock the bootloader
fr: Déverrouiller le programme de démarrage
gl: Desbloquee o cargador de arranque

source: Vendors usually provide their devices in a locked bootloader state. This is a kind of software "seal" intended to prevent modifications directly to the operating system and system software. If you unlock the bootloader, you will be able to make such modifications, but in this state your device's warranty might be void. The choice is yours, but this step is mandatory if you wish to install Ubuntu Touch on the device.
fr: Les fabricants fournissent généralement leurs appareils avec un programme de chargement verrouillé. Il s'agit d'une sorte de «sceau » logiciel destiné à empêcher toute modification directe du système d'exploitation et des logiciels système. Si vous déverrouillez le programme de démarrage, vous pourrez effectuer des modifications, mais dans cet état, la garantie de votre appareil pourrait être annulée. Le choix vous appartient, mais cette étape est obligatoire si vous souhaitez installer Ubuntu Touch sur l'appareil.
gl: Os vendedores normalmente proporcionan os seus dispositivos nun estado de cargador de arranque bloqueado. Este é un tipo de "selo" de software destinado a evitar modificacións directamente no sistema operativo e no software do sistema. Se desbloqueas o cargador de arranque, poderás facer estas modificacións, pero neste estado a garantía do teu dispositivo pode ser nula. A elección é túa, pero este paso é obrigatorio se desexas instalar Ubuntu Touch no dispositivo.

source: Devices differ and there is no general method that covers all makes and models. Therefore, you need to check the aforementioned guides for instructions on how to unlock the bootloader of your particular device.
fr: Les appareils sont tous différents et il n'existe pas de méthode générale qui couvre toutes les marques et tous les modèles. Par conséquent, vous devez consulter les guides mentionnés ci-dessus pour savoir comment déverrouiller le programme de démarrage de votre appareil en particulier.
gl: Os dispositivos difiren e non hai ningún método xeral que abrangue todas as marcas e modelos. Polo tanto, cómpre consultar as mencionadas guías para obter instrucións sobre como desbloquear o cargador de arranque do seu dispositivo en particular.

source: Install TWRP recovery
fr: Installer l'image de récupération TWRP
gl: Instalar recuperación TWRP

source: You need to install a custom recovery image on your device in order to handle formatting and flashing image files onto it. Head over to the `Team Win Recovery Project <https://twrp.me/Devices/>`_ and locate the image file for your device. Follow the installation instructions provided on the website.
fr: Vous devez installer une image de récupération personnalisée sur votre appareil afin de gérer le formatage et l'écriture des fichiers d'image sur celui-ci. Rendez-vous sur le site de `Team Win Recovery Project <https://twrp.me/Devices/>`_ et localisez le fichier image pour votre appareil. Suivez les instructions d'installation fournies sur le site.
gl: Debe instalar unha imaxe de recuperación personalizada no seu dispositivo para xestionar o formato e o intermitencia de ficheiros de imaxe nel. Diríxete ao `Proxecto de recuperación de vitorias en equipo <https://twrp.me/Devices/>` _ e localiza o ficheiro de imaxe do teu dispositivo. Siga as instrucións de instalación fornecidas no sitio web.

source: Recommendations for the host/build PC
fr: Recommandation pour le PC hôte/de build
gl: Recomendacións para o PC host / build

source: The remainder of this guide presumes you are using a build PC running Linux. Although high performance always is nice, stability and sufficient RAM and harddisk space are the main concerns here. You do not need the latest and the best hardware, nor do you need the latest distribution release. In fact, it is not uncommon to run into issues when choosing the very newest release, as some of the software needed may not yet have been built for it. For example, as of writing the latest release of Ubuntu Linux is 20.04, but many still recommend using the previous long term support release, 18.04.
fr: La suite de ce guide part du principe que votre PC de build tourne sous Linux. Bien que de hautes performances soient toujours préférables, la stabilité ainsi que la RAM et l'espace disque disponible restent les points les plus importants. Vous n'avez pas besoin d'un PC de dernière génération ni de la dernière version de votre distro. Au contraire, il n'est pas rare de rencontrer des problèmes en cas d'utilisation de distros trop récentes car certains programmes ne les supportent parfois pas encore. Par exemple, au moment de l'écriture de ce guide, Ubuntu 20.04 est la version stable la plus récente disponible, cependant nous recommandons encore l'utilisation de la précédente version, à savoir Ubuntu 18.04.
gl: O resto desta guía presume de que está a usar un PC de compilación con Linux. Aínda que o alto rendemento sempre é bo, a estabilidade e a memoria RAM suficiente e o espazo no disco duro son as principais preocupacións aquí. Non precisa o hardware máis recente e o mellor, nin a versión de distribución máis recente. De feito, non é raro ter problemas ao elixir a versión máis recente, xa que é posible que algúns dos programas necesarios aínda non estean construídos para iso. Por exemplo, a partir de escribir a última versión de Ubuntu Linux é o 20.04, pero moitos aínda recomendan usar a versión anterior de soporte a longo prazo, 18.04.

source: Having completed the steps above, you are now ready to set up your build environment and start the porting process per se (next section).
fr: Après avoir compléter les étapes précédentes, vous êtes maintenant prêt pour mettre en place votre environnement de compilation, ainsi que de démarrer le processus de potage (voir prochaine section).
gl: Unha vez completados os pasos anteriores, agora está listo para configurar o seu entorno de compilación e iniciar o proceso de portaxe en si (seguinte sección).

source: Configuring the UBports installer
fr: Configurer l'Installateur UBports
gl: Configurando o instalador de UBports

source: *Work in progress*
fr: *Travaux en cours*
gl: *Traballo en curso*

source: For the time being, Halium 7.1 porters should refer to the UBports porting notes on `the UBPorts installer and System image <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System-Image-(Halium-7.1)>`_.
fr: Pour l'instant, les porteurs utilisant Halium 7.1 devraient se référer aux notes de portage UBports à propos du `Système d'image ainsi que l'installateur UBports <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System-Image-(Halium-7.1)>`_.
gl: Polo momento, os portadores Halium 7.1 deberían consultar as notas de portaxe de UBports no `Instalador de UBPorts e na imaxe do sistema <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System -Imaxe- (Halium-7.1)> `_.

source: Building UBports recovery
fr: Compiler l'image de récupération UBports
gl: Construír unha imaxe de reucperación UBports

source: Building the images
fr: Compilation de l'image
gl: Construíndo imaxes

source: A Halium 7.1 - Ubuntu Touch port consists of the following parts:
fr: Un portage d'Ubuntu Touch utilisant Halium 7.1 se décompose suivant ces étapes :
gl: Halium 7.1 - Un porto de Ubuntu Touch que consta das seguintes partes:

source: The boot image, halium-boot.img
fr: L'image de démarage, halium-boot.img
gl: A imaxe de arranque, halium-boot.img

source: The system image, system.img
fr: L'image système, system.img
gl: A imaxe do sistema, system.img

source: The UBports - Ubuntu Touch - root file system (hereafter referred to as the *rootfs*)
fr: La racine du système de fichier de UBports - Ubuntu Touch - (référée à partir de maintenant comme étant le "rootfs")
gl: O sistema de ficheiros raíz UBports - Ubuntu Touch - (en adiante denominado * rootfs *)

source: The boot image contains the Linux kernel, the heart of the operating system, which needs to be built from source code for each specific device. The system image is also specific to the device and is similarly built from source code. The rootfs, on the other hand, is maintained by the UBports project and is downloadable in the form of a prebuilt .tar.gz bundle which is then installed together with the system.img.
fr: L'image de démarrage contient le noyau Linux, le cœur du système d'exploitation, qui a besoin d'être recompilé pour chaque appareil différent. L'image système est également spécifique à chaque appareil et est, elle aussi, compilée depuis le code source. Le rootfs, quant à lui, est maintenu par le projet UBports et est téléchargeable sous forme d'une archive .tar.gz et est installée en même temps que le system.img.
gl: A imaxe de inicio contén o núcleo de Linux, o corazón do sistema operativo, que cómpre construír a partir do código fonte de cada dispositivo específico. A imaxe do sistema tamén é específica do dispositivo e está construída de xeito similar a partir do código fonte. Por outra banda, o rootfs é mantido polo proxecto UBports e pode descargarse en forma dun paquete .tar.gz predefinido que se instala despois xunto co system.img.

source: Build the Halium system image
fr: Compilation de l'image système Halium
gl: Construír a imaxe

source: First you need to build the Halium system image according to the Halium porting guide. This is not a build you need to install. It is simply a preparation for the actual build for your port. In other words it a test to confirm that you have set up a viable source tree that can be used to do the final build.
fr: La première chose à faire de compiler l'image système Halium conformément au guide de portage. Ce ne sont pas images à installer directement. Il s'agit uniquement d'un prérequis pour le portage de votre appareil. En d'autres mots, c'est un test pour confirmer que vous avez configurer un environnement de développement viable qui peut être utilisé pour faire les images finales.
gl: Primeiro cómpre construír a imaxe do sistema Halium segundo a guía de portada Halium. Esta non é unha versión que cómpre instalar. Simplemente é unha preparación para a construción real do seu porto. Noutras palabras, é unha proba para confirmar que configurou unha árbore de fontes viable que se pode usar para facer a compilación final.

source: Head over to `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html#set-up-your-build-device>`_ and follow the steps described there remembering that you are building Halium 7.1.
fr: Avant de commencer, dirigez-vous vers `le guide du portage d'Halium <http://docs.halium.org/en/latest/porting/first-steps.html#set-up-your-build-device>`_ et suivez les instructions décrites là-bas, tout en vous rappelant que vous faîtes un portage pour Halium 7.1.
gl: Diríxete á `guía de portaxe de Halium <http://docs.halium.org/en/latest/porting/first-steps.html#set-up-your-build-device>` _ e sigue os pasos alí descritos recordando que está a construír Halium 7.1.

source: Once the system image has been successfully built (without errors), you then know that your source tree is correctly set up to proceed. You then return here and proceed.
fr: Une fois que l'image système a correctement été compilée (sans erreurs), vous saurez que votre environnement de développement est correctement configuré. Vous pourrez alors revenir ici et faire la suite.
gl: Unha vez que a imaxe do sistema se creou con éxito (sen erros), entón vostede sabe que a súa árbore de orixe está configurada correctamente para continuar. Volve aquí e continúa.

source: Build the images for Ubuntu Touch
fr: Compilation des images pour Ubuntu Touch
gl: Construír imaxes para Ubuntu Touch

source: Fix mount points
fr: Correction des points de montage
gl: Arranxo das montaxes

source: Halium-boot's ``mount`` is not aware of SELinux contexts. If your device's file system table (``fstab`` file) includes any contexts, the partition that they are on will fail to mount and your port will not work correctly.
fr: Le ``mount`` d'halium-boot n'est pas informé des contextes SELinux. Si le fichier ``fstab`` de vos appareils inclut des contextes, la partition sur laquelle ils sont n'arrivera pas à être montée et votre portage ne fonctionnera pas correctement.
gl: O "monte" de Halium-boot non é consciente dos contextos SELinux. Se a táboa do sistema de ficheiros do seu dispositivo (ficheiro "fstab") inclúe algún contexto, a partición na que se atopará fallará ao montarse e o seu porto non funcionará correctamente.

source: Start by locating your fstab file. This will commonly be inside ``BUILDDIR/device/MANUFACTUER/CODENAME/rootdir/etc`` (e.g. for the Samsung S7 - codename *herolte*: ``halium/device/samsung/herolte/rootdir/etc``) and it is named either ``fstab.qcom`` or ``fstab.devicename``. Open the file for editing.
fr: La première étape de ce processus consiste à déterminer où se trouve votre fichier fstab. La plupart du temps, il est à l'intérieur de ``BUILDDIR/device/CONSTRUCTEUR/NOM_DE_CODE/rootdir/etc``(ex. pour le Samsung S7 - nom de code *herolte* : ``halium/device/samsung/herolte/rootdir/etc``) et il est appelé soit ``fstab. qcom`` soit ``fstab. devicename``. Ouvrez le fichier pour le modifier.
gl: Comeza localizando o ficheiro fstab. Isto normalmente estará dentro de "BUILDDIR / device / MANUFACTUER / CODENAME / rootdir / etc" (por exemplo, para o Samsung S7 - nome en clave * herolte *: "halium / device / samsung / herolte / rootdir / etc") e chámase "fstab.qcom" ou "fstab.devicename". Abre o ficheiro para editalo.

source: If the type of the 'data' or 'userdata' partition is ``f2fs``, you need to change it to ``ext4``.
fr: Si le type de la partition « data » ou « userdata » est ``f2fs``, il est nécessaire de la changer en ``ext4``.
gl: Se o tipo de partición "datos" ou "datos de usuario" é "f2fs", cómpre cambialo a "ext4".

source: With the file open, remove all ``context=`` options from all block devices in the file. The option will start at the text ``context=`` and end at the comma following it.
fr: Une fois le fichier ouvert, supprimez toutes les options ``context=`` de tous les dispositifs de blocs dans le fichier. L'option démarrera au niveau du texte ``context=`` et se terminera à la virgule suivante.
gl: Co ficheiro aberto, elimina todas as opcións "context =" de todos os dispositivos de bloqueo no ficheiro. A opción comezará no texto "contexto =" e rematará na coma seguinte.

source: For example, the line ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` should become ``ro,nosuid,nodev,barrier=0``
fr: Par exemple, la ligne ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` doit devenir ``ro,nosuid,nodev,barrier=0``
gl: Por exemplo, a liña "ro, nosuid, nodev, context = u: object_r: firmware_file: s0, barreira = 0" debería converterse en "ro, nosuid, nodev, barreira = 0"
it: Per esempio, la linea ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` deve diventare ``ro,nosuid,nodev,barrier=0``

source: Save and exit.
fr: Enregistrer et quitter.
gl: Gardar e saír.
it: Salvare e uscire.

source: Edit kernel config
fr: Modification de la configuration du noyau
gl: Edición da configuración do núcleo
it: Modifica la configurazione del kernel

source: Ubuntu Touch requires a slightly different kernel config than Halium, including enabling Apparmor. This is done using a script, ``check-kernel-config``, which is included in the halium-boot repository. Simply run it on your config as follows::
fr: Ubuntu Touch a besoin d'une configuration de noyau légèrement différente de celle d'Halium, intégrant l'activation d'Apparmor. Cela est possible en utilisant un script, ``check-kernel-config``, qui est inclus dans le répertoire « halium-boot ». Exécutez-le tout simplement sur votre configuration comme indiqué ci-dessous ::
gl: Ubuntu Touch require unha configuración do núcleo lixeiramente diferente á de Halium, incluída a habilitación de Apparmor. Isto faise usando un script, "check-kernel-config", que está incluído no repositorio halium-boot. Simplemente execútao na súa configuración do seguinte xeito:

source: You may have to do this twice. It will likely fix things both times. Then, run the script without the ``-w`` flag to see if there are any more errors. If there are, fix them manually. Once finished, run the script without the ``-w`` flag one more time to make sure everything is correct.
fr: Vous devrez peut-être le faire deux fois. Cela va probablement corriger les choses les deux fois. Lancez ensuite le script sans l'indicateur ``-w`` pour voir s'il y a d'autres erreurs. S'il y en a, corrigez-les manuellement. Une fois terminé, lancez le script sans le l'indicateur ``-w``` une fois de plus pour vous assurer que tout est correct.
gl: Pode que teñas que facelo dúas veces. Probablemente arranxará as cousas as dúas veces. A continuación, execute o script sen a marca "-w" para ver se hai máis erros. Se os hai, solucionalos manualmente. Unha vez rematado, execute o script sen a marca "-w" unha vez máis para asegurarse de que todo está correcto.
it: Devi farlo due volte. Dovrebbe risolvere in entrambe. Quindi, esegui lo script con il flag ``-w`` per vedere se c'è qualche altro errore. In caso ci fossero, risolvili manualmente. Una volta terminato, esegui lo script senza il flag ``-w`` di nuovo e accertati che ogni cosa sia corretta.

source: Ubuntu Touch requires setting console=tty0
fr: Ubuntu Touch requière le paramètre ``console=tty0``
gl: Ubuntu Touch require configurar console = tty0
