Repository: Caedorus/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr, gl, it

source: `sunxi <https://linux-sunxi.org>`_ community is where much of the `mainlining effort <https://linux-sunxi.org/Linux_mainlining_effort>`_ for Allwinner devices including the PinePhone takes place. Note their `build instructions <https://linux-sunxi.org/Mainline_Kernel_Howto>`_.
it: `comunità sunxi <https: linux-sunxi.org="">`_ è dove gran parte dello sforzo principale <https:// linux-sunxi.org/Linux_mainlining_effort>`_ per i dispositivi Allwinner compreso il PinePhone ha luogo. Notare le istruzioni `build <https: linux-sunxi.org/Mainline_Kernel_Howto>`_.

source: You need then to transfer your public key to your device. There are multiple ways to do this. For example:
fr: Ensuite, vous devez transférer votre clé publique sur votre appareil. Il y a plusieurs façons de faire cela. Par exemple :
it: Devi quindi trasferire la tua chiave pubblica sul tuo dispositivo. Ci sono molti modi per farlo. Per esempio:

source: `askubuntu.com: How can I access my Ubuntu phone over ssh? <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041>`_
fr: `askubuntu.com : Comment puis-je accéder à mon téléphone Ubuntu phone via ssh ? <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041>`_
it: `askubuntu.com: Come posso accedere al mio telefono Ubuntu tramite ssh? <Https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041> `_

source: `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_: ``ubports-installer-<version-number>.exe``
fr: `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_ : ``ubports-installer-<numero-de-version>.exe``
it: `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_: ``ubports-installer-<numero-versione>.exe``

source: `macOS <https://devices.ubuntu-touch.io/installer/?package=dmg>`_: ``ubports-installer-<version-number>.dmg``
fr: `macOS <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ : ``ubports-installer-<numero-de-version>.dmg``
it: `macOS <https://devices.ubuntu-touch.io/installer/?package=dmg>`_: ``ubports-installer-<numero-versione>.dmg``

source: If you're an experienced android developer and want to help us bring Ubuntu Touch to more devices, visit the :doc:`porting section </porting/Intro>`.
fr: Si vous êtes un développeur ou une développeuse Android expérimenté(e) et que vous souhaitez nous aider à porter Ubuntu Touch sur d'autres appareils, visitez la :doc:` section de portage </porting/introduction>`.
it: Se sei uno sviluppatore Android esperto e vuoi aiutarci a portare Ubuntu Touch su ulteriori dispositivi, visita la :doc: `sezione porting </porting/introduction>`.

source: `Bq M10 FHD <https://storage.googleapis.com/otas/2015/Tablets/Freezer%20FHD/Ubuntu/OTA_15/frieza-image-stable-8.zip>`_ (*frieza*)
it: `Bq M10 FHD <https://storage.googleapis.com/otas/2015/Tablets/Freeze%20FHD/Ubuntu/OTA_15/frieza-image-stable-8.zip>`_ (*frieza*)

source: bool
fr: booléen

source: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/>`__
fr: `Lisez la documentation <https://docs.ubuntu.com/phone/en/platform/>`__

source: `Italiano <https://docs.ubports.com/it/latest/>`_
fr: `Italien <https://docs.ubports.com/it/latest/>`_

source: Note that as a rule of thumb, the method described below applies if the file you need to edit can be found in the /etc directory (or a subdirectory of this) on your device. You should not attempt to overwrite files located elsewhere with overlay files using this method.
fr: Notez qu'en règle générale, la méthode décrite ci-dessous s'applique si le fichier que vous devez modifier se trouve dans le répertoire /etc (ou un sous-répertoire de celui-ci) de votre appareil. Vous ne devez pas tenter d'écraser des fichiers situés ailleurs avec des fichiers de superposition en utilisant cette méthode.

source: PPI
fr: Pixels par pouce

source: Px/GU
fr: Pixels par Unité de Grille

source: ASUS Nexus 7
fr: Nexus 7 d'ASUS

source: Samsung Galaxy Nexus
fr: Galaxy Nexus de Samsung

source: LG Nexus 4
fr: Nexus 4 de LG

source: Samsung Nexus 10
fr: Nexus 10 de Samsung

source: LG Nexus 5
fr: Nexus 5 de LG
